[
  {
    "id": "2025-12-16-top-ai-agentic-workflow-patterns",
    "title": "Top AI Agentic Workflow Patterns",
    "date": "2025-12-16",
    "preview": "顶尖的 AI Agent 工作流模式 ByteByteGo 2025年12月15日  259 3 15 分享 仅仅通过提示词（prompt）进行调整只能达到有限的效果。(赞助内容) 大多数公司都困于提示词的反复调整，并疑惑为什么他们的 AI Agent 无法提供可靠的结果。 这份...",
    "content": "顶尖的 AI Agent 工作流模式\nByteByteGo\n2025年12月15日\n\n259\n3\n15\n分享\n仅仅通过提示词（prompt）进行调整只能达到有限的效果。(赞助内容)\n大多数公司都困于提示词的反复调整，并疑惑为什么他们的 AI Agent 无法提供可靠的结果。\n这份来自 You.com 的指南\n深入剖析了 Agent 管理的演进，揭示了构建成功 AI Agent 的五个阶段，以及为何大多数组织尚未达到这些阶段。\n在本指南中，你将学到：\n*   为什么仅靠提示词不足以解决问题，以及上下文和元数据如何解锁可靠的 Agent 自动化。\n*   计算投资回报率（ROI）的四种基本方法，以及何时、如何使用每种指标。\n*   Agent 管理各个阶段的真实挑战，以及如何避免它们。\n超越提示词：获取指南。\n当我们首次与大型语言模型（LLM）交互时，体验是直接的。我们输入一个提示词，模型生成一个响应，交互结束。\n这种单轮（single-turn）方法适用于简单问题或基本内容生成，但当我们处理更复杂的任务时，它很快就会暴露出局限性。想象一下，要求 AI 分析市场趋势、创建一份全面的报告并提供可操作的建议。一个单独的响应，无论多么精心制作，往往都会显得不足，因为它缺乏获取额外信息、反思其推理或根据反馈改进其输出的机会。\n这就是 agentic 工作流发挥作用的地方。\nagentic 工作流不是将 AI 交互视为一次性事务，而是引入了迭代过程、工具集成和结构化问题解决方法。这些工作流将语言模型从复杂的文本生成器转变为能分解复杂问题、调整策略并生成更高质量结果的能干 Agent。这种差异类似于将快速草图与精心完善的绘画进行比较。两者都有其用途，但当质量和可靠性至关重要时，迭代方法更胜一筹。\n在本文中，我们将探讨最流行的 agentic 工作流模式及其工作原理。\n\n理解 Agentic 工作流\n一个 agentic 工作流不仅仅是对单个指令做出响应。相反，它以一定程度的自主性运行，决定如何处理任务、采取哪些步骤以及如何根据发现进行调整。这代表了我们思考如何使用 AI 系统方式的根本性转变。\n考虑一下向一个基本聊天机器人和一个 agentic 系统寻求帮助撰写研究报告之间的区别。基本聊天机器人接收我们的请求，根据其训练数据生成报告，并在一次响应中交付所有内容。然而，一个 agentic 系统可能会首先在网上搜索有关该主题的最新信息，然后将发现组织成主题，起草报告的各个部分，审查每个部分的准确性和连贯性，修改薄弱区域，最后将所有内容编译成一份完善的文档。这些步骤中的每一个都可能涉及多个子步骤、关于使用哪些工具的决策，以及根据 Agent 发现的调整。\n使工作流真正具有 agentic 特性的是过程中内置的迭代和反馈循环。agentic 工作流不是一次性生成输出，而是涉及 Agent 采取行动、观察结果并利用该观察来指导下一步行动的循环。这反映了人类实际解决复杂问题的方式。我们很少能预先弄清楚所有事情并执行一个完美的计划。相反，我们尝试一些东西，看看会发生什么，从结果中学习，然后调整我们的方法。agentic 工作流为 AI 系统带来了这种相同的适应性、迭代性。\n\n五种基本 Agentic 工作流模式\n现在让我们来看看五种基本的 agentic 工作流模式：\n\n1. 反思模式（Reflection Pattern）：自我改进的 Agent\n反思的核心是让 Agent 审查并批判自己的工作，然后根据批判进行修改。这个简单的想法提高了输出质量，因为它引入了一个迭代的精炼过程，可以捕获错误、识别弱点并增强优势。\n以下是反思循环在实践中的工作方式：\nAgent 首先根据接收到的任务或提示词生成初始输出。\n然后，Agent 不会立即将此输出作为最终结果呈现，而是切换到批判模式。它检查自己刚刚生成的内容，寻找问题、不一致、缺乏清晰度的区域或改进的机会。这种批判成为修订的基础。\nAgent 生成一个改进版本，解决其识别出的问题。根据实现方式，这个循环可能会重复多次，每次迭代都会进一步完善输出。\n请看下图：\n当我们将批判类型进行专业化时，反思的力量变得更加明显。例如：\n*   Agent 可能会专门反思准确性，检查其所陈述的事实和主张是否正确并有充分支持。\n*   或者，反思可能侧重于清晰度，询问不熟悉该主题的人是否能理解解释。\n*   对于创意写作，反思可能会评估语气，确保声音与预期的风格和受众相匹配。\n*   对于代码生成，反思可以侧重于识别 bug、安全漏洞或优化性能的机会。\n反思模式最适用于质量比速度更重要，并且存在受益于审查的主观方面的任务。然而，对于答案直截了当的简单事实查询，或者速度至关重要且“足够好”就足以满足要求的任务，这种模式则不太必要。\n\n2. 工具使用模式（Tool Use Pattern）\n工具使用模式代表了 AI Agent 能够完成的任务的根本性扩展。\n一个语言模型本身，无论多么复杂，都局限于推理它在训练期间学到的信息，并根据这些知识生成文本。它无法访问最新信息，无法用大数字进行精确计算，无法从特定数据库检索数据，也无法与外部系统交互。工具改变了一切。\n在工具使用模式中，Agent 配备了一组可在需要时调用的能力。这些能力可能包括用于查找最新信息的网络搜索引擎、用于访问天气数据或股票价格等服务的 API、用于运行程序和执行计算的代码解释器、用于检索特定记录的数据库查询工具、用于读取和写入文档的文件系统访问，以及无数其他专业功能。与传统软件的关键区别在于，Agent 本身根据手头的任务决定何时以及如何使用这些工具。\n请看下图：\n当 Agent 接收到任务时，它会分析完成该任务需要哪些能力。例如：\n*   如果任务需要 Agent 没有的信息，它会识别出需要搜索或数据检索工具。\n*   如果任务涉及数学运算，它会访问计算器或代码解释器。\n*   如果任务需要与特定服务交互，它会使用相应的 API 工具。\n工具使用之所以强大，在于工具选择的动态性以及能够将多个工具调用链接在一起的能力。\nAgent 不会遵循预先确定的脚本。如果第一次搜索没有返回足够的信息，Agent 可能会重新制定查询并再次搜索。如果 API 调用失败或返回错误，Agent 可能会尝试另一种方法或完全不同的工具。这种适应性使得启用工具的 Agent 比僵硬的自动化工作流更加强大。\n\n3. 思考与行动模式 (Reason and Act Pattern, ReAct)\n思考与行动模式，通常称为 ReAct，代表了一种将明确推理与迭代行动相结合的复杂问题解决方法。ReAct Agent 不会在行动之前完整地思考整个计划，也不会在没有反思的情况下盲目行动，而是交替进行关于下一步行动的推理和实际行动。这种思考与行动的交织创造了一个自然的、适应性强的问题解决过程。\nReAct 循环遵循清晰的模式：\n首先，Agent 推理当前情况以及需要完成的任务。这个推理步骤是明确的，通常会字面上写出 Agent 的内部思维过程。Agent 可能会思考它拥有什么信息、还需要什么、哪些方法可能有效以及最佳的下一步是什么。\n然后，根据这个推理，Agent 采取一个行动。这可能是使用工具收集信息、执行计算或做出决定。\n行动之后，Agent 观察结果并进入一个新的推理阶段，思考它学到了什么以及下一步该怎么做。这个循环持续进行，直到 Agent 确定它已完成目标或达到无法继续前进的地步。\n请看下图：\n明确的推理步骤具有多重重要目的：\n首先，它们帮助 Agent 保持专注并关注目标。通过阐明它正在努力实现什么以及为什么每个行动都有意义，Agent 不太可能走上不相关的路径或陷入低效循环。\n其次，推理步骤支持适应性。当某个行动没有产生预期结果时，推理阶段允许 Agent 诊断原因并调整其方法，而不是盲目继续。\n第三，推理轨迹提供了透明度。用户和开发人员不仅可以看到 Agent 做了什么，还可以看到它为什么做出这些选择，这对于信任、调试和理解 Agent 的决策过程非常有价值。\n将 ReAct 与纯粹的规划或纯粹的执行进行比较，突显了其优势。\n纯粹的规划意味着在采取任何行动之前弄清楚所有步骤。这在我们拥有完整信息且环境可预测时效果很好，但当我们需要在过程中发现信息或情况发生变化时，它就会遇到困难。\n纯粹的执行意味着不加思索地采取行动，这虽然快速但往往效率低下且容易出错。\nReAct 找到了一个中间地带，通过推理提供了足够的结构，同时通过迭代行动保持了灵活性。\n\n4. 规划模式（Planning Pattern）\n规划模式采取了一种与 ReAct 不同的方法，它强调在执行开始之前进行前瞻性的战略思考。\n当使用规划模式时，Agent 首先分析总体目标并理解成功的样子。然后，它将这个目标分解成更小、更易于管理的子任务。这种分解一直持续到 Agent 识别出具体的、可操作的步骤。\n至关重要的是，Agent 会识别任务之间的依赖关系，确定哪些步骤必须在其他步骤开始之前完成，以及哪些步骤可能并行发生。Agent 还会考虑每个步骤需要哪些资源、工具或信息。只有在创建了这个结构化计划之后，Agent 才会开始执行。\n请看下图：\n规划模式的关键优势之一是适应性规划（adaptive planning）。\n规划模式最适用于具有自然阶段或步骤的任务，其中某些活动在逻辑上先于其他活动。它对于具有截止日期、预算或资源限制等约束的任务非常有价值，因为协调很重要。它在错误或回溯会代价高昂的情况下表现出色，这使得投入时间进行周密规划是值得的。涉及多个工作流的复杂项目从规划中受益匪多。\n然而，规划模式也有局限性：\n对于简单、线性任务，其中每个步骤自然地暗示下一个步骤，创建正式计划的开销几乎没有益处。\n对于高度不确定的任务，我们很可能在执行过程中发现会从根本上改变方法的关键信息，此时大量的预先规划可能是徒劳的。\n\n5. 多 Agent 模式（Multi-Agent Pattern）\n多 Agent 模式或许代表了构建 AI 系统最复杂的方法。\n这种模式不依赖单个 Agent 来处理所有事情，而是使用多个专门的 Agent 协同工作来完成任务。每个 Agent 都具有特定的专业知识、能力或视角，它们像人类团队一样协同工作。\n多 Agent 系统背后的核心洞察是，专业化通常比泛化能带来更好的性能。\n一个试图在所有方面都表现出色的单一 Agent 面临挑战。它必须在其设计和训练中平衡相互竞争的要求。它需要广泛的知识，但也需要深入的专业知识。它必须富有创造力，但也必须批判性。通过在多个 Agent 之间分配责任，每个 Agent 都可以针对其特定角色进行优化。\n在一个多 Agent 系统中，我们通常会看到几种类型的角色：\n有一些专注于特定领域或任务的专业 Agent，例如擅长查找和合成信息的“研究 Agent”、优化编写和调试代码的“编码 Agent”，或擅长统计分析和可视化的“数据分析 Agent”。\n通常会有“评论者”或“审查 Agent”，它们的工作是评估其他 Agent 的输出，识别缺陷，提出改进建议，或验证质量。\n通常会有一个“协调者”或“编排 Agent”，它管理整个工作流，决定哪个专业 Agent 应该处理每个子任务，并确保所有部分协调一致。\n多 Agent 模式引入了复杂性权衡，如下：\n*   随着 Agent 数量的增加，协调开销也会增加。\n*   Agent 之间的通信需要明确的协议。\n*   调试变得更具挑战性，因为问题可能来自 Agent 之间的交互，而不是单个 Agent 的错误。\n收益必须证明这些成本是合理的。对于简单任务，单个能干的 Agent 几乎总是更好的。对于需要多样化专业知识、精心协调或多重视角的复杂任务，多 Agent 方法尽管增加了复杂性，但通常会产生卓越的结果。\n\n结论\n各种 agentic 工作流模式代表了我们如何构建和部署 AI 系统的根本性演进。\n从简单的提示词驱动发展到复杂的迭代过程，已经改变了 AI Agent 能够可靠完成的任务。以下是我们涵盖的模式的快速总结：\n*   **反思模式**通过自我改进确保质量。\n*   **工具使用模式**将能力扩展到纯粹的语言生成之外。\n*   **ReAct 模式**将深思熟虑的推理与适应性行动相结合。\n*   **规划模式**为复杂任务带来战略性思考。\n*   **多 Agent 协作**利用专业化和多样化的视角。\n这些模式共同提供了一个强大的工具包，用于构建能够处理现实世界复杂性的 AI 系统。\n这些模式之所以特别强大，是因为它们并非相互排斥。最复杂的 Agent 系统通常会结合多种模式来实现其目标。\n\n赞助我们\n让您的产品呈现在超过 1,000,000 名技术专业人士面前。\n我们的时事通讯将您的产品和服务直接展示给重要的受众——数十万工程领导者和高级工程师——他们对重要的技术决策和大额采购具有影响力。\n广告位迅速售罄——立即预订\n广告位通常提前约 4 周售罄。为确保您的广告能够触达这一有影响力的受众，请立即发送电子邮件至 sponsorship@bytebytego.com 预订您的位置。\n\n259\n3\n15\n分享\n\n---\n\n### 要点总结\n\n1.  **超越单一提示词**：Agentic 工作流将 AI 交互从简单的单轮提示词转变为迭代、自适应的问题解决过程。\n2.  **自主性和适应性**：Agent 不仅响应指令，还能自主决策、规划步骤，并根据发现进行调整，实现像人类一样的问题解决方式。\n3.  **反思模式 (Reflection Pattern)**：Agent 能够自我审查和批判其输出，通过迭代式改进来提高质量，适用于质量要求高的任务。\n4.  **工具使用模式 (Tool Use Pattern)**：Agent 能够调用外部工具（如 Web 搜索、API、代码解释器、数据库查询等），极大地扩展了其获取信息和执行任务的能力。\n5.  **思考与行动模式 (Reason and Act, ReAct)**：Agent 交替进行明确的推理和实际行动，通过观察结果并调整策略，实现灵活且透明的问题解决。\n6.  **规划模式 (Planning Pattern)**：Agent 在执行前进行战略性规划，将复杂目标分解为子任务，识别依赖关系，适用于需要预先周密考虑的复杂项目。\n7.  **多 Agent 模式 (Multi-Agent Pattern)**：多个专业化 Agent 协同工作，每个 Agent 专注于特定领域，并通过协调者 Agent 进行管理，适用于需要多样化专业知识和多重视角的复杂任务。\n8.  **模式组合**：最复杂的 AI Agent 系统通常会结合多种工作流模式，以实现更强大的功能和更高的效率。\n9.  **提高可靠性**：Agentic 工作流通过内置的迭代和反馈循环，显著提升了 AI 系统输出的可靠性和质量。\n10. **透明度**：如 ReAct 模式中的显式推理步骤，能提高 AI 决策过程的透明度，有助于调试和建立用户信任。\n\n### 你可以从这篇文章学到什么\n\n对于一个拥有几年经验的后端/系统设计工程师来说，这篇文章提供了关于下一代 AI 系统设计范式的宝贵见解，远超仅仅调用 LLM API 的基础应用。它能帮助你：\n\n1.  **拓宽 AI 系统设计思维**：\n    *   **超越单次调用**：认识到在实际项目中，仅依赖一次 LLM 调用是远远不够的。你需要设计一个更具“智能”和“韧性”的系统，能够像人一样思考、规划和迭代。\n    *   **引入自主性和迭代**：理解 AI Agent 如何从被动响应变为主动解决问题，这对于设计需要处理复杂业务逻辑或动态环境的 AI 驱动功能至关重要。\n\n2.  **提升 AI 功能的可靠性和实用性**：\n    *   **质量保障 (Reflection Pattern)**：在你的系统设计中，对于关键的 AI 生成内容（例如，自动化报告、法律文档草稿、代码建议），你可以借鉴“反思模式”来构建一个验证层。例如，设计一个额外的 LLM Agent 作为“评论者”，自动审查初稿的准确性、完整性和逻辑性，从而显著提升输出质量，减少人工干预。\n    *   **集成现有系统 (Tool Use Pattern)**：这是后端工程师的强项。你可以将现有的微服务、数据库、内部 API 甚至第三方服务包装成“工具”，供 AI Agent 调用。例如，一个客服 Agent 可以调用你的 CRM 系统 API 获取用户历史订单，或者调用内部库存服务 API 查询产品状态。这让 AI 不再是孤立的文本生成器，而是能与你的整个后端生态系统深度交互的“大脑”。\n\n3.  **构建复杂、多步骤的 AI 驱动流程**：\n    *   **智能任务编排 (ReAct / Planning Pattern)**：当你需要设计一个 AI 驱动的复杂任务流（例如，自动化数据分析、智能运维故障排查、个性化内容生成），“ReAct”和“规划模式”提供了清晰的架构思路。你可以让 AI 不仅执行任务，还能在每个阶段进行反思，决定下一步操作，甚至动态调整计划。这对于设计高度自动化、需要多步决策和适应性的系统非常有用。\n    *   **分布式 AI (Multi-Agent Pattern)**：如果你的项目足够复杂，需要不同的专业知识（例如，一个 Agent 负责研究，另一个负责代码实现，再一个负责测试），“多 Agent 模式”与你熟悉的微服务架构异曲同工。你可以将一个大型 AI 问题分解成多个小型的、专业的 Agent 服务，它们通过协调者进行通信和协作。这有助于提高可维护性、可扩展性，并更好地管理复杂性。\n\n4.  **提高可观测性和调试能力**：\n    *   “ReAct 模式”中明确的“思考”步骤提醒我们，在设计 AI 系统时，应重视内部决策过程的日志记录和可视化。这对于后端工程师而言，意味着你可以为 AI Agent 的每个推理和行动步骤设计结构化日志，从而更容易地调试问题、理解 AI 的行为，并在生产环境中进行监控和优化。\n\n通过学习这些 agentic 工作流模式，你不仅能更好地理解当前 AI 领域的前沿进展，还能将这些高级概念融入到你的系统设计中，构建出更强大、更智能、更具弹性的 AI 驱动应用。这无疑会极大地扩展你的技术栈，并为未来的职业发展提供更多可能性。",
    "url": "https://blog.bytebytego.com/p/top-ai-agentic-workflow-patterns"
  }
]