[
  {
    "id": "2026-01-14-how-lyft-built-an-ml-platform-that-serves-millions-of-predictions-per-second",
    "title": "How Lyft Built an ML Platform That Serves Millions of Predictions Per Second",
    "date": "2026-01-14",
    "preview": "# Lyft 如何构建每秒处理数百万次预测的机器学习平台  当你通过 Lyft 请求乘车时，数十个机器学习模型会在后台启动。一个模型可能计算你的行程价格。另一个模型决定哪些司机应该获得奖金激励。一个欺诈检测模型会扫描交易中的可疑活动。一个预计到达时间（ETA）预测模型估算你的到达...",
    "content": "# Lyft 如何构建每秒处理数百万次预测的机器学习平台\n\n当你通过 Lyft 请求乘车时，数十个机器学习模型会在后台启动。一个模型可能计算你的行程价格。另一个模型决定哪些司机应该获得奖金激励。一个欺诈检测模型会扫描交易中的可疑活动。一个预计到达时间（ETA）预测模型估算你的到达时间。所有这些都在毫秒内发生，而且每天发生数百万次。\n\n以如此规模提供机器学习模型的工程挑战是巨大的。\n\nLyft 的解决方案是构建一个名为 LyftLearn Serving 的系统，使这项任务对开发者来说变得简单。本文将探讨 Lyft 如何构建这个平台及其背后的架构。\n\n## 两个复杂性层面\n\nLyft 发现机器学习模型服务之所以困难，是因为存在两个不同层面的复杂性：\n\n第一个层面是**数据平面 (data plane)**。这包括系统在主动处理请求时，稳态操作期间发生的一切。这包括网络流量、CPU 和内存消耗。此外，模型必须加载到内存中并快速执行推理任务。换句话说，这些是运行时关注点，决定了系统能否处理生产负载。\n\n第二个层面是**控制平面 (control plane)**，它处理随时间变化的一切。例如，模型需要部署和解除部署。它们需要用新鲜数据重新训练并正确版本化。新模型在全面发布前需要通过实验进行测试。此外，必须保持向后兼容性，以确保更改不会破坏现有功能。\n\nLyft 需要在支持数十个团队的各种需求的同时，在这两个方面同时做到卓越。\n\n## 需求问题\n\nLyft 需求的复杂性使得构建一刀切的解决方案几乎不可能。不同的团队关注截然不同的系统特性，从而创造了一个庞大的操作环境。\n\n例如，一些团队要求极低的延迟限制。他们的模型需要在个位数毫秒内返回预测，因为任何延迟都会降低用户体验。其他团队更关心吞吐量，需要在高峰时段每秒处理超过一百万个请求。一些团队希望使用不被广泛支持的小众机器学习库。还有一些团队需要持续学习能力，即模型根据新数据实时更新。\n\n请看下图：\n\nSource: Lyft Engineering Blog\n\n更糟糕的是，Lyft 已经有一个遗留的单体服务系统在生产中运行。虽然这个系统适用于某些用例，但其单体设计带来了严重问题。\n\n所有团队共享相同的代码库，这意味着他们必须就使用哪个版本的库达成一致。一个团队的部署可能会破坏另一个团队的模型。在发生故障时，通常不清楚哪个团队拥有系统的哪个部分。团队经常相互阻塞，无法部署更改。\n\n## 微服务解决方案\n\nLyft 选择使用微服务架构构建 LyftLearn Serving，其中小型、独立的服务各自处理特定的职责。这个决定与 Lyft 大多数软件系统的构建方式一致，允许团队利用现有的工具进行测试、网络和操作管理。\n\n请看下图：\n\n然而，Lyft 团队将微服务概念推向了比典型实现更远的程度。他们没有构建一个所有团队共享的单一微服务，而是创建了一个平台，为每个团队生成**完全独立的微服务**。\n\n当 Lyft 的一个团队想要提供机器学习模型时，他们会使用一个配置生成器来创建自己专用的 GitHub 仓库。这个仓库包含一个完全属于该团队的微服务的所有代码和配置。例如，定价团队拥有自己的仓库和微服务，欺诈检测团队也有自己的，以此类推。\n\n这些微服务共享通用的底层组件，但它们独立运行。每个团队控制自己的部署管道，选择何时发布更改到生产环境。每个团队都可以使用他们所需的任何版本的 TensorFlow、PyTorch 或其他 ML 库，而不会产生冲突。每个团队的服务都在隔离的容器中运行，拥有专用的 CPU 和内存资源。如果一个团队的部署出现故障，只影响该团队。\n\n这种架构解决了困扰遗留系统的所有权问题。每个仓库都明确标识了哪个团队拥有它。在岗（on-call）升级路径清晰明确。库更新每次只影响一个团队。团队可以按照自己的节奏行动，而不会相互阻塞。\n\n请看下图：\n\n## 运行时架构\n\n了解 LyftLearn Serving 微服务部署时实际运行的内容有助于阐明系统的工作原理。运行时由几个协同工作的层组成。\n\n最外层是 HTTP 服务基础设施。Lyft 使用 Flask（一个 Python web 框架）来处理传入的 HTTP 请求。Flask 运行在 Gunicorn 之上，Gunicorn 是一个 web 服务器，管理多个工作进程以处理并发请求。最前端是 Envoy，一个负载均衡器，将请求分发到多个服务器实例。Lyft 团队对 Flask 进行了定制优化，使其与 Envoy 和 Gunicorn 更好地配合。\n\n在 HTTP 层之下是 **Core LyftLearn Serving Library (核心 LyftLearn 服务库)**，其中包含驱动平台业务逻辑。这个库处理关键功能，例如将模型加载到内存中并在需要时卸载它们，管理同一模型的多个版本，处理推理请求，将新模型与生产模型并行进行影子测试以确保安全，监控模型性能，以及记录预测结果以进行分析。\n\n下一层是团队注入自定义代码的地方。ML 工程师编写两个由平台调用的关键函数：\n\n*   `load` 函数：指定如何从磁盘将他们的特定模型反序列化到内存中。\n*   `predict` 函数：定义如何预处理输入特征并调用他们模型的预测方法。\n\n最深层是第三方 ML 库，如 TensorFlow、PyTorch、LightGBM 和 XGBoost。Lyft 平台不限制团队可以使用哪些库，只要它们有 Python 接口。这种灵活性对于支持多样化的团队需求至关重要。\n\n最后，整个堆栈建立在 Lyft 的基础设施之上，该基础设施使用 Kubernetes 进行容器编排，使用 Envoy 进行服务网格网络。运行时实现了指标、日志、跟踪和分析的接口，这些接口与 Lyft 的监控系统集成。\n\n## 配置生成器\n\nLyftLearn Serving 最重要的方面之一是它如何解决入职问题。在像 Lyft 这样的公司部署微服务需要跨许多系统进行大量的配置，例如：\n\n*   Kubernetes YAML 文件，用于定义容器如何运行。\n*   用于云基础设施的 Terraform 配置。\n*   用于网络的 Envoy 配置。\n*   数据库连接、安全凭证、监控设置和部署管道。\n\n期望 ML 工程师学习所有这些系统将成为采用的巨大障碍。Lyft 团队的解决方案是使用 Yeoman（一个项目脚手架工具）构建一个配置生成器。\n\n请看下图：\n\n生成器通过一个简单的问答流程工作。ML 工程师运行生成器并回答关于他们的服务名称、团队所有权以及其他几个细节的基本问题。然后，生成器自动创建一个完整的 GitHub 仓库，其中包含运行 LyftLearn Serving 微服务所需的一切。\n\n生成的仓库包括所有基础设施系统的格式正确的配置文件、演示如何实现模型加载和预测的工作示例代码、单元测试模板、完全配置的 CI/CD 部署管道以及关于如何自定义一切的文档。\n\n最重要的是，生成的仓库可以立即部署。ML 工程师可以运行生成器，合并创建的代码，部署它，并在生产环境中拥有一个功能正常的模型服务微服务。这种方法减少了 ML 平台团队的支持负担。团队可以无需大量帮助实现自我入职。鉴于有超过 40 个团队使用 LyftLearn Serving，这种可伸缩性至关重要。\n\n## 模型自测试\n\nLyft 团队构建了一个解决方案，以确保模型在系统演进过程中持续正常工作。他们将此功能称为**模型自测试 (model self-tests)**。\n\nML 工程师直接在他们的模型代码中定义测试数据。这些测试数据包括示例输入及其预期输出。例如，一个神经网络模型可能指定输入 `[1, 0, 0]` 应该产生接近 `[1]` 的输出。这些测试数据与模型二进制文件本身一起保存。\n\n平台会在两种场景下自动运行这些自测试：\n\n首先，每当模型加载到内存中时，系统会根据测试数据运行预测并验证输出是否符合预期。结果会被记录并转换为指标，供 ML 工程师监控。\n\n其次，每当有人创建拉取请求（pull request）来更改代码时，持续集成（CI）系统会针对其保存的测试数据测试仓库中的所有模型。\n\n这种自动化测试可以及早发现问题。如果库升级破坏了模型兼容性，测试会在部署之前失败。如果容器镜像更改影响了模型行为，工程师会立即知道。这些测试提供了模型正常工作的信心，无需手动验证。\n\n## 推理请求如何流经系统\n\n了解实际预测请求如何通过 LyftLearn Serving 流动有助于将所有部分联系起来。考虑一个预测司机奖励的请求。\n\n请求以 HTTP POST 到 `/infer` 端点到达，其中包含模型 ID 和 JSON 格式的输入特征。\n\nFlask 服务器接收请求并将其路由到适当的处理函数。此处理函数由 Core LyftLearn Serving Library 提供。\n\n平台代码首先使用模型 ID 从内存中检索请求的模型。它验证输入特征是否与预期的 Schema 匹配。如果配置了模型影子测试（shadowing），它可能会将请求同时路由到多个模型版本进行比较。\n\n接下来，平台调用 ML 工程师编写的自定义 `predict` 函数。此函数根据需要预处理特征，然后调用底层 ML 库的预测方法。\n\n最后，更多平台代码执行。系统发出延迟指标和日志以进行调试。它生成分析事件以监控模型性能。预测结果被打包成 JSON 响应并返回给调用者。\n\n请看下图：\n\n整个流程通常在毫秒内完成。平台代码和自定义代码之间的清晰分离允许 Lyft 添加新功能，而无需团队更改其预测逻辑。\n\n## 开发工作流和文档\n\nLyft 团队认识到不同的用户需要不同的界面。他们提供了两种主要方式来使用 LyftLearn Serving。\n\n对于熟悉代码的软件工程师，模型仓库提供了完全控制。工程师可以编辑部署管道，修改 CI/CD 配置，并编写自定义推理逻辑。一切都进行版本控制并遵循标准软件开发实践。\n\n对于喜欢可视化界面的数据科学家，LyftLearn UI 提供了一个 web 应用程序。用户可以一键部署模型，通过仪表板监控性能，并管理训练作业，而无需编写基础设施代码。\n\n请看下图：\n\n文档也受到了最高级别的重视。Lyft 团队使用 Diátaxis 框架组织文档，该框架定义了四种文档类型：\n\n*   **教程 (Tutorials)**：为初学者提供分步学习。\n*   **操作指南 (How-to guides)**：为常见任务提供具体说明。\n*   **技术参考 (Technical references)**：详细记录 API。\n*   **讨论 (Discussions)**：解释概念和设计决策。\n\n## 结论\n\nLyft 工程团队分享了构建 LyftLearn Serving 的几个重要经验。这些见解广泛适用于任何构建平台系统的人。\n\n首先，他们强调了**仔细定义术语的重要性**。“模型”这个词可以表示许多不同的事物：源代码、训练权重、云存储中的文件、序列化二进制文件或内存中的对象。每次对话都需要明确其含义。\n\n其次，他们了解到**模型会无限期地服务生产流量**。一旦模型上线，它通常会永远运行。这一现实要求极高的稳定性和对向后兼容性的仔细关注。\n\n第三，他们发现**出色的文档对于平台产品至关重要**。彻底、清晰的文档能够实现自我入职并减少支持负担。对文档的投入会持续带来回报。\n\n第四，他们接受了**艰难的权衡不可避免**。团队不断在无缝用户体验与高级用户灵活性之间，或定制工作流与强制最佳实践之间进行平衡。\n\n第五，他们学会了**将愿景与高级用户保持一致**。最苛刻的客户通常有正确的优先事项：稳定性、性能和灵活性。满足他们的需求往往会造福所有人。\n\n最后，他们**拥抱“无聊”的技术**。他们没有追逐最新趋势，而是选择了经过验证、稳定的工具，如 Flask、Kubernetes 和 Python。这些技术拥有强大的社区支持，更容易招聘，并且很少引起意外问题。\n\nLyft 于 2022 年 3 月在内部提供了 LyftLearn Serving。随后，团队将所有模型从遗留的单体系统迁移到新平台。如今，超过 40 个团队使用 LyftLearn Serving 每天驱动数亿次预测。\n\n## 参考文献\n\n*   Powering Millions of Real-Time Decisions with LyftLearn Serving\n*   LyftLearn: ML Model Training Infrastructure built on Kubernetes\n*   Scaling productivity on microservices at Lyft\n\n---\n\n## 要点总结\n\n*   LyftLearn Serving 旨在解决大规模机器学习模型服务中的复杂性，将其分为数据平面（运行时）和控制平面（生命周期管理）。\n*   系统采用微服务架构，但更进一步，为每个团队生成**完全独立**的微服务，而非共享一个。\n*   每个团队拥有独立的 GitHub 仓库、部署管道和资源，可自由选择 ML 库版本，实现高度自治和隔离。\n*   运行时架构包括 HTTP 层（Flask, Gunicorn, Envoy）、核心 LyftLearn Serving Library、团队自定义的 `load` 和 `predict` 函数，以及支持多种第三方 ML 库。\n*   通过 Yeoman 配置生成器，将复杂的基础设施配置自动化，大幅降低 ML 工程师的上手门槛。\n*   引入模型自测试机制，将测试数据与模型二进制文件一同保存，在模型加载和 CI/CD 阶段自动验证模型行为，确保稳定性。\n*   推理请求流程清晰，由平台代码处理通用逻辑，ML 工程师的自定义代码专注于模型特有的预处理和预测。\n*   提供两种用户界面：面向软件工程师的代码仓库（提供完全控制），以及面向数据科学家的 LyftLearn UI（提供可视化操作）。\n*   文档组织采用 Diátaxis 框架，强调提供教程、操作指南、技术参考和讨论，以支持不同层次的用户。\n*   Lyft 从实践中总结出重要经验：明确术语、关注模型长期稳定性、重视文档、接受权衡、与核心用户对齐需求，以及拥抱“无聊”且成熟的技术。\n\n## 你可以从这篇文章学到什么\n\n对于一个拥有几年经验的后端/系统设计工程师来说，这篇文章提供了宝贵的见解，不仅限于机器学习领域，其核心设计思想和工程实践同样适用于构建其他复杂的平台系统。\n\n1.  **深入理解平台化思维**：文章展示了如何将一个复杂且需求多样的领域（ML 模型服务）转化为一个可伸缩的平台。LyftLearn Serving 不仅仅是提供一个 API，更是一个赋能其他团队的平台。学习其如何通过配置生成器实现“自服务”，以及如何通过独立微服务实现团队自治和快速迭代，对设计任何内部平台都极具参考价值。\n2.  **微服务架构的进阶应用**：传统的微服务通常是多个团队共享的服务。Lyft 更进一步，为每个团队生成一个**独立**的微服务，这是一种“微服务工厂”模式。这种模式解决了共享服务中常见的库版本冲突、部署阻塞、所有权不清等问题。在设计多租户或多团队使用的核心平台组件时，可以考虑这种更彻底的隔离和自动化生成模式。\n3.  **如何应对多样化需求**：面对 ML 模型服务中极高的延迟要求、吞吐量需求和各式各样的 ML 库选择，Lyft 没有追求一个大而全的单体方案。而是通过核心库提供通用能力，同时允许团队注入自定义逻辑，并提供独立运行环境。这教会我们如何在标准化与灵活性之间找到平衡，为用户提供能力的同时，也给予他们足够的自由度。\n4.  **工程实践中的自动化和质量保障**：配置生成器极大地简化了新服务的上线流程，降低了学习成本和运维负担。模型自测试的机制，将测试数据与模型代码一同维护，并在关键生命周期（加载、CI/CD）中自动验证，是实现持续集成和保证生产稳定性的典范。在自己的项目中，可以思考如何通过自动化工具和内建的测试机制来提升效率和可靠性。\n5.  **务实的技术选型与文档重要性**：文章强调“拥抱无聊的技术”，即优先选择成熟、稳定、社区支持良好的技术栈（如 Flask, Kubernetes, Python）。这提醒我们，在很多情况下，业务价值和系统稳定性比追逐最新技术更重要。同时，Diátaxis 框架的应用也凸显了高质量文档在平台产品推广和用户赋能中的核心地位。\n6.  **生命周期管理和数据流设计**：文章详细描绘了推理请求在系统中的流动路径，以及模型在生产环境中“无限期”运行的特点。这促使工程师在设计系统时，不仅要考虑请求处理的效率，还要深入思考模型部署、版本管理、监控、日志以及潜在回滚等整个生命周期中的复杂性。",
    "url": "https://blog.bytebytego.com/p/how-lyft-built-an-ml-platform-that"
  },
  {
    "id": "2026-01-13-a-guide-to-llm-evals",
    "title": "A Guide to LLM Evals",
    "date": "2026-01-13",
    "preview": "# LLM 评估指南  大型语言模型（LLM）已以惊人的速度从研究实验室走向生产应用。开发者们正在将其用于各种场景，从客户支持聊天机器人到代码生成工具再到内容创作系统。然而，这种快速采用带来了一个重要问题：我们如何知道我们的 LLM 实际上运行良好？  与可以编写单元测试来检查精...",
    "content": "# LLM 评估指南\n\n大型语言模型（LLM）已以惊人的速度从研究实验室走向生产应用。开发者们正在将其用于各种场景，从客户支持聊天机器人到代码生成工具再到内容创作系统。然而，这种快速采用带来了一个重要问题：我们如何知道我们的 LLM 实际上运行良好？\n\n与可以编写单元测试来检查精确输出的传统软件不同，LLM 是概率系统。两次询问相同的问题，模型可能会给出不同的答案，而这两个答案都可能是完全有效的。这种不确定性使得评估具有挑战性，但又绝对必要。\n\n这就是“评估”（evals）的用武之地。评估是指我们用来衡量 LLM 性能的系统方法。如果没有适当的评估，我们基本上就是盲目飞行，无法知道我们最新的提示词（prompt）更改是变好还是变坏，我们的模型是否已准备好投入生产，或者它是否正确处理了边缘情况。\n\n在本文中，我们将探讨 LLM 评估为何具有挑战性、可用的不同评估类型、需要理解的关键概念以及设置评估过程的实用指导。\n\n## LLM 评估为何具有挑战性\n\n如果我们习惯于测试传统软件，LLM 评估将以根本不同的方式呈现。在传统编程中，我们编写一个函数，它接受输入并产生确定性输出。测试是直接的。给定输入 X，我们期望输出 Y。如果得到 Y，测试通过；否则，它失败。\n\nLLM 在几个方面打破了这种模式。\n\n首先，语言本身具有主观性。什么才算一个“好”的回答？一个回答可能简洁，而另一个可能全面。根据上下文，两者都可能是合适的。与检查函数是否返回数字 42 不同，判断一段文字的质量需要细致入微的判断。\n\n其次，大多数问题或提示词都有多个有效答案。例如，如果我们要求 LLM 总结一篇文章，有无数种方法可以正确完成。一个检查精确文本匹配的评估即使在模型生成出色摘要时也会失败。\n\n第三，语言是深度依赖于上下文的。相同的词在不同的情境中可能意味着不同的事物。讽刺、幽默、文化背景和隐含意义都增加了简单模式匹配无法捕捉的复杂层次。\n\n最后，令人印象深刻的演示和一致的生产性能之间存在显著差距。一个 LLM 可能完美处理我们精心设计的测试用例，但在真实用户提供的混乱、不可预测的输入面前却可能手足无措。\n\n传统的软件测试方法，如单元测试（unit tests）和集成测试（integration tests），对于围绕 LLM 的代码仍然有价值，但它们无法完全转化为评估模型的语言理解和生成能力。我们应对这个新挑战需要不同的工具和框架。\n\n## LLM 评估的类型\n\n评估 LLM 时，我们有几种可用方法，每种方法都有不同的优势和权衡。让我们探讨主要类别。\n\n### 自动评估（Automatic Evaluations）\n\n自动评估是无需人工参与即可运行的程序化评估。\n\n最简单的形式是精确匹配（exact matching），我们检查模型输出是否与预期字符串完全匹配。这适用于结构化输出（如 JSON）或确实只有一个正确答案的情况，但对于大多数自然语言任务来说过于僵化。\n\n关键词匹配（keyword matching）稍微灵活一些。我们检查输出是否包含某些必需的关键词或短语，而不要求精确匹配。这能在捕获一定变异性的同时保持确定性且易于实现。\n\n语义相似性（semantic similarity）衡量模型输出在意义上与参考答案的接近程度，即使词语不同。这通常使用嵌入模型（embedding models）来比较语义内容而非表面文本。\n\n一种越来越流行的方法是基于模型的评估（model-based evaluation），我们使用另一个 LLM 作为裁判。在这种方法中，我们可以要求一个强大的模型，如 GPT-4 或 Claude，根据帮助性、准确性或相关性等标准来评价目标模型的输出。这种方法可以捕捉更简单指标所遗漏的细微之处，尽管它也引入了自己的复杂性。\n\n当我们需要捕捉明显故障、运行回归测试以确保更改不破坏现有功能或快速迭代提示词时，自动评估会发挥巨大作用。然而，它们可能会遗漏只有人类判断才能发现的细微问题。\n\n### 人工评估（Human Evaluations）\n\n尽管自动化测试取得了进展，但人工评估仍然是评估 LLM 性能细微方面的黄金标准。人类可以判断主观品质，如语气、适当性、帮助性以及回复是否真正解决了问题的潜在意图。\n\n人工评估有几种形式。在偏好排名（preference ranking）中，评估者比较多个输出并选择他们偏好的。李克特量表（Likert scales）要求评分者根据不同维度对输出进行数值评分。任务完成评估（task completion evaluations）测试输出是否达成特定目标。\n\n人工评估的主要权衡是成本和速度与准确性。获取高质量的人工评分既昂贵又耗时，但对于许多应用而言，这是真正验证性能的唯一方法。例如，在处理主观任务、涉及安全关键型应用或需要验证我们的自动评估时，人工评估变得至关重要。\n\n### 基准评估（Benchmark-Based Evaluations）\n\n机器学习研究社区已经开发了用于评估 LLM 的标准化基准数据集。这些数据集包括用于一般知识的 MMLU（Massive Multitask Language Understanding）、用于常识推理的 HellaSwag 和用于代码生成的 HumanEval。\n\n基准的优势在于可比性。我们可以看到我们的模型与其它模型的表现如何，并使用既定基线跟踪进展。它们还提供了涵盖各种场景的现成测试集。\n\n然而，基准也有局限性。它们可能无法反映我们的特定用例。一个在学术基准上得分很高的模型，在我们的客户支持应用上可能仍然表现不佳。此外，随着基准变得广为人知，模型存在专门针对它们进行优化而非针对一般能力优化的风险。\n\n## LLM 评估的关键概念\n\n为了建立有效的评估，我们需要理解几个核心概念：\n\n### 评估指标（Evaluation Metrics）\n\n不同的任务需要不同的指标。对于分类任务，我们可能使用准确率（accuracy）或 F1 分数（F1 score）。对于文本生成，BLEU 和 ROUGE 等指标衡量与参考文本的重叠度，尽管它们有已知的局限性。对于代码生成，我们可以检查代码是否正确执行并产生预期输出。\n\n除了特定任务的指标外，我们通常还关心跨任务的质量维度。\n*   输出是否与输入相关？\n*   它是否连贯且结构良好？它是否事实准确？\n*   它对用户有帮助吗？\n*   它是否避免了有害内容？\n\n### 评估数据集（Evaluation Datasets）\n\n我们评估的质量在很大程度上取决于测试数据集的质量。我们需要代表实际使用情况的测试用例，足够多样以涵盖不同场景，并包含模型可能失败的边缘情况。\n\n一个常见的陷阱是数据污染（data contamination），即我们的测试示例与模型的训练数据重叠。这可能使性能看起来比在真正新颖的输入上实际表现更好。使用保留数据（held-out data）或创建新的测试用例有助于避免此问题。\n\n### 统计考量（Statistical Considerations）\n\n由于 LLM 的输出在不同运行之间可能有所不同（尤其是在较高温度设置下），我们需要从统计学角度考虑评估。单次测试运行可能不具有代表性。样本量很重要，对十个示例进行测试的置信度远低于对一千个示例进行测试。\n\n我们还需要考虑模型输出的方差。多次运行相同的提示并平均结果可以为我们提供更稳定的性能图景。理解和控制 `temperature`、`top-p` 和 `random seeds` 等参数有助于使我们的评估可复现。\n\n## 设置您的评估流程\n\n以下是构建评估流程的实用方法。\n\n**为我们的用例定义成功标准**：\n对于我们的特定应用程序，“好”意味着什么？如果我们正在构建一个客户支持机器人，也许“好”意味着准确回答问题、保持友好的语气并在适当的时候升级给人类。\n\n**创建初始评估集**：\n从 50-100 个多样化的示例开始，涵盖常见情况、边缘情况和已知故障模式。我们不需要数千个示例才能开始获得价值。\n\n**选择我们的评估方法**：\n如果资源有限，从自动评估开始。如果质量至关重要且有预算，则结合人工评估。通常，混合方法效果最好，我们使用自动评估进行广泛覆盖和快速迭代，并使用人工评估进行最终验证。\n\n**建立迭代周期**：\n运行评估，识别模型失败的地方，进行改进（更好的提示词、不同的模型、微调等），然后重新评估。这个周期是我们逐步提高性能的方式。\n\n**长期跟踪性能**：\n记录不同版本之间的评估分数。这有助于我们了解更改是否有帮助并防止回归。\n\n**对所有内容进行版本控制**：\n跟踪哪个模型版本、哪个提示词版本以及哪个评估数据集版本产生了每个结果。这使得调试和复现变得容易得多。\n\n关键在于从简单开始并迭代。不要等待完美的评估设置。一个定期运行的基本评估比一个从未实现的复杂评估更有价值。\n\n## 常见陷阱与最佳实践\n\n在建立评估实践时，最好留意这些常见错误：\n\n**过度拟合评估集（Overfitting to the eval set）** 是一个真实的风险。如果我们反复针对相同的测试用例进行优化，我们可能在不提高实际性能的情况下提高分数。定期用新示例刷新我们的评估集有助于防止这种情况。\n\n我们还可能陷入 **玩弄指标（gaming the metrics）** 的陷阱。仅仅因为一个模型在特定指标上得分很高，并不意味着它实际上更好。始终将定量指标与实际输出的定性审查结合起来。\n\n许多团队 **忽视边缘情况和对抗性示例（neglect edge cases and adversarial examples）**。真实用户会找到我们从未预料到的方法来破坏系统。积极寻找和测试困难案例可以使我们的评估更加健壮。\n\n另一方面，**仅仅依赖感觉和轶事（relying solely on vibes and anecdotes）** 是有问题的。人类直觉是宝贵的，但可能具有误导性。系统评估为我们提供了做出明智决定的数据。\n\n也许最大的陷阱是 **根本不进行评估（not evaluating at all）**。在匆忙发布功能时，评估往往会被降级。但没有评估的发布意味着我们不知道我们是在让事情变得更好还是更糟。\n\n最佳实践是维护一个多样化、不断发展的评估套件，它与我们的产品一起成长。当我们发现新的故障模式或扩展到新的用例时，可以将它们添加到评估集中。\n\n## 结论\n\nLLM 评估是一个持续的实践，应该融入到我们的开发工作流中。正如我们不会在没有测试的情况下发布传统软件一样，我们也不应该在没有适当评估的情况下部署 LLM 应用程序。\n\n良好的评估让我们有信心快速迭代和安全部署。它们帮助我们理解什么有效，什么无效，同时为比较不同方法提供客观衡量标准。它们在用户发现问题之前捕获回归。\n\n好消息是，我们不需要一个复杂的设置来开始。从一小组测试用例和基本指标开始。定期运行评估。关注失败。随着我们对应用程序需求的了解加深，逐步扩展和完善我们的评估套件。\n\nLLM 评估领域仍在不断发展，新的工具、框架和最佳实践定期涌现。但基本原则保持不变：我们无法改进未衡量的东西。通过将评估作为 LLM 开发过程的核心部分，我们将原本可能是猜测的工作转化为工程。\n\n---\n\n## 要点总结\n\n*   **LLM 评估的复杂性**: LLM 的概率性、语言的主观性、多重有效答案、上下文依赖性以及演示与生产性能之间的差距，使得其评估比传统软件更具挑战性。\n*   **三种主要评估类型**: 文章介绍了自动评估、人工评估和基于基准的评估，各有优缺点和适用场景。\n*   **自动评估方法**: 包括精确匹配、关键词匹配、语义相似性以及利用另一个 LLM 作为裁判的基于模型的评估，适用于快速迭代和回归测试。\n*   **人工评估的黄金标准**: 尽管成本高昂，人工评估在判断语气、适当性、意图等主观和细微方面仍是不可替代的，尤其适用于安全关键型应用。\n*   **基准测试的价值与局限**: 基准数据集（如 MMLU, HellaSwag, HumanEval）提供可比性，但可能无法完全反映特定业务用例，且存在为基准而优化的风险。\n*   **评估指标的选择**: 需根据任务选择合适的指标（如分类任务的准确率/F1，文本生成的 BLEU/ROUGE，代码生成的执行正确性），并关注相关性、连贯性、准确性、帮助性和安全性等通用质量维度。\n*   **高质量评估数据集的重要性**: 测试数据集应具有代表性、多样性，包含边缘案例，并严格避免数据污染（与训练数据重叠）。\n*   **统计学考量**: LLM 输出的不确定性要求评估考虑统计学因素，如样本量、多次运行平均结果以减少方差，以及控制 `temperature`、`top-p` 和 `random seeds` 以确保可复现性。\n*   **实践评估流程**: 建议定义成功标准、创建初始评估集（50-100例）、选择混合评估方法、建立迭代周期、长期跟踪性能，并对所有相关资产（模型、提示词、数据集）进行版本控制。\n*   **避免常见陷阱**: 警惕过度拟合评估集、玩弄指标、忽视边缘案例、仅凭直觉判断以及完全不进行评估等常见错误，强调维护一个多样化、不断演进的评估套件。\n\n---\n\n## 你可以从这篇文章学到什么\n\n对于一个拥有几年经验的后端/系统设计工程师而言，这篇文章提供了关于 LLM 评估的深刻见解和实用指南，这对于在现代系统中集成和管理 AI 组件至关重要。\n\n**为什么这篇文章有价值：**\n\n随着 LLM 技术日益成熟并被广泛应用于生产系统，它们正从研究领域走向系统架构中的一个关键组件。作为系统设计工程师，我们不仅要关注服务的可用性、可伸缩性和性能，更要理解如何衡量和保证这些非确定性 AI 组件的“正确性”和“质量”。这篇文章清晰地阐述了 LLM 评估的特殊挑战，并提供了一套系统化的方法论，帮助我们将对 LLM 的“感觉良好”转化为可量化的工程实践。它填补了传统软件测试与现代 AI 模型评估之间的知识鸿沟。\n\n**这些想法如何在实际系统设计或工程工作中应用：**\n\n1.  **LLM 服务质量保障机制设计：** 当你的系统开始集成 LLM API 或自托管 LLM 服务时，这篇文章强调的评估类型和方法可以直接指导你设计服务的质量保障（QA）流程。你可以为 LLM 服务设置持续的自动评估流水线，作为 CI/CD 的一部分，确保每次模型或提示词更新不会引入回归。\n2.  **数据管道与质量控制：** 文章强调了评估数据集的质量和避免数据污染。这意味着在设计数据摄取、处理和存储管道时，必须为 LLM 评估数据（测试集）和训练数据创建严格的分离和版本控制机制。高质量的评估数据集是有效评估的基石，需要像对待生产数据一样进行管理。\n3.  **可观测性和监控体系的扩展：** 传统的系统监控侧重于 CPU、内存、延迟、错误率等。对于 LLM 应用，你需要扩展你的可观测性（Observability）体系，纳入 LLM 特有的评估指标。例如，你可以集成自动评估结果（如语义相似度得分、准确率）到你的 Grafana/Prometheus 面板中，甚至通过集成人工评估平台，监控人工评分的变化趋势。这有助于你不仅知道服务是否在运行，更知道它是否“工作得好”。\n4.  **A/B 测试和迭代策略：** 文章中的“迭代周期”与系统设计中常见的 A/B 测试和灰度发布策略高度相关。当你部署新的 LLM 模型版本或修改提示词时，可以利用评估流程来比较新旧版本的性能，并根据量化指标（而非主观感受）做出发布决策。这有助于建立一个数据驱动的 LLM 迭代和优化循环。\n5.  **资源规划与成本效益分析：** 人工评估是昂贵且耗时的。作为系统设计师，你需要权衡自动评估的效率和人工评估的准确性。这可能涉及到设计一个混合评估系统，例如，使用自动评估进行大规模、高频率的初步筛选，然后将有疑虑或关键场景的输出送给人工进行复核，从而优化资源配置。\n6.  **可复现性与配置管理：** 文中提到的 `temperature`、`top-p`、`random seeds` 等 LLM 参数对输出有显著影响。在系统设计中，确保这些参数是可配置、可追踪且随模型版本一起存储的，对于调试和复现任何评估结果至关重要。这有助于你在出现问题时，能够精确重现环境并进行分析。\n7.  **边缘案例和对抗性测试：** 设计健壮的系统意味着要考虑各种失败场景。文章提醒我们不能忽视边缘案例和对抗性示例。在系统测试阶段，应主动设计这类测试用例，甚至可以引入自动化工具或众包平台来发现和生成更多此类案例，从而提高 LLM 系统的鲁棒性。\n\n总之，这篇文章将 LLM 评估从一个抽象的机器学习概念，转化为了一个可以被系统设计工程师理解和实践的工程挑战。它强调了评估不是一次性的任务，而是一个贯穿 LLM 应用整个生命周期的持续过程，如同任何关键服务一样，需要被严谨地设计、实现和监控。",
    "url": "https://blog.bytebytego.com/p/a-guide-to-llm-evals"
  },
  {
    "id": "2026-01-12-ep197-12-architectural-concepts-developers-should-know",
    "title": "EP197: 12 Architectural Concepts Developers Should Know",
    "date": "2026-01-12",
    "preview": "EP197: 开发者应了解的 12 个架构概念  本周系统设计回顾：  ### 12 个开发者应了解的架构概念  *   **负载均衡（Load Balancing）**: 将传入流量分散到多个服务器，以确保没有单个节点过载。 *   **缓存（Caching）**: 将频繁访问...",
    "content": "EP197: 开发者应了解的 12 个架构概念\n\n本周系统设计回顾：\n\n### 12 个开发者应了解的架构概念\n\n*   **负载均衡（Load Balancing）**: 将传入流量分散到多个服务器，以确保没有单个节点过载。\n*   **缓存（Caching）**: 将频繁访问的数据存储在内存中以减少延迟。\n*   **内容分发网络（CDN）**: 将静态资源存储在地理位置分散的边缘服务器上，使用户可以从最近的位置下载内容。\n*   **消息队列（Message Queue）**: 通过让生产者将消息入队，消费者异步处理这些消息，从而解耦组件。\n*   **发布-订阅（Publish-Subscribe）**: 允许多个消费者从一个主题接收消息。\n*   **API 网关（API Gateway）**: 作为客户端请求的单一入口点，处理路由、认证、限流和协议转换。\n*   **熔断器（Circuit Breaker）**: 监控下游服务调用，当失败次数超过阈值时停止尝试。\n*   **服务发现（Service Discovery）**: 自动跟踪可用的服务实例，以便组件可以动态地定位和相互通信。\n*   **分片（Sharding）**: 根据特定的分片键将大型数据集拆分到多个节点上。\n*   **限流（Rate Limiting）**: 控制客户端在给定时间窗口内可以发出的请求数量，以保护服务免受过载。\n*   **一致性哈希（Consistent Hashing）**: 以一种方式在节点间分发数据，从而在节点加入或离开时最大限度地减少重新组织。\n*   **自动扩缩容（Auto Scaling）**: 根据定义的指标自动添加或移除计算资源。\n\n轮到你了：你会向此列表添加哪些架构概念？\n\n### 2026 年你可以使用的顶级开发者工具\n\n*   **代码编辑器和 IDEs（集成开发环境）**: 这些工具帮助开发者更高效地编写、编辑和调试代码。例如：Visual Code, IntelliJ IDEA, PyCharm, Cursor, Eclipse 等。\n*   **版本控制系统**: 跟踪代码随时间的变化，并支持团队成员之间的协作。例如：Git, GitHub, Gitlab, Bitbucket, AWS Code Commit 等。\n*   **测试工具**: 通过在代码发布到生产环境之前识别 bug，帮助确保代码按预期运行。例如：JUnit, Selenium, Playwright, Cypress 等。\n*   **CI/CD 工具（持续集成/持续部署）**: 它们帮助自动化代码的构建和部署过程，以加速交付。例如：Jenkins, GitHub Actions, Circle CI, Travis CI, Code Pipeline 等。\n*   **容器化与编排**: 帮助将应用程序及其依赖项打包到容器中，以确保它们在不同环境中以一致的方式运行。例如：Docker, Kubernetes, Podman, Containerd, Rancher 等。\n*   **项目管理工具**: 帮助开发团队规划、组织和跟踪开发任务。例如：JIRA, Asana, Trello, ClickUp, Notion 等。\n*   **API 测试工具**: 它们帮助测试和验证 API，以确保服务之间以及与外部消费者之间的稳定通信。例如：Postman, Swagger, Hopscotch, Insomnia 等。\n*   **AI 驱动的开发者工具**: 它们主要用于通过代码建议、错误检测和自动化代码生成来提高开发者生产力。例如：ChatGPT, Claude Code, Cursor, Copilot, Qodo 等。\n\n轮到你了：你还使用过哪些其他工具？\n\n### 保护系统的 5 种限流策略\n\n限流通过调整流量以匹配容量，并在请求到达时立即执行策略，从而保护服务免受过载或滥用。一个好的限流器会优化准确性、可预测性、公平性和低开销，实际系统会在这几者之间进行权衡。\n\n*   **固定窗口计数器（Fixed Window Counter）**: 在当前离散时间桶中计算请求数量，一旦达到阈值即拒绝请求。\n*   **滑动窗口日志（Sliding Window Log）**: 存储传入请求的精确时间戳，仅当过去 T 秒内的请求数仍在限制内时才允许请求。\n*   **滑动窗口计数器（Sliding Window Counter）**: 不保留请求时间戳日志，而是计算前一个时间窗口的加权计数器。当新请求到达时，根据权重调整计数器，如果总数低于限制则允许请求。\n*   **令牌桶（Token Bucket）**: 以稳定速率向桶中添加“令牌”。每个请求消耗一个令牌。如果令牌可用，请求立即通过。如果桶为空，则请求被拒绝或延迟。\n*   **漏桶（Leaky Bucket）**: 将请求排队并以固定的漏出速率释放它们。\n\n轮到你了：你还会向此列表添加哪些其他限流策略？\n\n### 直播流如何工作？\n\n直播流通过一些关键协议工作，例如 RTMP、HLS（由 Apple 制作）和 DASH（用于非 Apple 设备）。\n\n这是一个分步过程：\n\n*   **步骤 1**：摄像头和麦克风录制视频和音频。原始数据被发送到服务器。\n*   **步骤 2**：通过移除不必要的部分（例如分离背景）来缩小视频。然后，它被转换为 H.264 等标准格式，这使得通过互联网发送变得更容易。\n*   **步骤 3**：视频被切分成小片段，通常只有几秒钟长。这有助于在流式传输期间更快地加载。\n*   **步骤 4**：为了确保视频在各种设备和互联网速度下都能流畅播放，会创建不同质量级别的多个视频版本。这被称为自适应比特率流（Adaptive Bitrate Streaming）。\n*   **步骤 5**：然后，视频通过 CDN 发送到附近的服务器（边缘服务器）。这减少了延迟，并帮助数百万人同时观看视频。\n*   **步骤 6**：观众的手机、平板电脑或电脑接收视频，将其恢复为完整的视频和音频，并在视频播放器中播放。\n*   **步骤 7 和 8**：如果视频需要稍后再次观看，它会保存在存储服务器上。观众可以随时重播。\n\n轮到你了：你还会添加什么来帮助理解直播流过程？\n\n### 驱动现代数据库的 5 种领导者选举算法\n\n领导者选举算法在分布式系统中很重要，用于管理任务、维护一致性和做出决策。\n\n*   **Bully 算法（Bully Algorithm）**: 节点具有唯一的数字 ID，ID 最高的节点在通知其他节点后成为领导者。\n*   **环算法（Ring Algorithm）**: 节点以逻辑环形排列，并传递包含其 ID 的消息。ID 最高的节点获胜并成为领导者。\n*   **Paxos 算法（Paxos Algorithm）**: 一种基于法定人数的共识方法，其中提议者建议值，接受者投票，学习者识别选定的领导者。\n*   **Raft 算法（Raft Algorithm）**: 节点最初是追随者，如果没有检测到领导者则成为候选者。第一个获得多数票的节点成为领导者。\n*   **Zookeeper 原子广播（Zookeeper Atomic Broadcast）**: 使用临时顺序 znodes 来选举领导者，确保编号最小的 znode 持有者成为领导者。\n\n轮到你了：你还见过哪些其他领导者选举算法？\n\n---\n\n### 要点总结\n\n*   **系统架构基石**：文章概括了负载均衡、缓存、CDN、消息队列、API 网关、熔断器、服务发现、分片、限流、一致性哈希和自动扩缩容等 12 个核心架构概念，它们是构建高可用、高性能分布式系统的基础。\n*   **开发者工具全景**：介绍了 2026 年主要的开发者工具分类，涵盖代码编辑、版本控制、测试、CI/CD、容器化、项目管理、API 测试以及 AI 辅助开发等，展示了现代开发生态的广度和深度。\n*   **限流策略精要**：阐述了固定窗口计数器、滑动窗口日志、滑动窗口计数器、令牌桶和漏桶这 5 种主要的限流策略，强调了它们在保护系统免受过载和滥用方面的作用，并指出在准确性、可预测性、公平性与开销之间需要权衡。\n*   **直播流工作原理**：详细分解了直播流从视频采集、编码、切片、自适应比特率、CDN 分发到客户端播放的整个过程，并提及了 RTMP、HLS、DASH 等关键协议。\n*   **分布式领导者选举**：介绍了 Bully 算法、环算法、Paxos 算法、Raft 算法和 Zookeeper 原子广播等 5 种领导者选举算法，强调了它们在分布式系统中维护一致性、任务管理和决策的重要性。\n\n### 你可以从这篇文章学到什么\n\n对于有几年经验的后端/系统设计工程师来说，这篇文章提供了一个极佳的系统设计核心概念和现代开发工具的精简回顾和参考。\n\n1.  **巩固系统设计基础知识**：文章中列举的“12 个架构概念”对于经验丰富的工程师来说，可以快速巩固基础知识。这些概念虽然可能早已熟悉，但快速回顾有助于加深理解，并在讨论系统设计时提供统一的术语。这对于在新设计中检查是否遗漏了任何核心模式非常有帮助。\n2.  **了解现代工具生态**：虽然“顶级开发者工具”部分较为基础，但它突出了当前工具的广度以及 AI 在开发中日益增长的作用。经验丰富的工程师可以将其作为一个清单，评估团队在软件开发生命周期（SDLC）中是否使用了最新、高效的工具，尤其是在评估新技术或改进现有工作流程时。\n3.  **深入理解特定机制**：关于“限流策略”和“领导者选举算法”的章节提供了更细粒度的技术细节。对于后端工程师来说，理解不同限流算法（如固定窗口、滑动窗口、令牌桶和漏桶之间的权衡）的细微差别，对于实现健壮的流量控制至关重要。同样，掌握各种领导者选举算法对于设计或排查高可用分布式数据库和服务也是基础。\n4.  **剖析复杂系统流程**：以“直播流工作原理”为例，文章提供了一个具体的、高并发分布式系统的实现案例。分析其从捕获到 CDN 分发、自适应比特率流媒体的每一步流程，有助于工程师将类似的架构模式应用于其他媒体处理、实时数据或内容分发挑战。\n5.  **提升技术沟通效率**：文章对许多技术术语进行了标准化，这有助于在工程团队内部进行清晰沟通，并在评估第三方解决方案时提供共同的语言。",
    "url": "https://blog.bytebytego.com/p/ep197-12-architectural-concepts-developers"
  },
  {
    "id": "2026-01-11-ep197-12-architectural-concepts-developers-should-know",
    "title": "EP197: 12 Architectural Concepts Developers Should Know",
    "date": "2026-01-11",
    "preview": "EP197: 开发者应了解的12个架构概念  本周的系统设计速览：  开发者应了解的12个架构概念 *   **负载均衡 (Load Balancing)**：将传入流量分配到多个服务器，确保没有单个节点过载。 *   **缓存 (Caching)**：在内存中存储频繁访问的数据...",
    "content": "EP197: 开发者应了解的12个架构概念\n\n本周的系统设计速览：\n\n开发者应了解的12个架构概念\n*   **负载均衡 (Load Balancing)**：将传入流量分配到多个服务器，确保没有单个节点过载。\n*   **缓存 (Caching)**：在内存中存储频繁访问的数据，以减少延迟。\n*   **内容分发网络 (CDN)**：将静态资源存储在地理位置分散的边缘服务器上，使用户可以从最近的位置下载内容。\n*   **消息队列 (Message Queue)**：通过让生产者将消息入队，消费者异步处理消息，从而解耦组件。\n*   **发布-订阅 (Publish-Subscribe)**：使多个消费者能够从一个主题接收消息。\n*   **API 网关 (API Gateway)**：作为客户端请求的单一入口点，处理路由、身份验证、速率限制和协议转换。\n*   **熔断器 (Circuit Breaker)**：监控下游服务调用，当故障超出阈值时停止尝试。\n*   **服务发现 (Service Discovery)**：自动跟踪可用的服务实例，使组件能够动态地定位并相互通信。\n*   **分片 (Sharding)**：根据特定的分片键将大型数据集拆分到多个节点上。\n*   **速率限制 (Rate Limiting)**：控制客户端在给定时间窗口内发出的请求数量，以保护服务免受过载。\n*   **一致性哈希 (Consistent Hashing)**：以最小化节点加入或离开时重组数据的方式，将数据分布到节点上。\n*   **自动扩缩 (Auto Scaling)**：根据定义的指标自动添加或移除计算资源。\n\n2026年你可以使用的顶级开发者工具\n*   **代码编辑器与集成开发环境 (Code Editors & IDEs)**：这些工具帮助开发者更高效地编写、编辑和调试代码。例如 Visual Code, IntelliJ IDEA, PyCharm, Cursor, Eclipse 等。\n*   **版本控制系统 (Version Control Systems)**：跟踪代码随时间的变化，并支持团队成员之间的协作。例如 Git, GitHub, Gitlab, Bitbucket, AWS Code Commit 等。\n*   **测试工具 (Testing Tools)**：通过在代码发布到生产环境之前识别错误，帮助确保代码按预期运行。例如 JUnit, Selenium, Playwright, Cypress 等。\n*   **CI/CD 工具**：它们帮助自动化构建和部署代码的过程，以加快交付速度。例如 Jenkins, GitHub Actions, Circle CI, Travis CI, Code Pipeline 等。\n*   **容器化与编排 (Containerization and Orchestration)**：帮助将应用程序及其依赖项打包到容器中，以确保它们在不同环境中以一致的方式运行。例如 Docker, Kubernetes, Podman, Containerd, Rancher 等。\n*   **项目管理工具 (Project Management Tools)**：帮助开发团队规划、组织和跟踪开发任务。例如 JIRA, Asana, Trello, ClickUp, Notion 等。\n*   **API 测试工具 (API Testing Tools)**：它们帮助测试和验证 API，以确保服务之间以及与外部消费者的稳定通信。例如 Postman, Swagger, Hopscotch, Insomnia 等。\n*   **AI 驱动的开发者工具 (AI-Powered Developer Tools)**：主要用于通过代码建议、错误检测和自动化代码生成来提高开发者生产力。例如 ChatGPT, Claude Code, Cursor, Copilot, Qodo 等。\n\n保护系统的5种速率限制策略\n速率限制通过调整流量以匹配容量，并在请求到达时立即执行策略，从而保护服务免受过载或滥用。一个好的速率限制器会优化准确性、可预测性、公平性和低开销，实际系统会在这几者之间进行权衡。\n*   **固定窗口计数器 (Fixed Window Counter)**：在当前离散时间桶中计算请求数量，一旦达到阈值即拒绝请求。\n*   **滑动窗口日志 (Sliding Window Log)**：存储传入请求的精确时间戳，仅当过去 T 秒内的请求数量在限制之下时才允许请求通过。\n*   **滑动窗口计数器 (Sliding Window Counter)**：不是保留请求时间戳的日志，而是计算前一个时间窗口的加权计数。当新请求到达时，计数器会根据权重进行调整，如果总数低于限制，则允许请求。\n*   **令牌桶 (Token Bucket)**：以稳定速率向桶中添加“令牌”。每个请求消耗一个令牌。如果令牌可用，请求立即通过。如果桶为空，请求将被拒绝或延迟。\n*   **漏桶 (Leaky Bucket)**：将请求排队，并以固定的排水速率释放它们。\n\n直播如何工作？\n直播使用几种关键协议，如 RTMP, HLS (由 Apple 制作) 和 DASH (用于非 Apple 设备)。\n以下是分步过程：\n*   **步骤 1**：摄像头和麦克风录制视频和音频。原始数据被发送到服务器。\n*   **步骤 2**：通过移除不必要的部分（例如分离背景）来缩小视频。然后，它被转换为 H.264 等标准格式，这使得通过互联网发送更加容易。\n*   **步骤 3**：视频被切成小块，通常每块几秒钟长。这有助于在流式传输期间更快地加载。\n*   **步骤 4**：为了确保视频在各种设备和互联网速度下流畅播放，会创建多个不同质量级别的视频版本。这称为**自适应比特率流 (Adaptive Bitrate Streaming)**。\n*   **步骤 5**：然后视频通过 CDN 发送到附近的服务器（边缘服务器）。这减少了延迟，并帮助数百万人同时观看视频。\n*   **步骤 6**：观众的手机、平板电脑或电脑接收视频，将其转换回完整的视频和声音，并在视频播放器中播放。\n*   **步骤 7 和 8**：如果视频需要稍后再次观看，它会保存在存储服务器上。观众可以随时重播。\n\n驱动现代数据库的5种领导者选举算法\n领导者选举算法在分布式系统中很重要，用于管理任务、维护一致性和做出决策。\n*   **Bully 算法 (Bully Algorithm)**：节点具有唯一的数字 ID，ID 最高的节点在通知其他节点后成为领导者。\n*   **环算法 (Ring Algorithm)**：节点以逻辑环形排列，并传递包含其 ID 的消息。ID 最高的节点获胜并成为领导者。\n*   **Paxos 算法 (Paxos Algorithm)**：一种基于法定人数的共识方法，其中提议者建议值，接受者投票，学习者识别选定的领导者。\n*   **Raft 算法 (Raft Algorithm)**：节点最初是跟随者，如果未检测到领导者，则成为候选者。第一个获得多数票的节点成为领导者。\n*   **Zookeeper Atomic Broadcast**：使用瞬时有序 znode 来选举领导者，确保编号最低的 znode 持有者是领导者。\n\n---\n\n### 要点总结\n\n1.  **系统架构基础概念**: 文章概括了负载均衡、缓存、CDN、消息队列、API 网关、熔断器、服务发现、分片、速率限制、一致性哈希和自动扩缩等12个核心架构概念，它们是构建可伸缩、高可用分布式系统的基石。\n2.  **开发者工具概览**: 列举了2026年主流的开发者工具，涵盖了从代码编写（IDE）、版本控制、测试、CI/CD、容器化、项目管理到API测试和AI辅助开发等多个方面，为开发者提供了全面的工具选择。\n3.  **速率限制策略**: 详细介绍了固定窗口计数器、滑动窗口日志、滑动窗口计数器、令牌桶和漏桶等5种常用的速率限制策略，用于保护系统免受过载和滥用，并探讨了它们在准确性、可预测性、公平性和开销上的权衡。\n4.  **直播系统原理**: 逐步解释了直播从采集、编码、切片、自适应比特率流、CDN分发到客户端播放及存储回放的完整流程，揭示了其背后使用的关键协议（如RTMP, HLS, DASH）。\n5.  **分布式领导者选举算法**: 阐述了Bully、环、Paxos、Raft和Zookeeper Atomic Broadcast等5种在分布式系统中用于管理任务、维护一致性和决策的领导者选举算法，强调了它们在现代数据库中的应用。\n\n---\n\n### 你可以从这篇文章学到什么\n\n对于一个有几年经验的后端/系统设计工程师来说，这篇文章提供了一个快速而全面的技术回顾和知识梳理。它的价值在于：\n\n1.  **巩固和扩展基础知识体系**: 文章以精炼的语言概括了12个核心系统架构概念，无论是负载均衡、缓存、CDN，还是消息队列、API 网关和熔断器，这些都是构建健壮分布式系统不可或缺的组件。对于经验丰富的工程师而言，这有助于系统性地回顾和巩固这些概念，发现是否有遗漏或理解不深入的地方。\n2.  **了解常见解决方案的底层原理**: 文章深入探讨了速率限制策略和领导者选举算法，这些是解决分布式系统挑战的关键技术。理解这些策略（如令牌桶、漏桶）和算法（如 Paxos、Raft）的工作原理，能帮助工程师在设计高并发、高可用系统时做出更明智的选择，并预见潜在问题。\n3.  **洞察特定领域的系统设计**: 直播系统的工作原理提供了一个具体场景的端到端系统设计视角。了解从数据采集、编码、分发到播放的完整链条，以及自适应比特率流、CDN 在其中的作用，能为工程师在设计多媒体处理或大规模数据流系统时提供宝贵的参考和启发。\n4.  **掌握主流技术选型**: “顶级开发者工具”部分虽然简短，但包含了从IDE、版本控制、CI/CD到容器化和AI辅助开发等多个维度的常用工具。这有助于工程师了解行业主流的技术栈和生态，从而更好地进行工具选型和技术栈规划。\n5.  **提升面试和沟通能力**: 对这些概念和原理的清晰理解，不仅能提升实际设计能力，也能在技术面试或团队内部讨论中，更自信、准确地阐述系统设计思路和技术方案。\n\n将这些知识应用于实际工作时，工程师可以：\n*   在系统设计阶段，能够识别和选择合适的架构模式（如引入消息队列解耦、使用 API 网关统一入口），并根据业务需求进行权衡。\n*   在优化性能和稳定性时，能够运用缓存策略减少数据库压力，通过速率限制保护核心服务，或使用熔断器增强系统弹性。\n*   在构建高可用系统时，能够理解并实现基于领导者选举算法的分布式协调机制，确保服务在节点故障时仍能正常运行。\n*   在开发过程中，能够更有效地利用各种工具链，从代码管理、自动化部署到问题调试和项目管理，全面提升开发效率和质量。\n*   当面临新的业务挑战（如构建类似直播的实时系统）时，能够借鉴现有模式和协议，快速形成设计方案。",
    "url": "https://blog.bytebytego.com/p/ep197-12-architectural-concepts-developers"
  },
  {
    "id": "2026-01-10-must-know-message-broker-patterns",
    "title": "Must-Know Message Broker Patterns",
    "date": "2026-01-10",
    "preview": "现代分布式系统依赖消息中间件（message brokers）来实现独立服务之间的通信。 然而，要有效地使用消息中间件，需要理解解决常见挑战的架构模式。本文介绍了七种基本模式，它们能帮助开发者使用消息中间件构建可靠、可扩展和可维护的系统。 这些模式解决了三类核心问题： 确保服务之...",
    "content": "现代分布式系统依赖消息中间件（message brokers）来实现独立服务之间的通信。\n然而，要有效地使用消息中间件，需要理解解决常见挑战的架构模式。本文介绍了七种基本模式，它们能帮助开发者使用消息中间件构建可靠、可扩展和可维护的系统。\n这些模式解决了三类核心问题：\n确保服务之间的数据一致性\n高效管理工作负载\n获得消息基础设施的可见性。\n无论是构建电子商务平台、银行系统还是任何分布式应用，这些模式都为常见挑战提供了久经考验的解决方案。\n在本文中，我们将详细探讨每种模式，并理解它们在哪些场景下最有用。\n确保数据一致性\n\n---\n\n### 要点总结\n\n*   消息中间件在现代分布式系统中扮演着关键角色，用于实现独立服务间的异步通信。\n*   有效利用消息中间件需要掌握一系列解决常见挑战的架构模式。\n*   文章将介绍七种基本模式，旨在帮助开发者构建可靠、可扩展、可维护的系统。\n*   这些模式围绕三大核心问题展开：确保服务间数据一致性、高效管理工作负载，以及提升消息基础设施的可见性。\n*   文章将深入探讨每种模式及其适用的场景，首先会从“确保数据一致性”这一方面开始。\n\n### 你可以从这篇文章学到什么\n\n对于一名有几年经验的后端/系统设计工程师而言，这篇文章极具价值，因为它触及了现代分布式系统设计的核心——消息中间件的有效应用。你可以从中学习到：\n\n*   **系统化思维框架：** 文章将消息中间件的复杂应用归纳为数据一致性、工作负载管理和可见性三大类别。这种分类方法有助于你更有条理地分析和解决实际系统设计中的问题，而不是零散地应对挑战。\n*   **设计模式实践：** 虽然文章尚未展开具体模式，但它明确指出将介绍七种“必知”模式。这些模式是业界久经考验的解决方案，学习它们能够为你提供在不同场景下构建健壮、可伸缩消息系统的蓝图。例如，在处理跨服务事务时，你可能会联想到“事务性发件箱模式”来确保数据最终一致性。\n*   **解决实际挑战的能力：** 无论是应对高并发下的服务间通信，确保复杂业务流程中的数据完整性，还是提高分布式系统可观测性以快速定位问题，文章提及的模式都将是你的有力工具。这将帮助你在设计诸如电子商务、金融交易或物联网平台时，做出更明智的架构决策。\n*   **提升技术沟通效率：** 掌握这些通用模式的命名和概念，能让你在团队内部或与外部同行进行技术讨论时，更精准、高效地表达设计意图和解决方案。",
    "url": "https://blog.bytebytego.com/p/must-know-message-broker-patterns"
  },
  {
    "id": "2026-01-09-must-know-message-broker-patterns",
    "title": "Must-Know Message Broker Patterns",
    "date": "2026-01-09",
    "preview": "# 消息队列（Message Broker）的必备模式  现代分布式系统依赖消息队列（Message Broker）来实现独立服务间的通信。  然而，有效利用消息队列需要理解解决常见重复挑战的架构模式。本文将介绍七种基本模式，它们能帮助开发者使用消息队列构建可靠、可扩展和可维护的...",
    "content": "# 消息队列（Message Broker）的必备模式\n\n现代分布式系统依赖消息队列（Message Broker）来实现独立服务间的通信。\n\n然而，有效利用消息队列需要理解解决常见重复挑战的架构模式。本文将介绍七种基本模式，它们能帮助开发者使用消息队列构建可靠、可扩展和可维护的系统。\n\n这些模式主要解决三类核心问题：\n*   确保服务间数据一致性\n*   有效管理工作负载\n*   提升消息基础设施的可观测性（visibility）\n\n无论是构建电商平台、银行系统，还是任何分布式应用，这些模式都能为常见挑战提供久经考验的解决方案。\n\n在本文中，我们将详细探讨每种模式，并理解它们在哪些场景下能发挥最大作用。\n\n确保数据一致性\n\n---\n\n## 要点总结\n\n*   消息队列（Message Broker）是现代分布式系统实现服务间通信的关键。\n*   有效利用消息队列需要理解和应用常见的架构模式。\n*   本文将介绍七种帮助开发者构建可靠、可扩展、可维护系统的消息队列模式。\n*   这些模式主要解决分布式系统中的三大核心问题：数据一致性、工作负载管理和消息基础设施的可观测性。\n*   所介绍的模式适用于各种分布式应用场景，包括电商平台和银行系统。\n*   文章旨在深入探讨每种模式的具体细节及其最适用的场景。\n*   其中一个核心关注点是“确保数据一致性”。\n\n---\n\n## 你可以从这篇文章学到什么\n\n对于一个拥有数年经验的后端或系统设计工程师来说，这篇文章提供了一个系统性理解如何通过消息队列模式来解决分布式系统常见挑战的框架。\n\n1.  **系统性思维提升**: 文章概括了消息队列在解决分布式系统三大核心问题（数据一致性、工作负载管理、可观测性）中的应用，这有助于工程师跳出单一技术组件的视角，从更宏观的系统架构层面思考问题。\n2.  **解决复杂数据一致性问题**: 在微服务架构中，跨服务事务的数据一致性是普遍难题（例如，Saga模式）。了解“确保数据一致性”相关的消息队列模式，能够帮助工程师设计出鲁棒的最终一致性方案，避免服务间紧密耦合，并有效处理分布式事务中的失败场景。\n3.  **优化系统性能与弹性**: 通过学习“有效管理工作负载”的模式，工程师可以掌握如何利用消息队列进行削峰填谷（load leveling）、实现扇出（fan-out）或竞态消费者（competing consumers）等模式，从而提升系统吞吐量，降低延迟，并增强系统在面对突发流量时的弹性。\n4.  **增强系统可观测性与排障能力**: “提升消息基础设施的可观测性”相关模式，对于理解和监控消息流、追踪问题至关重要。这包括日志记录、分布式追踪与死信队列（Dead-Letter Queue）等实践，有助于工程师快速定位和解决生产环境中的问题。\n5.  **设计可维护、可扩展的架构**: 这些“久经考验的解决方案”是行业最佳实践的结晶。掌握它们，能够让工程师在设计新的微服务、重构现有遗留系统或选择特定消息队列技术时，拥有更清晰的思路和更可靠的方案，避免重复造轮子，并构建出更具前瞻性和可维护性的系统。",
    "url": "https://blog.bytebytego.com/p/must-know-message-broker-patterns"
  },
  {
    "id": "2026-01-08-how-ai-transformed-database-debugging-at-databricks",
    "title": "How AI Transformed Database Debugging at Databricks",
    "date": "2026-01-08",
    "preview": "# AI 如何彻底改变了 Databricks 的数据库调试  Databricks 是一个云平台，帮助公司将所有数据集中管理。它将数据仓库和数据湖的最佳特性结合到湖仓一体架构（lakehouse architecture）中，这意味着你可以存储和处理任何类型的数据。  最近，D...",
    "content": "# AI 如何彻底改变了 Databricks 的数据库调试\n\nDatabricks 是一个云平台，帮助公司将所有数据集中管理。它将数据仓库和数据湖的最佳特性结合到湖仓一体架构（lakehouse architecture）中，这意味着你可以存储和处理任何类型的数据。\n\n最近，Databricks 构建了一个内部的、由 AI 驱动的代理平台（agentic platform），该平台在跨越数百个区域、多个云平台上的数千个 OLTP（在线事务处理）实例中，将数据库调试时间减少了高达 90%。\n\n这个 AI 代理通过检索关键指标（metrics）和日志，并自动关联信号来进行解释、执行和调试。它极大地简化了 Databricks 工程师的工作。现在，他们可以用自然语言询问服务健康状况，而无需联系存储团队的值班工程师（on-call engineers）。\n\n最棒的是，这个平台从一个黑客马拉松项目演变为一个公司级的工具，它统一了大规模数据库管理的指标、工具和专业知识。本文将探讨 Databricks 工程团队如何构建这个平台以及在此过程中面临的挑战。\n\n## AI 前的工作流程及痛点\n\n在 AI 辅助之前的调试流程中，Databricks 工程师在调试数据库问题时，必须手动在多个工具之间切换。其工作流程如下：\n\n*   工程师首先会打开 Grafana，检查显示数据库随时间行为的性能指标和图表。\n*   接下来，他们会切换到 Databricks 的内部仪表盘，了解哪些客户端应用程序正在运行以及它们在数据库上产生了多少工作负载。\n*   然后，工程师会运行命令行界面（command-line interface）命令来检查 InnoDB 状态，这提供了 MySQL 内部状态的详细快照，包括活跃事务（active transactions）、I/O 操作以及任何死锁（deadlocks）。\n*   最后，工程师会登录到其云提供商的控制台，下载慢查询日志（slow query logs），这些日志揭示了哪些数据库查询耗时异常长。\n\n首次尝试缓解这一问题是在一次公司范围内的黑客马拉松中进行的，开发人员构建了一个简单的原型，将一些核心数据库指标和仪表盘统一到一个视图中。结果令人鼓舞。然而，在编写更多代码之前，Databricks 采取了研究驱动的方法，通过实际观察值班工程师在真实调试会话中的表现，并进行访谈，以第一手了解他们面临的挑战。\n\n第一个主要问题是工具碎片化（fragmented tooling），每个调试工具都完全独立工作，缺乏集成或与其他工具共享信息的能力。这种缺乏集成意味着工程师必须手动将来自多个不相关源的信息拼凑起来，这使得整个调试过程缓慢且容易出错。\n\n第二个主要问题是，工程师将大部分的事件响应时间花在收集上下文（gathering context）上，而不是实际解决问题。上下文收集包括弄清楚系统最近发生了什么变化，确定“正常”的基线行为（baseline behavior）是什么样子，以及寻找可能拥有相关知识的其他工程师。\n\n第三个主要问题是，在事件发生期间，工程师缺乏关于哪些缓解措施是安全有效的明确指导。如果没有清晰的运行手册（runbooks）或自动化指导，工程师要么会花费大量时间调查以确保他们完全理解情况，要么会等待资深专家出现并告诉他们该怎么做。\n\n## 通过迭代实现演进\n\nDatabricks 并非一次性构建其 AI 调试平台。他们经历了多个版本迭代。\n\n他们构建的第一个版本是一个静态代理工作流（static agentic workflow），它只是简单地遵循预先编写的调试标准操作程序（Standard Operating Procedure，SOP），本质上是一个分步核对清单。这个版本失败了，因为工程师不希望遵循手动清单，而是希望系统能够自动分析他们的情况，并提供带有即时洞察的诊断报告，指出问题所在。\n\n吸取了这次失败的教训，Databricks 构建了第二个版本，专注于异常检测（anomaly detection），该版本可以自动识别数据库指标中的异常模式或行为。然而，尽管异常检测系统成功地发现了相关问题，但它仍然有所不足，因为它只告诉工程师“问题出在哪里”，却没有提供明确的指导，说明接下来应该怎么做来解决这些问题。\n\n第三个版本带来了突破，它是一个交互式聊天助手，从根本上改变了工程师调试数据库的方式。这个聊天助手将专家调试知识编码化（codifies），这意味着它捕捉了资深数据库工程师的智慧和经验，并通过对话将其提供给所有人。与之前版本不同，聊天助手可以回答后续问题，允许工程师进行反复对话，而不仅仅是接收一次性报告。\n\n这种交互式特性将调试从一系列孤立的手动步骤转变为一个持续的、对话式的过程，AI 在整个调查过程中指导工程师。\n\n请看下面的演进图示：\n\n## 平台基础架构\n\n在 Databricks 工程团队能够有效地将 AI 添加到其调试平台之前，他们意识到需要构建一个坚实的架构基础，这将使 AI 集成变得有意义。这是因为任何代理都需要处理区域和云特定的逻辑。\n\n这是一个难题，因为 Databricks 在数百个区域、八个监管领域（regulatory domains）和三个云平台上运行着数千个数据库实例。团队认识到，如果不首先构建这个强大的架构基础，尝试添加 AI 功能将遇到不可避免的障碍。一些问题如下：\n\n*   如果没有这个基础，第一个问题将是上下文碎片化（context fragmentation），所有调试数据会分散在不同位置，使得 AI 代理无法获得关于情况的完整视图。\n*   第二个问题将是治理边界不清（unclear governance boundaries），这意味着将极难确保 AI 代理和人类工程师都在其适当的权限范围内操作，并且不会意外访问或修改他们不应该操作的东西。\n*   第三个问题将是迭代周期缓慢（slow iteration loops），不同云和区域之间不一致的操作方式将使得测试和改进 AI 代理的行为变得非常困难。\n\n为了支持这种复杂性，该平台建立在三个核心架构原则之上，它们共同作用，创建了一个统一、安全且可扩展的系统。\n\n### 全局 Storex 实例\n\n第一个原则是中心优先分片架构（central-first sharded architecture），这意味着有一个中央“大脑”（称为 Storex），它协调系统的许多区域性部分。\n\n这个全局 Storex 实例充当流量控制器，为工程师提供一个统一的接口来访问所有数据库，无论这些数据库物理上位于何处。即使工程师与一个中央系统交互，实际的敏感数据仍保留在每个区域本地，这对于满足隐私和监管要求至关重要。\n\n这种架构确保了跨八个不同监管领域（regulatory domains）的合规性，这些监管领域是拥有各自数据存储和访问规则的不同法律管辖区。\n\n### 细粒度访问控制\n\n第二个原则是细粒度访问控制（fine-grained access control），这意味着平台具有关于谁可以做什么的非常精确和详细的规则。访问权限在多个级别强制执行，例如：\n\n*   **团队级别：** 确定哪些团队可以访问什么。\n*   **资源级别：** 确定哪些特定的数据库或系统。\n*   **RPC（远程过程调用）级别：** 确定哪些特定的操作或函数调用。\n\n这种多层权限系统确保了人类工程师和 AI 代理都只执行他们被授权的操作，从而防止意外或未经授权的更改。\n\n### 统一编排\n\n第三个原则是统一编排（unified orchestration），这意味着平台将所有现有的基础设施服务整合到一个内聚的系统之下。\n\n这种编排创建了一致的抽象（consistent abstractions），这意味着无论工程师是在弗吉尼亚州的 AWS 上、欧洲的 Azure 上，还是亚洲的 Google Cloud 上，他们都可以用相同的方式操作数据库。通过提供这些一致的抽象，平台消除了工程师学习和处理云或区域特定操作差异的需要。\n\n## AI 代理实现\n\nDatabricks 工程团队为其 AI 代理构建了一个轻量级框架，其灵感来源于两种现有技术：MLflow 的提示优化工具（prompt optimization tools）和名为 DsPy 的系统。\n\n这个框架的关键创新在于它将提示（prompting）与工具实现（tool implementation）解耦（decouples），这意味着工程师可以改变 AI 的说法，而无需重写底层工具的工作方式。工程师通过编写带有函数签名（function signatures）的简单 Scala 类（一种编程语言）来定义工具，这些签名描述了工具的功能，而不是为 AI 编写复杂的指令。每个工具只需一个简单的文档字符串（docstring）描述（一段简短的文本解释），大型语言模型（LLM）就可以自动识别出三件重要事情：工具需要的输入格式、输出的结构以及如何解释结果。\n\n请看下面的图示：\n\n这种设计实现了快速迭代（rapid iteration），这意味着工程师可以快速尝试不同的提示，并灵活地替换工具，而无需修改处理数据解析、连接到 LLM 或管理对话状态的底层基础设施。\n\n### 代理决策循环\n\nAI 代理在一个持续的决策循环（decision loop）中运行，根据用户的需求决定采取哪些行动。\n\n*   首先，用户输入到达 Storex Router，它就像一个交换机，将请求路由到正确的位置。\n*   其次，LLM 端点（大型语言模型）根据用户的问题和当前的对话上下文生成响应。\n*   第三，如果 LLM 判断需要更多信息，它会执行一个工具调用（Tool Call）来检索数据，例如数据库指标、日志或配置详情。\n*   第四，LLM 响应处理工具的输出，在用户问题的上下文中解释数据的含义。\n*   第五，如果系统需要通过额外的工具调用来收集更多信息，它会循环回步骤 2；如果已收集到回答问题所需的一切信息，则会生成最终的用户响应。\n\n## 验证框架\n\nDatabricks 构建了一个验证框架，以确保在改进 AI 代理时，不会意外地使其性能下降或引入错误（即“回归”）。\n\n该框架捕获生产状态快照（snapshots of production state），这些快照就像时间中的冻结瞬间，记录了数据库的状态、存在的问题以及正确的诊断结果。快照包括数据库模式（database schemas，数据结构）、物理数据库信息（硬件和配置详情）、CPU 使用率和 IOPS（input/output operations per second，每秒输入/输出操作）等指标，以及代表“正确答案”的预期诊断输出。然后，这些快照会通过代理重放（replayed），这意味着系统将旧问题反馈给新版本的 AI，以观察其处理方式。一个独立的“评审”LLM 会根据两个关键标准对代理的响应进行评分：准确性（是否正确识别了问题）和有用性（是否向工程师提供了有用的指导）。\n\n所有这些测试结果都存储在 Databricks 表中，以便团队可以随时间分析趋势，并了解他们的更改是否确实改进了代理。\n\n## 多代理专业化\n\nDatabricks 的框架并没有构建一个试图包揽一切的巨型 AI 代理，而是使他们能够创建专门化的代理，每个代理专注于不同的领域或专业领域。\n\n他们有一个系统和数据库问题代理，专门处理数据库软件和硬件的底层技术问题。他们还有一个客户端流量模式代理，专门负责理解应用程序如何使用数据库以及异常的工作负载模式是否导致了问题。\n\n该框架允许他们随着识别出需要专业知识的新领域，轻松创建额外的领域特定代理。每个代理通过拥有专门为该领域量身定制的提示、工具和上下文，在其特定领域建立深厚的专业知识，而不是成为一个通才。\n\n这些专业化代理可以相互协作，提供完整的根本原因分析（root cause analysis），例如一个代理可能会识别出流量激增，而另一个代理则可能将其与特定的数据库配置问题相关联。\n\n## 结论\n\nDatabricks 的 AI 辅助调试平台在多个维度上取得了变革性的成果。\n\n该平台将调试时间减少了高达 90%，将过去需要数小时的调查任务变成了几分钟内即可完成的工作。也许最值得注意的是，没有任何背景知识的新工程师现在可以在 5 分钟内启动数据库调查。这在以前没有大量培训和经验的情况下几乎是不可能的。该平台已在所有工程团队中实现了公司范围内的采用，证明了其普遍价值，超越了最初需要它的数据库专家。\n\n用户反馈非常积极，工程师们指出他们不再需要记住各种查询仪表盘的位置，也不必花费时间去寻找特定信息。多位工程师将该平台描述为开发者体验（developer experience）的巨大变革。\n\n展望未来，该平台为 AI 辅助的生产操作奠定了基础，包括自动化数据库恢复、生产查询优化和配置更新。该架构旨在超越数据库，扩展到其他基础设施组件，有望改变 Databricks 大规模运营其整个云基础设施的方式。\n\n---\n\n## 要点总结\n\n1.  **痛点驱动的渐进式创新**：Databricks 从工具碎片化、上下文收集耗时和缺乏明确指导的调试痛点出发，通过从静态 SOP、异常检测到最终交互式聊天助手的迭代，逐步解决了这些问题。\n2.  **湖仓一体架构**：Databricks 利用 lakehouse architecture 统一数据管理，为 AI 平台的数据源整合提供了基础。\n3.  **代理平台效果**：AI 驱动的代理平台将数据库调试时间缩短了 90%，使新工程师也能在短时间内启动调试，显著提升了开发者体验。\n4.  **稳固的架构基础**：在引入 AI 之前，Databricks 优先构建了支持多区域、多云环境的强大架构，以解决上下文碎片化、治理边界不清和迭代缓慢的问题。\n5.  **核心架构原则**：平台基于“中心优先分片架构（Global Storex Instance）”、“细粒度访问控制（Fine-Grained Access Control）”和“统一编排（Unified Orchestration）”三大原则构建，确保系统统一、安全和可扩展。\n6.  **AI 代理框架解耦**：AI 代理的实现通过将“提示（prompting）”与“工具实现（tool implementation）”解耦，允许工程师快速迭代和替换工具，而无需修改底层基础设施。LLM 能自动解析工具输入输出。\n7.  **代理决策循环**：AI 代理通过 Storex Router、LLM Endpoint、Tool Call 和 LLM Response 构成一个持续的决策循环，实现对话式调试。\n8.  **严格的验证框架**：Databricks 建立了验证框架，通过捕获生产快照、回放问题，并使用“评审 LLM”评估准确性和有用性，确保 AI 代理的持续改进和防止回归。\n9.  **多代理专业化**：并非构建一个通用型 AI 代理，而是创建专注于不同领域（如系统/数据库问题、客户端流量模式）的专业化代理，它们可以协同工作进行根本原因分析。\n10. **未来扩展性**：该平台为 AI 辅助的生产操作（如自动化数据库恢复、查询优化）奠定基础，并计划将架构扩展到数据库之外的其他基础设施组件。\n\n---\n\n## 你可以从这篇文章学到什么\n\n对于一名有几年经验的后端/系统设计工程师来说，这篇文章提供了多方面的宝贵经验和设计启示：\n\n1.  **痛点驱动的渐进式创新**：Databricks 的 AI 调试平台并非一蹴而就，而是从实际痛点（工具碎片化、上下文缺失、缺乏指导）出发，经历了原型、SOP 自动化、异常检测，最终演进到交互式 AI 助手的迭代过程。这提醒我们在设计复杂系统时，应从小处着手，通过快速迭代和用户反馈来逐步完善，而非一开始就追求完美。\n2.  **AI 集成前的架构先行**：文章强调在有效引入 AI 之前，必须先构建一个坚实的基础架构来解决多区域、多云、数据治理和上下文碎片化等问题。这对于任何大型分布式系统的 AI 化改造都具有指导意义，即核心基础设施的稳定性、可扩展性和统一性是 AI 能力发挥作用的前提。\n3.  **核心架构原则的实践**：文中提到的“中心优先分片架构（Storex）”、“细粒度访问控制”和“统一编排”是解决多租户、跨区域、高合规性系统复杂性的关键。我们可以将这些原则应用于自己的系统设计中，例如在构建微服务时考虑统一的服务发现和治理，设计权限系统时采用多层次的细粒度控制，以及通过抽象层来屏蔽底层基础设施的差异。\n4.  **LLM 应用的解耦与迭代策略**：AI 代理框架将提示与工具实现解耦的设计非常精妙。这意味着我们可以独立更新 AI 的“思考逻辑”（prompt）和其可以调用的“能力”（tool），大大加速了开发和迭代。在实际项目中，可以借鉴这种思想，将业务逻辑与 LLM 的提示工程分离，使系统更具弹性和可维护性。同时，通过定义清晰的工具接口和利用 LLM 自动理解，可以有效降低集成成本。\n5.  **代理模式与专家系统融合**：文章展示了 AI 代理如何通过决策循环（Storex Router -> LLM -> Tool Call -> LLM Response）进行推理和行动，有效模拟了人类专家的诊断流程。此外，多代理专业化的设计模式（如数据库问题代理、流量模式代理）解决了单一通用代理难以处理复杂多领域问题的挑战，并允许它们协作完成更复杂的分析。这在设计智能运维、智能客服或其他需要多领域知识协作的 AI 应用时，是一个非常值得参考的模式。\n6.  **高质量的验证和回归预防**：Databricks 建立的验证框架，通过生产快照回放和“评审 LLM”进行评估，确保了 AI 代理在不断改进过程中不会引入新的问题。这强调了在 AI 系统开发中，严格的测试和验证机制至关重要，特别是对于涉及生产环境的自动化工具，其可靠性是核心关注点。\n7.  **对开发者体验的关注**：AI 平台显著提升了开发者体验，减少了寻找信息和手动操作的时间。在系统设计中，我们应该始终关注最终用户的体验，无论是内部工程师还是外部客户。一个技术再先进的系统，如果使用体验不佳，其价值也会大打折扣。\n8.  **面向未来的可扩展性**：Databricks 的架构设计不仅解决了当前问题，还为未来的 AI 辅助生产操作（如自动化数据库恢复、查询优化）和扩展到其他基础设施组件奠定了基础。这体现了优秀系统设计的前瞻性，即在满足当前需求的同时，也要考虑未来的演进方向和扩展可能。",
    "url": "https://blog.bytebytego.com/p/how-ai-transformed-database-debugging"
  },
  {
    "id": "2026-01-07-how-ai-transformed-database-debugging-at-databricks",
    "title": "How AI Transformed Database Debugging at Databricks",
    "date": "2026-01-07",
    "preview": "Databricks是一家云平台公司，旨在帮助企业在一个地方管理所有数据。它结合了数据仓库和数据湖的最佳特性，形成了“湖仓一体”（lakehouse architecture），这意味着您可以存储和处理任何类型的数据。  最近，Databricks构建了一个内部的AI驱动的智能体...",
    "content": "Databricks是一家云平台公司，旨在帮助企业在一个地方管理所有数据。它结合了数据仓库和数据湖的最佳特性，形成了“湖仓一体”（lakehouse architecture），这意味着您可以存储和处理任何类型的数据。\n\n最近，Databricks构建了一个内部的AI驱动的智能体平台，将数千个OLTP实例（联机事务处理实例）跨数百个区域、在多个云平台上的数据库调试时间缩短了高达90%。\n\n这个AI智能体通过检索关键指标和日志并自动关联信号来解释、执行和调试。它极大地简化了Databricks工程师的工作。他们现在可以用自然语言询问服务健康状况，而无需联系存储团队的随叫随到工程师。\n\n最棒的是，这个平台从一个黑客马拉松项目演变为一个公司范围的工具，它统一了用于大规模管理数据库的指标、工具和专业知识。在本文中，我们将探讨Databricks工程团队如何构建这个平台以及在此过程中面临的挑战。\n\n## AI前的工作流程和痛点\n\n在AI前的工作流程中，Databricks工程师在调试数据库问题时必须手动切换多个工具。工作流程如下：\n\n工程师首先打开 Grafana 检查性能指标和图表，了解数据库随时间的变化情况。\n接下来，他们会切换到 Databricks 的内部仪表盘，了解哪些客户端应用程序正在运行以及它们给数据库带来了多少工作负载。\n然后，工程师会运行命令行接口（CLI）命令检查 InnoDB 状态，这提供了 MySQL 内部状态的详细快照，包括活动事务、I/O 操作和任何死锁。\n最后，工程师会登录到其云服务提供商的控制台，下载慢查询日志，这些日志揭示了哪些数据库查询执行时间异常长。\n\n首次尝试缓解这个问题是在一次公司范围的黑客马拉松期间，开发人员构建了一个简单的原型，将一些核心数据库指标和仪表盘统一到一个单一视图中。结果令人鼓舞。然而，在编写更多代码之前，Databricks 采取了一种研究驱动的方法，通过实际观察随叫随到工程师的真实调试会话并进行访谈，以亲身了解他们面临的挑战。\n\n第一个主要问题是工具碎片化（fragmented tooling），每个调试工具都完全独立工作，没有任何集成或与其他工具共享信息的能力。这种缺乏集成意味着工程师必须手动将来自多个不相连源的信息拼凑起来，这使得整个调试过程缓慢且容易出错。\n\n第二个主要问题是，工程师在事件响应时间中大部分用于收集上下文，而不是实际解决问题。收集上下文涉及弄清楚系统最近发生了什么变化，确定“正常”基线行为是什么样子，以及寻找可能拥有相关知识的其他工程师。\n\n第三个主要问题是，工程师在事件期间缺乏明确的指导，不知道哪些缓解措施是安全的，哪些是真正有效的。如果没有明确的运行手册（runbooks）或自动化指导，工程师要么会花费大量时间调查以确保他们完全理解情况，要么会等待资深专家出现并告诉他们该怎么做。\n\n## 通过迭代演进\n\nDatabricks 并非一次性构建其AI调试平台，而是经历了多个版本。\n\n他们构建的第一个版本是一个静态智能体工作流，它只是遵循预先编写的“标准操作程序”（Standard Operating Procedure，SOP），本质上是一个分步核对清单。第一个版本失败了，因为工程师不希望遵循手动核对清单，而是希望系统自动分析他们的情况并提供一份诊断报告，其中包含关于问题所在地的即时洞察。\n\n从这次失败中吸取教训，Databricks 构建了第二个版本，专注于异常检测（anomaly detection），它可以自动识别数据库指标中不寻常的模式或行为。然而，尽管异常检测系统成功地发现了相关问题，但它仍然有所不足，因为它只告诉工程师“问题出在哪里”，而没有提供清晰的指导，说明接下来应该怎么做来解决这些问题。\n\n突破出现在第三个版本，这是一个交互式聊天助手，它从根本上改变了工程师调试数据库的方式。这个聊天助手将专家调试知识“编码化”（codifies），这意味着它捕捉了资深数据库工程师的智慧和经验，并通过对话将其提供给所有人。与之前版本不同，聊天助手可以回答后续问题，允许工程师进行来回对话，而不仅仅是接收一次性报告。\n\n这种交互性将调试从一系列孤立的手动步骤转变为一个连续的、对话式的过程，AI在整个调查过程中引导工程师。\n\n请看下面的演进图示：\n来源：Databricks Tech Blog\n\n## 平台基础架构\n\n在Databricks工程团队能够有效地将AI添加到其调试平台之前，他们意识到需要构建一个坚实的基础架构，以使AI集成有意义。这是因为任何智能体（agent）都需要处理区域和云特定的逻辑。\n\n这是一个难题，因为Databricks在数百个区域、八个监管域和三个云上运营着数千个数据库实例。团队认识到，如果不首先构建这个强大的基础架构，尝试添加AI功能将遇到不可避免的障碍。其中一些问题如下：\n\n如果没有这个基础，首先会出现的问题是上下文碎片化（context fragmentation），所有调试数据将分散在不同的位置，使得AI智能体无法获得正在发生的事情的完整画面。\n第二个问题将是治理边界不明确（unclear governance boundaries），这意味着将极难确保AI智能体和人类工程师都处于其适当的权限内，并且不会意外访问或修改他们不应该接触的东西。\n第三个问题将是迭代周期缓慢（slow iteration loops），在不同云和区域之间不一致的工作方式将使得测试和改进AI智能体的行为变得非常困难。\n为了支持这种复杂性，该平台基于三个核心架构原则构建，这些原则协同工作以创建统一、安全和可扩展的系统。\n\n### 全局 Storex 实例\n\n第一个原则是“中央优先分片架构”（central-first sharded architecture），这意味着有一个中央“大脑”（称为 Storex），它协调系统的许多区域性部分。\n\n这个全局 Storex 实例充当流量控制器，为工程师提供一个统一的接口来访问所有数据库，无论这些数据库物理上位于何处。尽管工程师与一个中央系统交互，但实际的敏感数据仍然保留在每个区域本地，这对于满足隐私和法规要求至关重要。\n\n这种架构确保了在八个不同的监管域（即具有自己关于数据存储位置和谁可以访问的规则的不同法律管辖区）的合规性。\n\n### 细粒度访问控制\n\n第二个原则是“细粒度访问控制”（fine-grained access control），这意味着平台具有非常精确和详细的规则，规定谁可以做什么。访问权限在多个层面强制执行，例如：\n\n团队层面（The Team Level）：确定哪些团队可以访问什么。\n资源层面（The Resource Level）：确定哪些特定的数据库或系统。\nRPC层面（The RPC Level）：确定哪些特定的操作或函数调用。\n这种多层权限系统确保人类工程师和AI智能体都只执行他们被授权执行的操作，从而防止意外或未经授权的更改。\n\n### 统一编排\n\n第三个原则是“统一编排”（unified orchestration），这意味着平台将所有现有的基础设施服务整合到一个有凝聚力的系统中。\n\n这种编排创建了“一致的抽象”（consistent abstractions），这意味着工程师可以使用相同的方式处理数据库，无论它们是在AWS的弗吉尼亚、Azure的欧洲还是Google Cloud的亚洲。通过提供这些一致的抽象，平台消除了工程师学习和处理云或区域特定差异的需要。\n\n## AI 智能体实现\n\nDatabricks 工程团队为其 AI 智能体构建了一个轻量级框架，其灵感来自两种现有技术：MLflow 的提示优化工具和名为 DsPy 的系统。\n\n这个框架的关键创新在于它将提示（prompting）与工具实现（tool implementation）解耦（分离），这意味着工程师可以更改 AI 的说法，而无需重写底层工具的工作方式。工程师通过编写带有函数签名的简单 Scala 类（一种编程语言）来定义工具，这些函数签名描述了工具的功能，而不是为 AI 编写复杂的指令。每个工具只需要一个简单的文档字符串描述（docstring description，一个简短的文本解释），大型语言模型就可以自动识别三个重要事项：工具需要什么格式的输入，输出将具有什么结构，以及如何解释结果。\n\n请看下面的图示：\n这种设计实现了快速迭代，这意味着工程师可以快速尝试不同的提示，并快速插拔工具，而无需修改处理数据解析、连接到 LLM 或管理对话状态的底层基础设施。\n\n### 智能体决策循环\n\nAI智能体在一个连续的决策循环中运行，根据用户的需求决定采取什么行动。\n\n首先，用户输入会发送到 Storex Router，它就像一个总机，将请求引导到正确的位置。\n其次，LLM Endpoint（大型语言模型）根据用户的问题和当前的对话上下文生成响应。\n第三，如果LLM确定需要更多信息，它会执行一个 Tool Call（工具调用）来检索数据库指标、日志或配置详细信息等数据。\n第四，LLM Response（LLM响应）处理来自工具的输出，在用户问题的上下文中解释数据的含义。\n第五，系统要么循环回到步骤2，通过额外的工具调用收集更多信息，要么如果它拥有回答问题所需的一切，则生成最终的 User Response（用户响应）。\n\n## 验证框架\n\nDatabricks 构建了一个验证框架，以确保在改进 AI 智能体时，不会意外地使其性能下降或引入错误（称为“回归”）。\n\n该框架捕获生产状态的快照（snapshots of production state），这些快照就像冻结的时间瞬间，记录了数据库的样子、存在的问题以及正确的诊断结果。快照包括数据库 schemas（数据结构）、物理数据库信息（硬件和配置细节）、CPU 使用率和 IOPS（每秒输入/输出操作）等指标，以及代表“正确答案”的预期诊断输出。然后，这些快照会通过智能体进行“重放”（replayed），这意味着系统会将旧问题输入到新版本的 AI 中，以查看其处理方式。一个独立的“评判”LLM 会根据两个关键标准对智能体的响应进行评分：准确性（是否正确识别了问题）和有用性（是否向工程师提供了有用的指导）。\n\n请看下面的图示：\n所有这些测试结果都存储在 Databricks 表中，以便团队可以随时间分析趋势，并了解他们的更改是否真正改善了智能体。\n\n## 多智能体专业化\n\nDatabricks 的框架并没有构建一个试图包罗万象的巨型 AI 智能体，而是允许他们创建专门的智能体，每个智能体都专注于不同的领域或专业知识。\n\n他们有一个“系统和数据库问题智能体”（system and database issues agent），专门处理数据库软件和硬件的底层技术问题。他们还有一个“客户端流量模式智能体”（client-side traffic patterns agent），专门用于理解应用程序如何使用数据库以及异常工作负载模式是否导致问题。\n\n该框架允许他们轻松创建额外的领域特定智能体，因为他们确定了需要专业知识的新领域。每个智能体通过拥有专门针对该领域的提示、工具和上下文来建立其特定领域的深厚专业知识，而不是成为一个通才。\n\n这些专业智能体可以相互协作，提供完整的根本原因分析，例如一个智能体可能识别出流量高峰，而另一个智能体可能将其与特定的数据库配置问题相关联。\n\n## 结论\n\nDatabricks AI 辅助调试平台的结果在多个维度上都具有变革性。\n\n该平台将调试时间缩短了高达90%，将过去需要数小时的调查变成了几分钟内即可完成的任务。或许最显著的是，没有任何上下文的新工程师现在可以在5分钟内开始数据库调查。这在以前，如果没有大量的培训和经验，几乎是不可能的事情。该平台已在所有工程团队中实现了公司范围的采用，证明了其普遍价值，超越了最初需要它的数据库专家。\n\n用户反馈非常积极，工程师们指出他们不再需要记住各种查询仪表盘的位置，也不再需要花时间去寻找特定信息。多位工程师将该平台描述为开发人员体验的一次巨大变革。\n\n展望未来，该平台为AI辅助生产运营奠定了基础，包括自动化数据库恢复、生产查询优化和配置更新。该架构旨在超越数据库，扩展到其他基础设施组件，有望改变Databricks大规模运营整个云基础设施的方式。\n\n## 参考文献\n\n*   How We Debug 1000s of Databases with AI at Databricks\n*   Build generative AI apps using DSPy on Databricks\n\n---\n\n## 要点总结\n\n*   **AI赋能数据库调试效率提升**：Databricks构建的AI驱动智能体平台将大规模OLTP数据库调试时间缩短高达90%，显著提升了工程师效率。\n*   **统一碎片化工具与知识**：该平台将多种独立的调试工具、性能指标和专家知识统一到一个集成界面，解决了传统手动调试流程中工具碎片化和上下文收集耗时的问题。\n*   **迭代演进策略**：平台通过多版本迭代逐步成熟，从失败的静态SOP（标准操作程序）和仅异常检测系统，最终发展为交互式聊天助手，实现了从“发现问题”到“指导解决问题”的飞跃。\n*   **强调基础架构先行**：在引入AI前，Databricks先构建了坚实的基础架构，以处理跨区域、多云环境的复杂性，避免了上下文碎片化、治理边界不清和迭代缓慢等问题。\n*   **核心架构原则**：平台基于“中央优先分片架构”（Global Storex Instance）、“细粒度访问控制”（Fine-Grained Access Control）和“统一编排”（Unified Orchestration）三大原则，确保系统统一、安全和可扩展性。\n*   **AI智能体框架创新**：通过解耦提示与工具实现，工程师可以灵活定义工具（如Scala类），LLM自动理解工具的输入、输出和结果解释，实现快速迭代。\n*   **智能体决策循环**：AI智能体通过 Storex Router 接收用户输入，LLM生成响应，并根据需要执行 Tool Call 获取数据，形成一个连续的、上下文感知的决策循环。\n*   **强大的验证框架**：通过捕获生产状态快照、重放旧问题并使用“评判”LLM评估准确性和有用性，确保AI智能体的持续改进和防止回归。\n*   **多智能体专业化**：允许创建针对不同领域（如系统问题、流量模式）的专业智能体，它们可以协作进行根本原因分析，而非构建一个包罗万象的通用智能体。\n*   **深远影响与未来展望**：平台不仅极大改善了开发人员体验，还为AI辅助生产运维（如自动化数据库恢复、查询优化）奠定了基础，并有望扩展到其他基础设施组件。\n\n---\n\n## 你可以从这篇文章学到什么\n\n对于一个有几年经验的后端/系统设计工程师来说，这篇文章提供了宝贵的实践经验和设计思路，尤其是在构建复杂分布式系统和集成AI能力方面：\n\n1.  **产品演进与MVP（最小可行产品）理念**：文章展示了Databricks如何通过迭代（从黑客马拉松原型到静态SOP，再到异常检测，最终到交互式聊天助手）逐步完善其AI调试平台。这强调了在复杂项目初期，即使是一个简单原型也能验证核心价值，然后通过持续的用户反馈和失败中学习，逐步迭代产品功能。这对于你在设计新系统或功能时，如何规划版本发布和功能优先级非常有借鉴意义。\n2.  **基础架构先行的重要性**：在引入复杂的AI能力之前，Databricks团队优先构建了强大的基础架构来处理多区域、多云、大规模部署的复杂性（如Global Storex、细粒度访问控制、统一编排）。这揭示了一个核心系统设计原则：健壮、可扩展、安全的基础是上层创新（特别是AI）成功落地的关键。如果你的系统需要处理跨区域、跨服务或复杂权限管理等问题，应首先投入精力在这些基础能力上。\n3.  **解耦与抽象的设计思想**：AI智能体框架中“提示与工具实现解耦”的设计非常精妙。它允许AI逻辑（提示）和业务逻辑/数据获取（工具）独立演进，极大提高了系统的灵活性和迭代速度。在日常系统设计中，你可以思考如何在不同的层级或模块之间引入类似的解耦和抽象，以应对快速变化的需求，例如：将业务规则与数据访问分离，将API定义与底层实现分离等。\n4.  **AI在运维领域的应用范例**：文章提供了一个AI如何变革传统运维（尤其是数据库调试）的生动案例。AI智能体能够聚合信息、关联信号、提供诊断和建议，甚至进行交互式问答。这启发我们思考AI在其他运维场景（如故障预测、资源优化、日志分析）中的潜力，并可以借鉴其“工具调用”和“决策循环”机制来设计自己的AI辅助系统。\n5.  **质量保障与验证的重要性**：Databricks构建的验证框架（捕获生产快照、重放问题、LLM评分）是确保AI系统质量和防止回归的关键。在任何复杂系统（尤其是涉及AI或复杂业务逻辑）的开发中，建立一套严谨的测试和验证机制至关重要，以确保每次改动都能带来正向收益。你可以借鉴这种“快照+重放+自动评估”的模式来构建自己的回归测试和A/B测试框架。\n6.  **多智能体协作模式**：文章提到的“多智能体专业化”策略，即让多个专业智能体协作解决复杂问题，比构建一个单一的通用智能体更有效。这在设计复杂业务流程时也很有用，你可以将一个大问题拆解成多个小领域，然后由不同的、专精的微服务或组件来处理，并通过编排它们来完成整体任务。\n\n通过学习Databricks的实践，你不仅能了解AI技术在实际工程中的应用，更能深入理解大型系统设计、演进和运维的通用原则。",
    "url": "https://blog.bytebytego.com/p/how-ai-transformed-database-debugging"
  },
  {
    "id": "2026-01-06-how-google-s-tensor-processing-unit-tpu-works",
    "title": "How Google’s Tensor Processing Unit (TPU) Works?",
    "date": "2026-01-06",
    "preview": "# Google的张量处理单元（TPU）是如何工作的？  当DeepMind的AlphaGo在2016年3月击败围棋世界冠军李世石时，世界见证了人工智能的一个重要时刻。这场比赛由Google已经运行了一年多但从未公开承认的硬件提供动力。  张量处理单元（TPU）不仅仅是另一个快速...",
    "content": "# Google的张量处理单元（TPU）是如何工作的？\n\n当DeepMind的AlphaGo在2016年3月击败围棋世界冠军李世石时，世界见证了人工智能的一个重要时刻。这场比赛由Google已经运行了一年多但从未公开承认的硬件提供动力。\n\n张量处理单元（TPU）不仅仅是另一个快速芯片，它代表了一种计算理念的根本转变：有时少即是多。\n\n自那时起，Google的TPU家族自2015年以来已经发展了七代，从处理图像识别查询的单芯片扩展到训练现存最大语言模型的9216芯片超级计算机。在本文中，我们将探讨Google为何构建定制芯片，以及它是如何工作的，揭示他们必须做出的物理限制和工程权衡。\n\n## 对TPU的需求\n\n2013年，Google的基础设施团队进行了一项计算。如果Android用户按照Google的预期大规模采用语音搜索，每天仅使用三分钟，那么计算需求将需要将公司全球数据中心的总规模翻一番。\n\n当时这个问题没有明显的解决方案。建造更多装满传统处理器的数据中心在经济上是不可行的。更重要的是，摩尔定律已经放缓多年。几十年来，半导体行业一直依赖于晶体管密度大约每两年翻一番的观察，在没有架构变化的情况下提供定期的性能改进。然而，到2013年，这一趋势正在减弱。Google不能仅仅等待Intel的下一代CPU来解决其问题。\n\n这种情况的根本原因在于架构。传统计算机遵循冯·诺依曼（Von Neumann）架构，其中处理器和内存通过共享总线进行通信。要执行任何计算，CPU必须获取指令，从内存中检索数据，执行操作，并将结果写回。处理器和内存之间这种持续的信息传输造成了计算机科学家所称的冯·诺依曼瓶颈（Von Neumann bottleneck）。\n\n跨总线移动数据的能耗通常超过计算本身的能耗。例如，想象一位厨师准备饭菜，但每次取食材都必须走到一个遥远的食品储藏室。烹饪只需几秒钟，但走路却要花费数小时。对于文字处理或网页浏览等通用计算任务，这种设计是有意义的，因为工作负载是不可预测的。然而，神经网络不同。\n\n深度学习模型主要执行一种操作：矩阵乘法。神经网络通过将输入数据乘以学习到的权重矩阵，添加偏差值，并应用激活函数来处理信息。这在一次预测中发生数十亿次。具有数千亿参数的现代语言模型，每次查询需要数千亿次乘加（multiply-add）操作。关键是，这些操作是可预测的、并行的和确定性的。\n\nCPU将大量的处理能力投入到分支预测（branch prediction）和乱序执行（out-of-order execution）等功能上，这些功能旨在处理不可预测的代码。图形处理单元（GPUs）通过数千个并行工作的核心改善了情况，但它们仍然带有图形 heritage 的架构开销。Google的洞察是构建只执行神经网络所需操作的芯片，并剥离所有其他功能。\n\n## 脉动阵列：一种不同的计算方式\n\nTPU的核心是一种名为脉动阵列（systolic array）的架构。这个名字来源于希腊语中“心跳”一词，指代数据以有节奏的方式通过芯片脉动。为了理解这为何重要，请考虑不同处理器如何处理相同的任务。\n\nCPU的操作就像一个单一的工人，在水井和火场之间来回奔跑，一次只装一桶水。\nGPU部署了数千名工人同时进行相同的行程。吞吐量增加了，但水井和火场之间的交通变得混乱且耗能。\n脉动阵列采取了根本不同的方法。工人排成一排，手递手地传递水桶。水流通过链条，直到工作完成，没有人需要返回水源。\n\n在TPU中，工人是排列成密集网格的简单乘加（multiply-accumulate）单元。第一代TPU使用了256 x 256的阵列，意味着65,536个计算器同时运行。计算过程如下：\n\n1.  神经网络权重从上方加载到每个计算器中，并保持静止。\n2.  输入数据从左侧逐行流入。\n3.  当数据通过每个计算器时，它会与驻留的权重相乘。\n4.  乘积加到运行中的和中，然后向右传递到下一个计算器。\n5.  部分结果累积并向下流动。\n6.  所有计算完成后，最终结果从底部输出。\n\n请参见下面的图表：\n\n这种设计意味着数据从内存中读取一次，但在遍历阵列时被使用了数千次。传统处理器几乎每次操作都必须访问内存。脉动阵列消除了这个瓶颈。数据只通过短线在空间相邻的计算器之间移动，大大降低了能耗。\n\n这些数字有力地支持了这种方法。\n\n*   TPU v1的256 x 256阵列每时钟周期可以执行65536次乘加操作。以700 MHz运行，每秒可提供92万亿次8位操作，同时仅消耗40瓦。\n*   同时代的GPU每周期可能执行数万次操作，而TPU执行数十万次。\n*   超过90%的芯片用于有用的计算，而GPU中大约只有30%。\n\n这里的权衡是绝对的专业化。脉动阵列只能高效地执行矩阵乘法。它不能渲染图形、浏览网页或运行电子表格。Google接受了这一限制，因为神经网络的推理本质上是多次重复的矩阵乘法。\n\n## 支持架构\n\n脉动阵列需要精心编排的支持组件才能达到其性能。每个部分都解决了从原始数据到AI预测的管道中的特定瓶颈。\n\n让我们看看最重要的组件：\n\n### 矩阵乘法单元（Matrix Multiply Unit, MXU）\n\n矩阵乘法单元（MXU）就是脉动阵列本身。\n\nTPU v1使用单个256x256的8位整数阵列。后期版本转向使用Google的BFloat16格式的128x128阵列，用于训练工作负载，然后在v6中返回到256x256阵列，以实现四倍的吞吐量。权重驻留设计（weight-stationary design）最大限度地减少了数据移动，这是计算中主要的能耗来源。\n\n来源：Google Cloud Research Blog\n\n### 统一缓冲区（Unified Buffer）\n\n统一缓冲区提供24兆字节的片上SRAM，作为慢速外部存储器和饥渴的MXU之间的高速暂存区域。\n\n该缓冲区存储从主机计算机接收的输入激活（input activations）、神经网络层之间的中间结果以及传输前的最终输出。由于此内存直接位于芯片上，因此它以比外部内存更高的带宽运行。这种差异对于保持MXU持续获得数据而不是空闲等待内存访问至关重要。\n\n### 向量处理单元（Vector Processing Unit）\n\n向量处理单元（VPU）处理MXU无法执行的操作。这包括ReLU、sigmoid和tanh等激活函数。\n\n神经网络需要非线性才能学习复杂的模式。没有它，多个层将在数学上坍缩为单个线性变换。TPU没有在软件中实现这些功能，而是拥有专用的硬件电路，可以在一个周期内计算激活。数据通常从MXU流向VPU进行激活处理，然后移动到下一层。\n\n### 累加器（Accumulators）\n\n累加器收集从MXU流出的32位结果。\n\n当乘以8位输入时，乘积是16位，但累加和通过重复加法会变得更大。使用32位累加器可以防止矩阵乘法所需的多次加法期间的溢出。累加器内存总计4兆字节，分布在4,096个256元素的向量中。\n\n### 权重先进先出缓冲区（Weight FIFO Buffer）\n\n权重FIFO缓冲区使用双缓冲（double-buffering）技术在外部内存和MXU之间暂存权重。\n\nMXU持有两组权重块（weight tiles）：一组正在积极计算，而另一组正在从内存加载。这种重叠完全隐藏了内存延迟，确保计算单元永远不会等待数据。\n\n### 高带宽内存（High Bandwidth Memory, HBM）\n\n高带宽内存（HBM）在TPU世代中不断演进。\n\n最初的v1使用DDR3内存，提供34千兆字节每秒。现代Ironwood TPU达到了7.4兆兆字节每秒，提高了217倍。HBM通过垂直堆叠多个DRAM裸片，并在它们之间建立数千个连接来实现这一点，从而实现传统内存封装无法实现的带宽。\n\n## 精度优势\n\nTPU通过量化（quantization）获得了显著的效率，它使用比传统浮点算法更低精度的数字。这种选择对整个设计产生了巨大的硬件影响。\n\n科学计算通常需要高精度。将π计算到小数点后十位需要非常仔细地表示非常小的差异。然而，神经网络的操作方式不同。它们计算概率和模式。例如，模型预测图像有85%可能是猫，与85.3472%可能是猫，在分类上没有实际区别。\n\n乘法器电路的硅面积与位宽的平方成比例。一个8位乘法器大约需要64个单位的硅面积，而一个32位乘法器大约需要576个单位。这种数学关系解释了为什么TPU v1可以将65,536个乘加单元封装到一个适度的芯片中，而GPU包含的浮点单元则少得多。更多的乘法器意味着每个周期更多的并行操作。\n\n第一代TPU使用8位整数进行推理，与32位浮点数相比，内存需求减少了四倍。一个91兆字节的模型量化后变为23兆字节。研究表明，推理很少需要32位精度。额外的十进制位数并不会对预测产生有意义的影响。\n\n训练需要更高的精度，因为小的梯度更新会在数百万次迭代中累积。Google通过发明BFloat16（Brain Floating-Point 16）解决了这个问题。这种格式保持与32位浮点数相同的8位指数，但只使用7位尾数（mantissa）。关键的洞察是，神经网络对动态范围（由指数控制）远比对精度（由尾数控制）更敏感。BFloat16以一半的位数提供了宽范围的浮点格式，实现了高效训练，避免了其他16位格式所困扰的溢出问题。\n\n请参见下面的图表：\n\n来源：Google Cloud Research Blog\n\n现代TPU支持多种精度模式。\n\n*   BFloat16 用于训练。\n*   INT8 用于推理，在TPU v5e上运行速度是两倍。\n*   最新的FP8格式。\n\nIronwood是第一个支持原生FP8的TPU，避免了早期世代的仿真开销。\n\n## 演进历程\n\nTPU的发展遵循清晰的轨迹。\n\n每一代都提高了性能，同时改善了能源效率。这种演变揭示了随着模型规模的扩大，AI硬件需求是如何变化的。\n\nTPU v1于2015年秘密推出，专门专注于推理。它基于28纳米工艺技术构建，仅消耗40瓦，每秒可提供92万亿次8位操作。该芯片通过PCIe连接到标准服务器，并在Google外部无人知晓其存在之前，开始为Google搜索、照片、翻译和YouTube提供动力。2016年3月，TPU v1助力AlphaGo战胜李世石，证明了应用特定芯片在速度上可以比通用GPU快15到30倍，在能效上高30到80倍。\n\nTPU v2于2017年推出，进行了根本性的架构更改以支持训练。将256x256的8位阵列替换为两个128x128的BFloat16阵列，实现了训练所需的浮点精度。增加了高带宽内存（HBM），16千兆字节，速度为每秒600千兆字节，消除了限制v1的内存瓶颈。最重要的是，v2引入了芯片间互连（Inter-Chip Interconnect），即连接TPU之间的高速定制链路。这使得TPU Pods成为可能，其中256个芯片作为一个单一加速器运行，提供11.5 petaflops的性能。\n\nTPU v3于2018年将每个芯片的性能翻倍至420 teraflops，并引入液冷以应对增加的功率密度。Pod规模扩展到1,024个芯片，超过100 petaflops，足以在合理的时间范围内训练当时最大的AI模型。\n\nTPU v4于2021年带来了多项创新。SparseCores使用仅占芯片面积5%的区域，将推荐系统和语言模型中关键的嵌入操作（embedding operations）加速了五到七倍。光学电路交换机（Optical Circuit Switches）实现了动态网络拓扑重新配置。它不再使用固定的电缆，而是通过机器人镜子在光纤之间引导光束。这使得互连可以绕过故障，并扩展到接近exaflop的4,096芯片Pod。3D环形拓扑（3D torus topology）中，每个芯片连接到六个邻居而不是四个，减少了分布式训练的通信延迟。\n\nIronwood（TPU v7）于2025年推出，代表了最重大的飞跃。它专为推理时代设计，在这个时代，大规模部署AI比训练更重要。每个芯片提供4,614 teraflops的性能，配备192千兆字节的HBM，带宽达到7.4兆兆字节每秒。\n\n## 结论\n\nTPU的部署在各种应用中展现了实际影响。\n\n例如，一个TPU每天处理超过1亿张Google照片。AlphaFold解决了长达50年的蛋白质折叠问题，并因此获得了2024年诺贝尔化学奖，其运行就依赖于TPU。训练PaLM（一个5400亿参数的语言模型），在6,144个TPU v4芯片上，50天内达到了57.8%的硬件利用率，这对于如此规模的分布式训练来说是卓越的效率。除了Google，TPU还为Anthropic的Claude助手、Midjourney的图像生成模型以及众多研究突破提供动力。\n\n然而，TPU并非在所有方面都普遍优越。它们擅长大规模语言模型训练和推理、具有大量矩阵运算的CNNs和Transformers、高吞吐量批处理以及优先考虑能效的工作负载。另一方面，GPU仍然是PyTorch原生开发更好的选择，尽管这需要PyTorch/XLA桥接，会带来一些摩擦。小批量大小、混合AI和图形工作负载、多云部署以及快速原型开发通常更倾向于GPU。\n\nTPU代表了行业向领域特定加速器（domain-specific accelerators）的更广泛转变。\n\n当工作负载扩展到每次查询数万亿次操作时，通用计算模型（即CPU能较好地运行任何程序）就会遇到物理限制。牺牲灵活性以提高效率的专用芯片能够带来数量级的改进，这是任何通用处理器优化都无法比拟的。\n\n## References:\n\n*   BFloat16: The secret to high performance on Cloud TPUs\n*   An in-depth look at Google’s first Tensor Processing Unit (TPU)\n*   TPU Architecture\n*   Introduction to Cloud TPU\n\n---\n\n## 要点总结\n\n*   **定制化需求驱动**：Google为了应对AI（特别是语音搜索）巨大的计算需求增长和摩尔定律放缓的挑战，决定构建专用硬件TPU，而非依赖通用CPU或GPU。\n*   **克服冯·诺依曼瓶颈**：传统CPU的冯·诺依曼架构中，数据在处理器和内存之间频繁移动产生瓶颈。TPU通过其核心的脉动阵列设计，大大减少了数据移动的能耗和延迟。\n*   **脉动阵列核心**：TPU的核心是脉动阵列，它通过将计算单元（乘加器）密集排布，并让数据像心跳一样流经阵列，实现数据只读取一次但被多次使用，从而实现高并行度和高能效。\n*   **高度专业化**：TPU通过牺牲通用性来换取效率。它专注于矩阵乘法，这是神经网络最核心的操作，从而剥离了通用处理器（如CPU和GPU）中处理不可预测工作负载的复杂功能。\n*   **关键辅助组件**：MXU（矩阵乘法单元）执行核心计算，Unified Buffer（统一缓冲区）提供高速片上缓存，VPU（向量处理单元）处理激活函数，Accumulators（累加器）防止溢出，Weight FIFO Buffer（权重FIFO缓冲区）和HBM（高带宽内存）确保数据高效供给。\n*   **精度优化**：TPU利用量化（quantization）和低精度计算（如INT8用于推理，BFloat16用于训练）大幅提升效率和减少内存占用。BFloat16通过保持与32位浮点数相同的指数位宽，有效平衡了动态范围和精度需求。\n*   **集群扩展能力**：TPU通过Inter-Chip Interconnect实现芯片间互联，形成TPU Pods，能够将数百甚至数千个芯片聚合为单一的超级计算机，进行大规模分布式训练。\n*   **创新互连技术**：TPU v4引入了光学电路交换机（Optical Circuit Switches），通过机器人镜子动态重配置网络拓扑，提高可扩展性、可靠性并降低通信延迟。\n*   **性能和效率提升**：TPU在每一代都显著提高了吞吐量和能源效率，从TPU v1的每秒92万亿次8位操作到Ironwood（TPU v7）的每芯片4,614 teraflops。\n*   **适用场景**：TPU特别适合大规模语言模型训练和推理、CNN和Transformer等需要大量矩阵操作的模型、高吞吐量批处理以及对能效有高要求的工作负载。\n\n---\n\n## 你可以从这篇文章学到什么\n\n对于一位有几年经验的后端/系统设计工程师来说，这篇文章不仅介绍了TPU这一前沿AI硬件，更重要的是，它提供了深刻的系统设计思想和权衡策略，这些都可以应用于日常的系统设计工作：\n\n1.  **领域特定架构的重要性（Domain-Specific Architecture）**：文章强调了通用计算（CPU）在面对特定高强度工作负载时的局限性，并展示了如何通过构建专用硬件（TPU）实现数量级的性能和能效提升。这教会我们，在设计高性能系统时，深入理解核心工作负载的特性，并为其定制化架构，是突破性能瓶颈的关键。例如，对于需要高速数据处理的日志分析系统，可以考虑使用流式处理引擎而非通用数据库；对于大规模搜索系统，可以设计专门的索引结构和查询引擎。\n2.  **数据局部性与内存访问优化**：TPU的脉动阵列设计通过“数据只读一次，多遍使用”以及“数据在相邻计算单元间移动”的原则，极大地减少了内存访问的开销。这与系统设计中“缓存”、“数据预取”、“内存池”等优化思想异曲同工。在设计分布式系统时，减少网络I/O（分布式系统的“内存访问”）和数据传输是至关重要的。例如，将计算尽可能推向数据所在的位置（data locality），或者通过批处理（batching）减少往返次数，都是受此启发的设计模式。\n3.  **计算与通信的权衡**：TPU通过专用互连（Inter-Chip Interconnect，光学电路交换机）来最小化芯片间的通信延迟，以支持大规模分布式训练。这在分布式系统设计中也是核心问题。工程师需要权衡数据同步、一致性和性能，选择合适的通信协议（RPC、消息队列）、拓扑结构和数据分片策略，以减少网络开销和延迟。\n4.  **精度与性能的权衡**：TPU在AI领域通过量化和BFloat16等低精度计算取得了显著优势。这提醒我们，并非所有场景都需要最高精度。在系统设计中，理解数据的实际需求和容错范围，可以进行适当的“损失容忍”（lossy tolerance）优化。例如，对于某些监控数据或统计分析，可以使用近似算法或较低精度的数据表示来换取存储、计算或传输效率。\n5.  **模块化与专用组件**：TPU设计中的MXU、VPU、Unified Buffer等专用组件各司其职，协同工作。这体现了系统设计中的模块化原则和专业化分工。将复杂系统拆分为职责单一、高效协作的模块，每个模块针对特定任务进行优化，可以提高系统的整体效率、可维护性和可扩展性。例如，在微服务架构中，每个服务都应聚焦于一个业务领域，并可针对其特定负载进行优化。\n6.  **迭代演进与技术路线图**：TPU从v1到v7的演进历程展示了硬件（和软件）系统如何根据不断变化的需求（推理到训练，模型规模增大）进行迭代和创新。作为系统设计工程师，我们也应该规划系统的演进路径，预见未来的瓶求和挑战，并不断评估新技术和架构调整的可能性。",
    "url": "https://blog.bytebytego.com/p/how-googles-tensor-processing-unit"
  },
  {
    "id": "2026-01-05-ep196-cloud-load-balancer-cheat-sheet",
    "title": "EP196: Cloud Load Balancer Cheat Sheet",
    "date": "2026-01-05",
    "preview": "EP196: 云负载均衡器速查表  本周的系统设计回顾：  ## 云负载均衡器速查表  高效的负载均衡对于优化云中应用程序的性能和可用性至关重要。  然而，鉴于各种类型和配置选项，管理负载均衡器可能会让人不知所措。  在当今的多云环境中，掌握负载均衡对于确保无缝的用户体验和最大化...",
    "content": "EP196: 云负载均衡器速查表\n\n本周的系统设计回顾：\n\n## 云负载均衡器速查表\n\n高效的负载均衡对于优化云中应用程序的性能和可用性至关重要。\n\n然而，鉴于各种类型和配置选项，管理负载均衡器可能会让人不知所措。\n\n在当今的多云环境中，掌握负载均衡对于确保无缝的用户体验和最大化资源利用率至关重要，尤其是在跨多个云提供商编排应用程序时。拥有正确的知识是克服这些挑战并实现一致、可靠的应用程序交付的关键。\n\n在选择合适的负载均衡器类型时，必须考虑应用程序流量模式、可伸缩性要求和安全考量等因素。通过仔细评估您的具体用例，您可以做出明智的决策，从而提高云基础设施的效率和可靠性。\n\n这份云负载均衡器速查表将帮助您简化决策过程，并帮助您为基于云的应用程序实施最有效的负载均衡策略。\n\n## CQRS 工作原理揭秘\n\nCQRS (Command Query Responsibility Segregation，命令查询职责分离) 将写入（Command）操作和读取（Query）操作分开，以实现更好的可伸缩性和可维护性。\n\n其工作原理如下：\n\n客户端发送一个 Command（命令）来更新系统状态。Command Handler（命令处理器）使用 Domain Model（领域模型）验证并执行业务逻辑。\n\n更改被保存到 Write Database（写入数据库）中，也可以保存到 Event Store（事件存储）中。事件被发布以异步更新 Read Model（读取模型）。\n\n投影（projections）存储在 Read Database（读取数据库）中。该数据库与 Write Database 最终一致（eventually consistent）。\n\n在查询端，客户端发送一个 Query（查询）来检索数据。\n\nQuery Handler（查询处理器）从 Read Database 中获取数据，该数据库包含预计算的投影。\n\n结果直接返回给客户端，而无需访问写入模型或写入数据库。\n\n## Docker 工作原理\n\nDocker 的架构围绕三个主要组件构建，它们协同工作以构建、分发和运行容器。\n\n### Docker Client（Docker 客户端）\n\n这是用户与 Docker 交互的接口。它使用 Docker API 向 Docker Daemon（Docker 守护进程）发送命令（例如 `build`、`pull`、`run`、`push`）。\n\n### Docker Host（Docker 主机）\n\n这是 Docker Daemon 运行的地方。它管理镜像（images）、容器（containers）、网络（networks）和卷（volumes），并负责构建和运行应用程序。\n\n### Docker Registry（Docker 注册中心）\n\nDocker 镜像的存储系统。公共注册中心如 Docker Hub 或私有注册中心允许拉取（pulling）和推送（pushing）镜像。\n\n## 你必须知道的 6 种实用的 AWS Lambda 应用程序模式\n\nAWS Lambda 开创了无服务器（serverless）范式，允许开发人员无需预置、管理或扩展服务器即可运行代码。让我们看看几种可以使用 Lambda 实现的实用应用程序模式。\n\n### 按需媒体转换\n\n当用户从 S3 请求的图像格式不可用时，可以使用 AWS Lambda 进行按需转换。\n\n### 单一来源的多数据格式\n\nAWS Lambda 可以与 SNS（Simple Notification Service，简单通知服务）配合，创建一个层，在该层中数据可以按所需格式进行处理，然后再发送到存储层。\n\n### 实时数据处理\n\n创建一个 Kinesis 流（stream）和相应的 Lambda 函数，以处理来自应用程序的不同类型数据（如点击流、日志、位置跟踪或交易）。\n\n### 变更数据捕获 (CDC)\n\nAmazon DynamoDB 可以与 AWS Lambda 集成，以响应 DynamoDB 流中的数据库事件（插入、更新和删除）。\n\n### 无服务器图像处理\n\n使用 AWS Lambda 以无服务器方式处理和识别图像。与 AWS Step Functions 集成以实现更好的工作流管理。\n\n### 自动化存储过程\n\n将 Lambda 作为存储过程调用，以便在对特定数据库表执行某些操作之前/之后触发功能。\n\n## 容器化解析：从构建到运行\n\n“一次构建，随处运行。” 这是容器化的承诺，以下是其实际工作原理：\n\n**构建流程**：一切都始于 Dockerfile，它定义了应用程序的构建方式。当你运行 `docker build` 时，它会创建一个包含以下内容的 Docker Image（Docker 镜像）：\n\n*   你的代码\n*   所需的依赖项\n*   必要的库\n\n这个镜像具有可移植性。你可以在不同环境之间移动它，无论是在本地机器、CI 服务器还是在云中，它都会以相同的方式运行。\n\n**运行时架构**：当你运行这个镜像时，它就变成了一个 Container（容器），一个执行应用程序的隔离环境。多个容器可以在同一个主机上运行，每个容器都有自己的文件系统、进程空间和网络堆栈。\n\n容器引擎（如 Docker, containerd, CRI-O 或 Podman）管理：\n\n*   容器生命周期\n*   网络和隔离\n*   资源分配\n\n所有容器都共享 Host OS kernel（主机操作系统内核），运行在硬件之上。这就是容器化如何实现一致性和效率的方式：像进程一样轻量，但像虚拟机（VM）一样隔离。\n\n---\n\n## 要点总结\n\n*   **云负载均衡器**：在多云环境中优化应用性能和可用性至关重要。选择时需考虑流量模式、可伸缩性和安全性。\n*   **CQRS (命令查询职责分离)**：通过分离读写操作（Command 和 Query）来提高系统的可伸缩性和可维护性，读写数据源可实现最终一致。\n*   **Docker 架构**：由 Docker Client、Docker Host 和 Docker Registry 三大核心组件构成，协同完成容器的构建、分发和运行。\n*   **Docker Client**：用户与 Docker 交互的命令行接口。\n*   **Docker Host**：运行 Docker Daemon 的环境，管理镜像、容器、网络和卷。\n*   **Docker Registry**：用于存储 Docker 镜像的系统。\n*   **AWS Lambda 应用模式**：利用无服务器范式，可实现按需媒体转换、多数据格式处理、实时数据处理、变更数据捕获 (CDC)、无服务器图像处理和自动化存储过程等。\n*   **容器化核心理念**：“一次构建，随处运行”，通过 Dockerfile 构建包含代码、依赖和库的 Docker 镜像。\n*   **容器运行时**：Docker 镜像在运行时成为容器，这是一个独立的执行环境，具有自己的文件系统、进程空间和网络堆栈。\n*   **容器引擎**：如 Docker、containerd、CRI-O 或 Podman，负责管理容器的生命周期、网络隔离和资源分配，所有容器共享主机操作系统内核。\n\n## 你可以从这篇文章学到什么\n\n这篇文章为后端/系统设计工程师提供了多个核心系统设计概念的快速回顾和实用见解，有助于在实际工作中做出更明智的技术决策：\n\n1.  **深入理解负载均衡的决策因素**：文章强调了在多云环境下选择负载均衡器时需考虑流量模式、可伸缩性和安全性。这提示工程师在设计阶段不仅要考虑负载均衡本身，还要根据具体业务场景和未来发展趋势，选择最适合的负载均衡策略，从而确保系统的高性能和高可用性。\n2.  **掌握 CQRS 模式的适用场景与实现**：通过对 CQRS 工作原理的阐述，工程师可以学习如何通过分离读写职责来优化高并发、高写入或复杂查询的系统。理解其 Command/Query Handler、Event Store 和最终一致性（eventual consistency）的概念，有助于在面对传统 CRUD 模式瓶颈时，考虑引入 CQRS 来提升系统的可伸缩性和响应速度。\n3.  **巩固 Docker 与容器化的基础知识**：文章清晰地梳理了 Docker 的三大核心组件（Client, Host, Registry）及其工作流程，并解释了容器化“一次构建，随处运行”的承诺及其运行时架构。这对于需要进行容器化部署、排查容器问题或优化容器性能的工程师来说，是巩固基础、加深理解的宝贵资料。\n4.  **拓展 AWS Lambda 的实战应用思维**：文章列举了 6 种实用的 AWS Lambda 应用模式，如按需媒体转换、实时数据处理、CDC 等。这不仅展示了 Lambda 在无服务器架构中的强大能力，也为工程师在设计微服务、事件驱动架构或优化云成本时，提供了具体的灵感和可行的方案。\n5.  **系统性地理解核心组件**：文章将负载均衡、CQRS、Docker 和 Lambda 等独立但关键的系统设计组件串联起来，提供了一个全面的视角。这有助于工程师在构建复杂系统时，能够综合运用这些技术，而不是孤立地看待它们，从而设计出更健壮、更高效、更易于维护的分布式系统。",
    "url": "https://blog.bytebytego.com/p/ep196-cloud-load-balancer-cheat-sheet"
  },
  {
    "id": "2026-01-04-ep196-cloud-load-balancer-cheat-sheet",
    "title": "EP196: Cloud Load Balancer Cheat Sheet",
    "date": "2026-01-04",
    "preview": "# EP196: 云负载均衡器备忘录  本周的系统设计回顾： *   云负载均衡器备忘录 *   CQRS 工作原理 *   Docker 工作原理 *   你必须了解的 6 种实用的 AWS Lambda 应用模式 *   容器化解释：从构建到运行时  ## 云负载均衡器备忘录...",
    "content": "# EP196: 云负载均衡器备忘录\n\n本周的系统设计回顾：\n*   云负载均衡器备忘录\n*   CQRS 工作原理\n*   Docker 工作原理\n*   你必须了解的 6 种实用的 AWS Lambda 应用模式\n*   容器化解释：从构建到运行时\n\n## 云负载均衡器备忘录\n\n高效的负载均衡对于优化云中应用程序的性能和可用性至关重要。\n\n然而，鉴于各种类型和配置选项，管理负载均衡器可能会让人不知所措。\n\n在当今的多云环境中，掌握负载均衡对于确保无缝的用户体验和最大化资源利用率至关重要，尤其是在跨多个云提供商编排应用程序时。拥有正确的知识是克服这些挑战并实现一致、可靠的应用程序交付的关键。\n\n在选择合适的负载均衡器类型时，必须考虑应用流量模式、可伸缩性要求和安全考量等因素。通过仔细评估您的具体用例，您可以做出明智的决策，从而提高云基础设施的效率和可靠性。\n\n这份云负载均衡器备忘录将帮助您简化决策过程，并帮助您为基于云的应用程序实施最有效的负载均衡策略。\n\n轮到你了：您认为在为应用程序选择合适的负载均衡器类型时，哪些因素最为关键？\n\n## CQRS 工作原理\n\nCQRS (Command Query Responsibility Segregation，命令查询职责分离) 将写入（Command）和读取（Query）操作分开，以提高可伸缩性和可维护性。\n\n其工作原理如下：\n\n客户端发送一个命令来更新系统状态。Command Handler（命令处理器）使用 Domain Model（领域模型）验证并执行逻辑。\n更改保存到 Write Database（写入数据库）中，也可以保存到 Event Store（事件存储）中。事件被异步发出以更新 Read Model（读取模型）。\n投影（projections）存储在 Read Database 中。该数据库与 Write Database 最终一致。\n\n在查询端，客户端发送一个查询来检索数据。\nQuery Handler（查询处理器）从 Read Database 中获取数据，该数据库包含预计算的投影。\n结果返回给客户端，而不会触及写入模型或写入数据库。\n\n轮到你了：您还会补充哪些内容来帮助理解 CQRS？\n\n## Docker 工作原理\n\nDocker 的架构围绕三个主要组件构建，它们协同工作来构建、分发和运行容器。\n\n**Docker Client（Docker 客户端）**\n这是用户与 Docker 交互的接口。它使用 Docker API 向 Docker Daemon（Docker 守护进程）发送命令（如 build、pull、run、push）。\n\n**Docker Host（Docker 主机）**\n这是 Docker Daemon 运行的地方。它管理镜像、容器、网络和卷，并负责构建和运行应用程序。\n\n**Docker Registry（Docker 注册表）**\nDocker 镜像的存储系统。公共注册表如 Docker Hub 或私有注册表允许拉取（pull）和推送（push）镜像。\n\n轮到你了：您在项目中使用 Docker 吗？\n\n## 你必须了解的 6 种实用的 AWS Lambda 应用模式\n\nAWS Lambda 开创了无服务器（serverless）范式，允许开发人员在无需预置、管理或扩展服务器的情况下运行代码。让我们看看使用 Lambda 可以实现的一些实用应用模式。\n\n### 按需媒体转换\n每当用户从 S3 请求的图像格式不可用时，可以使用 AWS Lambda 进行按需转换。\n\n### 单一来源的多种数据格式\nAWS Lambda 可以与 SNS 配合，创建一个层，在该层中数据可以按所需格式进行处理，然后再发送到存储层。\n\n### 实时数据处理\n创建一个 Kinesis 流和相应的 Lambda 函数，以处理来自应用程序的不同类型数据（如点击流、日志、位置跟踪或事务）。\n\n### 变更数据捕获\nAmazon DynamoDB 可以与 AWS Lambda 集成，以响应 DynamoDB 流中的数据库事件（插入、更新和删除）。\n\n### 无服务器图像处理\n使用 AWS Lambda 以无服务器方式处理和识别图像。与 AWS Step Functions 集成以实现更好的工作流管理。\n\n### 自动化存储过程\n将 Lambda 作为存储过程调用，以在对特定数据库表执行某些操作之前/之后触发功能。\n\n轮到你了：您在项目中使用过 AWS Lambda 吗？\n\n## 容器化解释：从构建到运行时\n\n“一次构建，随处运行。”这是容器化的承诺，以下是其具体工作原理：\n\n### 构建流程\n一切都始于 Dockerfile，它定义了应用程序的构建方式。当你运行 `docker build` 时，它会创建一个包含以下内容的 Docker Image（Docker 镜像）：\n*   你的代码\n*   所需的依赖项\n*   必要的库\n这个镜像具有可移植性。你可以在不同环境之间移动它，并且无论是在本地机器、CI 服务器还是云中，它的行为都将保持一致。\n\n### 运行时架构\n当你运行该镜像时，它就变成了一个 Container（容器），一个执行应用程序的隔离环境。同一个主机上可以运行多个容器，每个容器都有自己的文件系统、进程空间和网络栈。\n容器引擎（如 Docker, containerd, CRI-O 或 Podman）管理：\n*   容器生命周期\n*   网络和隔离\n*   资源分配\n所有容器共享 Host OS kernel（宿主操作系统内核），并位于硬件之上。这就是容器化如何实现一致性和效率的：它像进程一样轻量，但像虚拟机（VM）一样隔离。\n\n轮到你了：部署应用程序时，您更喜欢 Docker、containerd 还是 Podman？为什么？\n\n---\n\n## 要点总结\n\n1.  **云负载均衡器选择**：高效负载均衡是云应用性能和可用性的关键，选择时需考量应用流量模式、伸缩性与安全性。\n2.  **CQRS 核心思想**：CQRS（命令查询职责分离）通过将写入（Command）和读取（Query）操作分离，显著提升系统的可伸缩性和可维护性。\n3.  **CQRS 工作流程**：写入操作更新 Write Database 和可选的 Event Store，并异步更新 Read Model；查询操作则直接从包含预计算投影的 Read Database 获取数据，不影响写入模型。\n4.  **Docker 架构**：Docker 平台由 Docker Client、Docker Host 和 Docker Registry 三大核心组件构成，协同完成容器的构建、分发与运行。\n5.  **Docker 组件职责**：Client 作为用户接口，Host 运行 Daemon 管理容器资源，Registry 负责镜像存储与共享。\n6.  **AWS Lambda 应用模式**：AWS Lambda 开创无服务器范式，提供多种实用模式，如按需媒体转换、多种数据格式处理、实时数据处理、变更数据捕获、无服务器图像处理和自动化存储过程。\n7.  **容器化承诺**：“一次构建，随处运行”是容器化的核心优势，通过 Dockerfile 构建出包含代码、依赖和库的可移植 Docker Image。\n8.  **容器运行时**：Docker Image 运行时转变为 Container，一个独立的隔离环境，共享宿主操作系统的内核但拥有独立的文件系统、进程空间和网络栈。\n9.  **容器引擎作用**：容器引擎（如 Docker, containerd, Podman）负责管理容器的生命周期、网络配置、隔离机制和资源分配。\n10. **容器化优势**：容器化兼具进程的轻量与虚拟机的隔离性，从而实现应用部署的一致性和运行效率。\n\n## 你可以从这篇文章学到什么\n\n对于一位拥有数年经验的后端/系统设计工程师而言，这篇文章提供了一个宝贵的系统设计概念速查与回顾。其价值体现在以下几个方面：\n\n1.  **巩固基础知识**：即使是经验丰富的工程师，也需要定期回顾负载均衡、CQRS、Docker 架构和容器化等核心概念。这篇文章可以帮助工程师梳理和巩固这些基础知识，确保对系统基石的理解牢固且全面。\n\n2.  **拓宽设计思路**：文章涵盖了多个技术领域，提醒工程师在系统设计中可用的丰富工具和模式。例如，AWS Lambda 的具体应用模式，为工程师提供了无服务器函数在基础事件触发之外的更多实际用例，有助于在适当场景下选择更优的解决方案。\n\n3.  **启发式自我评估**：文章中散布的“轮到你了”问题，实则是一种隐性的自我评估机制。工程师在思考这些问题时，可能会发现自己在某些方面理解不够深入，或没有充分考虑特定权衡（例如，选择负载均衡器的关键因素、CQRS 实现的细微之处或不同容器运行时的偏好）。这有助于工程师查漏补缺，促使他们进行更深层次的思考和学习。\n\n4.  **实际应用指导**：\n    *   **负载均衡**：文中对流量模式、可伸缩性和安全性的考虑，直接应用于微服务设计或现有服务扩容。它鼓励工程师重新审视当前的负载均衡策略（如 L4 vs L7、全局 vs 区域负载均衡）。\n    *   **CQRS**：对于高读写负载或复杂领域模型的系统，CQRS 是一种强大的模式。文章的解释有助于评估 CQRS 是否适合系统的特定部分，以提高性能和可维护性，指导架构师对最终一致性和事件溯源做出决策。\n    *   **Docker/容器化**：理解 Docker 的组件和构建/运行流程对于设计 CI/CD 流水线、高效部署应用程序以及故障排除容器化环境至关重要。Docker、containerd 和 Podman 之间的区别与优化运行时环境以及理解 Kubernetes 等编排平台密切相关。\n    *   **AWS Lambda 模式**：这些模式是实现无服务器解决方案的直接“食谱”。工程师可以从中汲取灵感，设计事件驱动架构，用于媒体处理、数据转换、实时分析或数据库变更流处理，从而可能降低特定工作负载的运营开销并提高可伸缩性。\n\n总而言之，这篇文章虽然以“备忘录”或“回顾”的形式呈现，却为经验丰富的工程师提供了可操作的见解，帮助他们验证理解、探索新模式并在日常工作中做出更明智的架构选择。",
    "url": "https://blog.bytebytego.com/p/ep196-cloud-load-balancer-cheat-sheet"
  },
  {
    "id": "2026-01-03-message-brokers-101-storage-replication-and-delivery-guarantees",
    "title": "Message Brokers 101: Storage, Replication, and Delivery Guarantees",
    "date": "2026-01-03",
    "preview": "# 消息代理 101: 存储、复制和交付保证  消息代理（Message Broker）是一种中间件系统，它通过消息促进应用程序和服务之间的异步通信。  其核心作用在于，消息代理将信息的生产者（producer）与消费者（consumer）解耦，使它们能够独立运行，而无需直接了解...",
    "content": "# 消息代理 101: 存储、复制和交付保证\n\n消息代理（Message Broker）是一种中间件系统，它通过消息促进应用程序和服务之间的异步通信。\n\n其核心作用在于，消息代理将信息的生产者（producer）与消费者（consumer）解耦，使它们能够独立运行，而无需直接了解彼此。这种解耦是现代分布式架构的基础，在这种架构中，服务通过消息代理而不是直接相互通信，从而能够独立演进，避免紧密耦合。\n\n为了在实践中理解这一点，考虑一个订单处理服务，它在消息代理上放置一条“订单已下达”（Order Placed）消息。库存、账单和发货等下游服务将在准备好处理时从消息代理获取该消息，而不是由订单服务同步调用它们。这种方法消除了订单服务需要了解或等待这些下游系统的必要性。\n\n消息代理不仅仅是数据传输的管道。它们是专门用于流处理（stream processing）和任务分发（task distribution）等功能的复杂分布式数据库。消息代理的核心价值主张在于它能够在不同系统之间引入一个时间缓冲区（temporal buffer）。通过允许生产者在不等待消费者处理的情况下发送消息，消息代理促进了时间解耦（temporal decoupling）。这确保了入口点（ingress point）的流量激增不会立即压垮下游服务。\n\n在本文中，我们将详细探讨消息代理的工作原理，并探索它们在分布式系统设计中启用的各种模式。\n\n## 要点总结\n\n*   消息代理是实现应用程序和服务之间异步通信的中间件。\n*   其核心价值在于解耦生产者和消费者，使它们独立运作，无需直接了解彼此。\n*   解耦是现代分布式架构的关键，支持服务独立演进和松耦合。\n*   通过将“订单已下达”等消息发布到代理，下游服务（如库存、账单、发货）可在准备就绪时处理，避免订单服务同步等待。\n*   消息代理不仅是数据管道，更是专门用于流处理和任务分发的分布式数据库。\n*   它们引入了时间缓冲区，实现了时间解耦，生产者无需等待消费者即可发送消息。\n*   这种机制有效防止了入口流量高峰对下游服务的瞬时冲击，提高了系统韧性。\n*   文章将深入探讨消息代理的工作原理及其在分布式系统设计中的应用模式。\n\n## 你可以从这篇文章学到什么\n\n对于一个拥有几年经验的后端/系统设计工程师来说，这篇文章提供了一个对消息代理核心价值的精炼介绍，能够帮助你巩固和深化对分布式系统设计中异步通信模式的理解。\n\n1.  **理解解耦的深层意义**：文章强调了消息代理如何通过“时间解耦”（temporal decoupling）实现生产者和消费者的独立运行。这不仅仅是技术实现上的分离，更是业务流程上并行和容错的基础。在设计微服务或大型分布式系统时，你需要考虑哪些组件需要强一致性，哪些可以通过消息代理实现最终一致性，从而提高系统的整体吞吐量和可用性。\n2.  **消息代理的“数据库”属性**：将消息代理视为“专用于流处理和任务分发的分布式数据库”，这个视角非常重要。它提醒我们，消息代理不仅仅是传输数据的管道，更负责消息的持久化、复制和保证（如交付保证）。这对于你选择合适的消息队列（例如 Kafka、RabbitMQ）以及设计消息处理的幂等性、顺序性等高级特性时，具有指导意义。\n3.  **流量削峰与系统韧性**：文章明确指出消息代理能够作为“时间缓冲区”来防止流量激增压垮下游服务。这在处理高并发、突发流量或不同服务处理能力不匹配的场景中至关重要。你可以在实际项目中应用这一理念，通过引入消息队列来缓冲请求，保护核心服务，避免雪崩效应。\n4.  **架构模式的启发**：虽然文章内容是入门级的，但它为理解后续更复杂的分布式系统模式（如事件驱动架构、Saga 模式、CQRS 等）奠定了基础。理解消息代理如何支持异步通信，将帮助你更好地设计可扩展、高可用的系统，并应对各种分布式事务和数据一致性挑战。\n\n总之，这篇文章为你提供了一个理解消息代理在现代分布式架构中不可或缺作用的起点，并指明了其在提高系统解耦性、韧性和可扩展性方面的关键价值。",
    "url": "https://blog.bytebytego.com/p/message-brokers-101-storage-replication"
  },
  {
    "id": "2026-01-02-message-brokers-101-storage-replication-and-delivery-guarantees",
    "title": "Message Brokers 101: Storage, Replication, and Delivery Guarantees",
    "date": "2026-01-02",
    "preview": "# 消息队列 101：存储、复制与投递保证  消息队列（Message Broker）是一种中间件系统，它通过消息促进应用程序和服务之间的异步通信。  其核心在于，消息队列将信息生产者（producers）与消费者（consumers）解耦，使它们能够独立运行，无需直接了解彼此。...",
    "content": "# 消息队列 101：存储、复制与投递保证\n\n消息队列（Message Broker）是一种中间件系统，它通过消息促进应用程序和服务之间的异步通信。\n\n其核心在于，消息队列将信息生产者（producers）与消费者（consumers）解耦，使它们能够独立运行，无需直接了解彼此。这种解耦是现代分布式架构的基础，其中服务通过消息队列而非直接相互通信，从而使它们能够独立演进，避免紧密耦合。\n\n为了在实践中理解这一点，考虑一个订单处理服务，它将一条“订单已下达”（Order Placed）消息放置在消息队列中。库存、计费和发货等下游服务将在准备好处理时从消息队列中获取该消息，而不是由订单服务同步调用每个服务。这种方法消除了订单服务需要了解或等待这些下游系统的需求。\n\n消息队列不仅仅是数据传输的管道。它们是复杂的分布式数据库，专门用于流处理（stream processing）和任务分发（task distribution）等功能。消息队列的核心价值主张在于其能够在不同系统之间引入一个时间缓冲区（temporal buffer）。通过允许生产者发送消息而无需等待消费者处理，消息队列促进了时间解耦（temporal decoupling）。这确保了入口点（ingress point）的流量激增不会立即压垮下游服务。\n\n在本文中，我们将详细探讨消息队列的工作原理，并探究它们在分布式系统设计中启用的各种模式。\n\n## 要点总结\n\n*   消息队列是一种中间件系统，用于实现应用程序和服务之间的异步通信。\n*   其核心功能是将信息生产者与消费者解耦，允许它们独立运行，无需直接了解彼此。\n*   这种解耦是现代分布式架构的基石，能够促进服务的独立演进并避免紧密耦合。\n*   通过消息队列，上游服务（如订单处理）无需同步等待下游服务（如库存、计费、发货），从而提高系统响应速度和弹性。\n*   消息队列不仅仅是数据传输管道，更是专为流处理和任务分发等功能设计的复杂分布式数据库。\n*   消息队列的关键价值在于引入一个时间缓冲区，实现系统间的时间解耦。\n*   时间解耦能够确保在入口点出现流量激增时，下游服务不会立即被压垮，从而提高系统的韧性。\n\n## 你可以从这篇文章学到什么\n\n对于拥有数年经验的后端或系统设计工程师来说，这篇文章提供了一个深入理解消息队列核心价值和工作原理的机会，不仅仅停留在其作为“异步通信工具”的表面认知上。\n\n你可以从中学到：\n\n1.  **深化对解耦的理解**：文章强调了消息队列在**空间解耦**（服务互不感知）和**时间解耦**（生产者无需等待消费者）方面的关键作用。这对于设计高度可伸缩、容错和易于维护的微服务架构至关重要。\n2.  **消息队列的本质定位**：将消息队列视为“复杂的分布式数据库，专门用于流处理和任务分发”，这改变了其简单的“管道”形象。这种视角提示我们在设计系统时，需要像对待数据库一样考虑消息队列的**存储、持久性、复制和数据一致性**，尤其在处理关键业务数据时。\n3.  **流量削峰填谷的能力**：文中提到的“时间缓冲区”和“避免压垮下游服务”直指消息队列在应对突发流量方面的核心价值。工程师可以学习如何利用这一特性，设计更具韧性和弹性的系统，有效管理入口流量，防止雪崩效应。\n4.  **实际应用场景的启发**：通过订单处理服务的例子，具体展示了消息队列在复杂业务流程中的应用，提示工程师在设计事件驱动型架构时，可以如何将业务操作分解为独立的消息事件，并由不同的服务异步处理。\n5.  **为深入研究打下基础**：虽然文章是“101”系列，但其标题中的“存储、复制与投递保证”以及文中对“分布式数据库”的提及，都为工程师指明了进一步深入学习消息队列的关键技术点，例如消息的持久化机制、集群复制策略、死信队列（DLQ）、幂等性处理以及各种投递语义（至少一次、至多一次、恰好一次）等，这些都是在生产环境中设计高可靠消息系统时必须考虑的问题。",
    "url": "https://blog.bytebytego.com/p/message-brokers-101-storage-replication"
  },
  {
    "id": "2026-01-01-openai-clip-the-model-that-learnt-zero-shot-image-recognition-using-text",
    "title": "OpenAI CLIP: The Model That Learnt Zero-Shot Image Recognition Using Text",
    "date": "2026-01-01",
    "preview": "# OpenAI CLIP：通过文本学习零样本图像识别的模型  想象一下，教计算机识别物体，不是通过向它展示数百万张带标签的照片，而是让它浏览互联网，并从人们自然描述图像的方式中学习。这正是 OpenAI 的 CLIP 所做的，它代表了我们教机器理解视觉内容方式的根本性转变。  ...",
    "content": "# OpenAI CLIP：通过文本学习零样本图像识别的模型\n\n想象一下，教计算机识别物体，不是通过向它展示数百万张带标签的照片，而是让它浏览互联网，并从人们自然描述图像的方式中学习。这正是 OpenAI 的 CLIP 所做的，它代表了我们教机器理解视觉内容方式的根本性转变。\n\nCLIP (Contrastive Language-Image Pre-training) 是一个连接视觉和语言的神经网络。它于 2021 年 1 月发布，能够将图像分类到任何你想要的类别中，而无需专门为该任务进行训练。只需用简单的英语告诉它你在寻找什么，它就能识别出来。这种“零样本”（zero-shot）能力使 CLIP 不同于几乎所有之前的计算机视觉系统。\n\n在本文中，我们将探讨 CLIP 的工作原理以及它试图解决的问题。\n\n## CLIP 解决的问题\n\n传统的计算机视觉遵循僵化的模式。如果你想让一个模型区分猫和狗，你需要数千张带标签的照片。对于不同的汽车型号，你需要另一个昂贵的数据集。举例来说，ImageNet 是最著名的图像数据集之一，它需要超过 25,000 名工人来标注 1400 万张图像。\n\n这种方法产生了三个主要问题：\n\n首先，数据集的构建成本高昂且耗时。\n\n其次，模型成为狭隘的专业领域专家。一个 ImageNet 模型可以识别 1,000 个类别，但要适应新任务需要收集更多数据并重新训练。\n\n第三，模型可以通过优化特定基准来“作弊”。\n\n例如，一个在 ImageNet 上达到 76% 准确率的模型，在相同物体的草图上可能会下降到 37%，或者在略微修改的图像上骤降到 2.7%。模型学会了 ImageNet 的“怪癖”，而不是真正理解视觉概念。\n\nCLIP 的方法则截然不同。它不是在精心标注的数据集上进行训练，而是从互联网上收集的 4 亿个图像-文本对中学习。这些对在网上随处可见：带有描述的 Instagram 照片、带有图像的新闻文章、带有描述的产品列表以及带有图片的维基百科条目。人们自然会编写描述、解释或评论图像的文本，从而产生了巨大的训练数据源。\n\n然而，CLIP 并不试图预测特定的类别标签。相反，它学习将图像与其对应的文本描述进行匹配。在训练期间，CLIP 会看到一张图像和一大批文本片段（一次 32,768 个）。它的任务是确定哪个文本片段最能匹配该图像。\n\n可以把它想象成一个大型匹配游戏。例如，我们向系统展示一张金毛犬在公园玩耍的照片。在 32,768 个文本选项中，只有一个是正确的：可能是“一只金毛犬在公园里玩接球”。其他 32,767 个选项可能包括“一只黑猫在睡觉”、“日落时的山景”、“一个人在吃披萨”以及数千种其他描述。为了在数百万个此类示例中始终选择正确的匹配，CLIP 必须学习物体、场景、动作和属性的外观以及它们如何与语言对应。\n\n通过一遍又一遍地使用极其多样化的互联网数据解决这个匹配任务，CLIP 形成了对视觉概念及其语言描述的深刻理解。例如，它可能学会了毛茸茸、四条腿、摇着尾巴的动物对应着“狗”和“小狗”等词汇。它可能学会了水面上橙色和粉红色的天空与“日落”和“海滩”相关。换句话说，它建立了一个连接视觉和语言世界的丰富心智模型。\n\n## 技术基础\n\n在底层，CLIP 使用两个独立的神经网络协同工作：一个图像编码器（image encoder）和一个文本编码器（text encoder）。\n\n图像编码器接收原始像素并将其转换为数值向量（称为嵌入，embedding）。文本编码器接收单词和句子，也输出一个向量。关键的见解是，两个编码器都在相同的维度空间中输出向量，这使得它们可以直接比较。\n\n最初，这些编码器可能会产生完全随机、无意义的向量。例如，一张狗的图像可能变为 [0.2, -0.7, 0.3, ...]，而文本“狗”变为 [-0.5, 0.1, 0.9, ...]。这些数字之间没有任何关系。但这就是训练发挥魔力的地方。\n\n训练过程使用所谓的对比损失函数（contrastive loss function）。这只是一种衡量模型当前错误程度的数学方法。对于正确的图像-文本对（例如狗的图像与“狗在玩接球”），损失函数表示这些嵌入应该非常相似。对于不正确的对（例如狗的图像与“猫在睡觉”），它表示它们应该非常不同。损失函数产生一个数字，代表一个批次中所有图像和文本的总误差。\n\n如下图所示：\n\nSource: OpenAI Research Blog\n\n接下来是反向传播（backpropagation），这是神经网络中的基本学习机制。它精确计算每个编码器中的每个权重应该如何改变以减少这个误差。权重会轻微更新，然后这个过程会用不同的数据批次重复数百万次。逐渐地，两个编码器都学会为匹配的概念生成相似的向量。例如，狗的图像开始生成接近文本编码器放置“狗”一词的向量。\n\n换句话说，通过在数百万个不同示例中持续承受匹配正确对和分离不正确对的压力，编码器进化出能够“说”相同语言的能力。\n\n## 零样本分类实战\n\n一旦 CLIP 训练完成，其零样本能力便显而易见。假设我们要将图像分类为包含狗或猫。我们不需要重新训练 CLIP 或向其展示带标签的示例。\n\n相反，我们可以简单地获取图像，通过图像编码器获取其嵌入（embedding）。接下来，我们可以将文本“一只狗的照片”通过文本编码器获取另一个嵌入。然后，我们可以将文本“一只猫的照片”获取第三个嵌入。比较哪个文本嵌入与图像嵌入更接近，这就是答案。\n\n如下图所示：\n\nSource: OpenAI Research Blog\n\nCLIP 本质上是在问：“根据从互联网上学到的一切，这张图像更可能与描述狗的文本一起出现，还是与描述猫的文本一起出现？”\n\n由于它从如此多样化的数据中学习，这种方法适用于您可以用文字描述的几乎任何分类任务。\n\n想对食物类型进行分类吗？使用“一张披萨的照片”、“一张寿司的照片”、“一张玉米饼的照片”作为您的类别。需要分析卫星图像吗？尝试“一张森林的卫星照片”、“一张城市的卫星照片”、“一张农田的卫星照片”。处理医学图像？您可以使用“一张显示肺炎的 X 光片”与“一张健康肺部的 X 光片”。您只需更改文本描述。无需重新训练。\n\n这种灵活性是变革性的。传统模型需要针对每个新任务提供大量的带标签数据集。CLIP 可以立即处理新任务，其唯一限制是您用自然语言描述类别的能力。\n\n## 使 CLIP 成为可能的设计选择\n\nCLIP 的成功不仅仅在于核心思想。OpenAI 做出了两个关键的技术决策，使训练在计算上变得可行。\n\n首先，他们选择了对比学习（contrastive learning），而不是更显而易见的训练模型生成图像描述的方法。早期的实验尝试教系统看图像并逐字生成完整的文本描述，类似于语言模型生成文本的方式。虽然直观，但这种方法被证明速度极慢且计算成本高昂。生成整个句子所需的计算量远多于简单地学习将图像与文本进行匹配。对比学习在实现良好零样本性能方面，效率是其 4 到 10 倍。\n\n其次，他们对图像编码器采用了 Vision Transformers（视觉 Transformer）。Transformers 是 GPT 和 BERT 背后的架构，已经彻底改变了自然语言处理。将其应用于图像（将图像块视为句子中的单词）相比传统卷积神经网络（如 ResNet）又提供了 3 倍的计算效率提升。\n\nSource: OpenAI Research Blog\n\n这些选择的结合意味着 CLIP 可以在 256 个 GPU 上训练两周，这与当时其他大规模视觉模型所需的时间相似，而不是需要天文数字般的计算量。\n\n## 结论\n\nOpenAI 在 30 多个不同的数据集上测试了 CLIP，涵盖了各种任务：细粒度分类、光学字符识别（OCR）、动作识别、地理定位和卫星图像分析。\n\n结果验证了 CLIP 的方法。虽然在标准 ImageNet 上与 ResNet-50 的 76.2% 准确率持平，但 CLIP 在 26 个迁移学习基准测试中的 20 个上优于现有最好的公开 ImageNet 模型。更重要的是，在传统模型崩溃的压力测试中，CLIP 保持了强大的性能。在 ImageNet Sketch 上，CLIP 达到了 60.2% 的准确率，而 ResNet 只有 25.2%。在对抗性示例上，CLIP 得分为 77.1%，而 ResNet 为 2.7%。\n\nSource: OpenAI Research Blog\n\n然而，该模型在某些方面仍然存在不足，例如：\n\n*   需要精确空间推理或计数的任务。它在非常细微的区分上也有困难，例如区分相似的汽车型号或飞机变体，这些地方微妙的细节很重要。\n*   在 MNIST 数据集（在计算机视觉领域被认为是微不足道的任务）上的手写数字测试中，CLIP 仅达到 88% 的准确率，远低于人类 99.75% 的表现。\n*   CLIP 对文本提示的措辞方式很敏感。有时需要反复试验（“提示工程”，prompt engineering）才能找到效果良好的措辞。\n*   CLIP 继承了其互联网训练数据中的偏差。我们措辞类别的方式可能会以有问题的​​方式显著影响模型的行为。\n\n然而，尽管存在局限性，CLIP 证明了驱动近期自然语言处理突破（从大量互联网文本中学习）的方法可以迁移到计算机视觉领域。正如 GPT 模型通过训练互联网文本学习执行各种语言任务一样，CLIP 通过训练互联网图像-文本对学习执行各种视觉任务。\n\n自发布以来，CLIP 已成为人工智能行业的基础设施。它完全开源，促进了广泛的采用。像 Stable Diffusion 和 DALL-E 这样的现代文本到图像系统使用 CLIP 类的模型来理解文本提示。公司将其用于图像搜索、内容审核和推荐。\n\n## 参考文献\n\n*   CLIP: Connecting Text and Images\n*   What is ImageNet\n\n---\n\n## 要点总结\n\n*   **零样本图像识别**：CLIP 通过从互联网上学习海量图像-文本对，实现了无需特定训练即可进行图像分类的“零样本”能力。\n*   **解决传统模型局限**：它克服了传统计算机视觉模型对昂贵、耗时数据集的依赖、模型专业性狭隘以及模型可能“作弊”优化基准的问题。\n*   **对比学习机制**：CLIP 不预测具体的类别标签，而是学习将图像与其对应的文本描述进行匹配，其核心是对比学习（contrastive learning），通过使匹配对的嵌入相似、不匹配对的嵌入相异来训练模型。\n*   **双编码器架构**：模型包含独立的图像编码器和文本编码器，它们将输入转换为相同维度空间的向量（embeddings），从而实现直接比较。\n*   **Transformer 应用**：图像编码器采用了 Vision Transformer 架构，相较于传统的卷积神经网络，进一步提升了计算效率。\n*   **训练效率提升**：对比学习和 Vision Transformer 的结合，使得 CLIP 可以在相对可接受的计算资源下进行大规模训练。\n*   **广泛适用性**：经过训练的 CLIP 模型能够灵活应用于各种分类任务，只需通过自然语言描述类别，无需重新训练。\n*   **优异的泛化能力**：CLIP 在 ImageNet Sketch 和对抗性示例等压力测试中表现出比传统模型更强的泛化能力和鲁棒性。\n*   **当前局限性**：模型在精确空间推理、细粒度区分、对提示（prompt）措辞的敏感性以及继承训练数据的偏见方面仍有待改进。\n*   **AI 基础设施**：CLIP 已成为 AI 领域的基础设施，广泛应用于文本到图像生成、图像搜索、内容审核和推荐等场景。\n\n## 你可以从这篇文章学到什么\n\n对于一个有几年经验的后端/系统设计工程师来说，这篇文章不仅介绍了 OpenAI CLIP 这一革命性的 AI 模型，更重要的是，它揭示了几个重要的系统设计和机器学习工程思想，可以启发你在实际工作中：\n\n1.  **大规模数据利用的范式转变**：CLIP 的成功在于它从“噪声”中学习，即从互联网上非结构化的海量图像-文本对中提炼知识。这与传统机器学习依赖于精心标注的干净数据集形成鲜明对比。这启发我们，在设计数据密集型系统时，可以考虑如何利用更大规模、更自然的“弱监督”数据源，而不是过度依赖高成本的人工标注。这对于构建高扩展性、低成本的数据管道至关重要。\n2.  **多模态融合设计**：CLIP 通过图像编码器和文本编码器将视觉和语言映射到同一个嵌入空间。这种多模态（multi-modal）融合的设计思想在现代系统中越来越常见。作为后端工程师，当面对需要处理多种数据类型（如文本、图像、视频、传感器数据）的系统时，可以考虑设计统一的嵌入（embedding）层，从而实现不同模态数据之间的关联、检索和推理。这对于推荐系统、搜索服务、内容理解等领域都有很高的应用价值。\n3.  **对比学习与表征学习**：对比学习是 CLIP 的核心训练范式，它通过“区分”正确与错误配对来学习高质量的特征表示。这种“无监督”或“自监督”的表征学习方法在数据标注成本高昂的场景下非常有用。在设计数据平台或特征工程管道时，可以思考如何利用这种方法，从大量未标注数据中学习出有意义的特征，减少对昂贵标签数据的依赖，从而为下游任务提供更强大的输入。\n4.  **模型架构的选择与效率**：文章提到 CLIP 成功得益于选择了对比学习而非序列生成，并采用了 Vision Transformer。这强调了在大型模型设计中，架构选择对计算效率和性能的巨大影响。作为系统工程师，在评估和集成 AI 模型时，除了关注模型效果，更要深入理解其底层计算复杂度、资源需求（GPU、内存）以及训练/推理效率。选择合适的模型架构和训练范式，直接决定了系统是否能在生产环境中可行和经济。\n5.  **零样本/少样本能力的重要性**：CLIP 的零样本能力意味着模型可以在没有新任务特定训练数据的情况下，直接处理新任务。这种能力对于快速迭代、面对不断变化的业务需求的系统至关重要。在设计通用 AI 服务平台时，如何构建具备强大泛化能力和零样本学习潜力的模型，将大大降低新功能开发的成本和时间。\n6.  **Prompt Engineering 的概念**：CLIP 对文本提示的敏感性引入了“提示工程”（Prompt Engineering）的概念。这表明即使是强大的基础模型，其性能也可能受到用户输入方式的显著影响。在设计基于大模型的应用时，我们需要考虑如何引导用户提供清晰有效的提示，或者在后端进行提示的优化和标准化，以确保模型的稳定性和准确性。\n\n总的来说，CLIP 不仅是一个图像识别模型，它更是一个关于如何从大规模非结构化数据中学习、如何进行多模态融合、如何平衡效率与性能的系统性思考的典范。理解这些深层设计理念，能够帮助后端和系统工程师在构建更智能、更高效、更具扩展性的 AI 驱动系统时做出更明智的决策。",
    "url": "https://blog.bytebytego.com/p/openai-clip-the-model-that-learnt"
  },
  {
    "id": "2025-12-31-openai-clip-the-model-that-learnt-zero-shot-image-recognition-using-text",
    "title": "OpenAI CLIP: The Model That Learnt Zero-Shot Image Recognition Using Text",
    "date": "2025-12-31",
    "preview": "# OpenAI CLIP：通过文本学习零样本图像识别的模型  想象一下，教计算机识别物体，不是通过向它展示数百万张带标签的照片，而是让它浏览互联网，并从人们自然描述图像的方式中学习。这正是 OpenAI 的 CLIP 所做的事情，它代表了我们教机器理解视觉内容方式的根本性转变。...",
    "content": "# OpenAI CLIP：通过文本学习零样本图像识别的模型\n\n想象一下，教计算机识别物体，不是通过向它展示数百万张带标签的照片，而是让它浏览互联网，并从人们自然描述图像的方式中学习。这正是 OpenAI 的 CLIP 所做的事情，它代表了我们教机器理解视觉内容方式的根本性转变。\n\nCLIP（Contrastive Language-Image Pre-training，对比语言-图像预训练）是一个连接视觉和语言的神经网络。它于 2021 年 1 月发布，能够将图像分类到你想要的任何类别中，而无需专门为此任务进行训练。你只需用通俗易懂的英语告诉它你在寻找什么，它就能识别出来。这种“零样本”（zero-shot）能力使 CLIP 不同于几乎所有之前的计算机视觉系统。\n\n本文将探讨 CLIP 的工作原理以及它试图解决的问题。\n\n## CLIP 解决的问题\n\n传统的计算机视觉遵循严格的公式。如果你想让一个模型区分猫和狗，你需要数千张带标签的照片。对于不同的汽车型号，你需要另一个昂贵的数据集。举例来说，ImageNet 是最著名的图像数据集之一，它需要超过 25,000 名工作人员标注 1400 万张图像。\n\n这种方法带来了三个主要问题：\n\n*   首先，数据集的构建成本高昂且耗时。\n*   其次，模型变成了狭隘的专家。一个 ImageNet 模型可以识别 1,000 个类别，但要使其适应新任务，就需要收集更多数据并重新训练。\n*   第三，模型可能会通过针对特定基准进行优化来“作弊”。\n\n例如，一个在 ImageNet 上达到 76% 准确率的模型，在相同物体的草图上可能会下降到 37%，或者在略微修改的图像上骤降到 2.7%。模型学会了 ImageNet 的特性，而不是真正理解视觉概念。\n\nCLIP 的方法则截然不同。它不是在精心标注的数据集上进行训练，而是从互联网上收集的 4 亿个图像-文本对中学习。这些对在网上随处可见：带有标题的 Instagram 照片、带有图像的新闻文章、带有描述的产品列表以及带有图片的维基百科条目。人们自然会编写描述、解释或评论图像的文本，这创造了一个巨大的训练数据来源。\n\n然而，CLIP 并不试图预测特定的类别标签。相反，它学习将图像与其对应的文本描述进行匹配。在训练过程中，CLIP 会看到一张图像和一大批文本片段（一次 32,768 个）。它的任务是确定哪个文本片段最能匹配该图像。\n\n可以将其想象成一个大型的配对游戏。例如，我们向系统展示一张金毛犬在公园玩耍的照片。在 32,768 个文本选项中，只有一个是正确的：可能​​是“一只金毛犬在公园里玩耍”。其他 32,767 个选项可能包括“一只黑猫在睡觉”、“日落时分的山景”、“一个人在吃披萨”以及成千上万的其他描述。为了在数百万个此类示例中始终选择正确的匹配项，CLIP 必须学习物体、场景、动作和属性的外观以及它们如何与语言对应。\n\n通过一遍又一遍地使用极其多样化的互联网数据解决这个匹配任务，CLIP 对视觉概念及其语言描述形成了深刻的理解。例如，它可能学习到毛茸茸、四条腿、摇着尾巴的动物与“狗”和“小狗”等词汇对应。它可能学习到水面上的橙色和粉红色天空与“日落”和“海滩”相关。换句话说，它建立了一个连接视觉世界和语言世界的丰富心智模型。\n\n## 技术基础\n\n在底层，CLIP 使用两个独立的神经网络协同工作：一个图像编码器（image encoder）和一个文本编码器（text encoder）。\n\n图像编码器将原始像素转换为一个数值向量（称为嵌入，embedding）。文本编码器将单词和句子也输出为一个向量。关键的洞察是，两个编码器都在相同的维度空间中输出向量，这使得它们可以直接进行比较。\n\n最初，这些编码器可能会产生完全随机、毫无意义的向量。例如，一张狗的图像可能变成 [0.2, -0.7, 0.3, ...]，而文本“dog”变成 [-0.5, 0.1, 0.9, ...]。这些数字之间没有任何关系。但这就是训练发挥魔力的地方。\n\n训练过程使用了一种称为对比损失函数（contrastive loss function）的方法。这仅仅是一种衡量模型当前错误程度的数学方法。对于正确的图像-文本对（例如狗的图像与“狗在玩耍”），损失函数会说这些嵌入应该非常相似。对于不正确的对（例如狗的图像与“猫在睡觉”），它会说它们应该非常不同。损失函数会产生一个单一的数字，表示批次中所有图像和文本的总误差。\n\n参见下图：\nSource: OpenAI Research Blog\n\n然后是反向传播（backpropagation），这是神经网络中的基本学习机制。它精确计算出两个编码器中每个权重应该如何改变以减少这个误差。权重会轻微更新，这个过程会随着不同批次的数据重复数百万次。逐渐地，两个编码器都学会了为匹配的概念生成相似的向量。例如，狗的图像开始生成接近文本编码器放置“狗”这个词的向量。\n\n换句话说，通过在数百万个多样化示例中不断施加压力以匹配正确的对并分离不正确的对，编码器逐渐演化出能够“说”相同语言的能力。\n\n## 零样本分类实战\n\n一旦 CLIP 训练完成，其零样本能力就变得显而易见。假设我们想将图像分类为包含狗或猫。我们不需要重新训练 CLIP 或向其展示带标签的示例。\n\n相反，我们可以简单地获取图像，并通过图像编码器将其转换为嵌入。接下来，我们可以获取文本“一只狗的照片”，并通过文本编码器获取另一个嵌入。然后，我们可以获取文本“一只猫的照片”，获取第三个嵌入。比较哪个文本嵌入与图像嵌入更接近，这就是答案。\n\n参见下图：\nSource: OpenAI Research Blog\n\nCLIP 本质上是在问：“根据从互联网上学到的一切，这张图像更可能与关于狗的文本一起出现，还是与关于猫的文本一起出现？”\n\n因为它从如此多样化的数据中学习，所以这种方法适用于你能够用语言描述的几乎任何分类任务。\n\n想要对食物类型进行分类？使用“一张披萨的照片”、“一张寿司的照片”、“一张玉米饼的照片”作为你的类别。需要分析卫星图像？尝试“一张森林的卫星照片”、“一张城市的卫星照片”、“一张农田的卫星照片”。处理医学图像？你可以使用“一张显示肺炎的 X 射线”与“一张健康肺部的 X 射线”。你只需更改文本描述。无需重新训练。\n\n这种灵活性具有变革性。传统模型需要为每个新任务准备大量的带标签数据集。CLIP 可以立即处理新任务，唯一受限的是你用自然语言描述类别的能力。\n\n## 使 CLIP 成为可能的设计选择\n\nCLIP 的成功不仅仅在于核心思想。OpenAI 做出了两个关键的技术决策，使得训练在计算上变得可行。\n\n首先，他们选择了对比学习（contrastive learning），而不是更明显的训练模型生成图像标题的方法。早期的实验尝试教系统看图像并逐字生成完整的文本描述，类似于语言模型生成文本的方式。虽然直观，但这种方法被证明速度极慢且计算成本极高。生成完整的句子比简单地学习匹配图像和文本需要更多的计算。事实证明，对比学习在实现良好零样本性能方面效率高出 4 到 10 倍。\n\n其次，他们为图像编码器采用了 Vision Transformers（视觉 Transformer）。Transformers 架构是 GPT 和 BERT 背后的技术，已经彻底改变了自然语言处理。将其应用于图像（将图像块视为句子中的单词）比传统的卷积神经网络（如 ResNet）又带来了 3 倍的计算效率提升。\n\nSource: OpenAI Research Blog\n\n这些选择的结合意味着 CLIP 可以在 256 个 GPU 上训练两周，与当时其他大型视觉模型所需的时间相似，而不需要天文数字般的更多计算资源。\n\n## 结论\n\nOpenAI 在 30 多个不同的数据集上测试了 CLIP，涵盖了各种任务：细粒度分类、光学字符识别（OCR）、动作识别、地理定位和卫星图像分析。\n\n结果验证了 CLIP 的方法。CLIP 在标准 ImageNet 上达到了 ResNet-50 的 76.2% 准确率，同时在 26 个迁移学习基准测试中的 20 个上超越了最佳公开 ImageNet 模型。更重要的是，在传统模型崩溃的压力测试中，CLIP 保持了强大的性能。在 ImageNet Sketch 上，CLIP 达到了 60.2% 的准确率，而 ResNet 只有 25.2%。在对抗性示例上，CLIP 得分为 77.1%，而 ResNet 为 2.7%。\n\nSource: OpenAI Research Blog\n\n然而，该模型在某些方面仍然存在困难，例如：\n\n*   需要精确空间推理或计数的任务。它在非常细粒度的区分上也存在困难，例如区分相似的汽车型号或飞机变体，其中微妙的细节至关重要。\n*   在 MNIST 数据集上的手写数字测试中（在计算机视觉中被认为是微不足道的任务），CLIP 仅达到了 88% 的准确率，远低于人类 99.75% 的表现。\n*   CLIP 对你文本提示的措辞敏感。有时需要反复试验（“提示工程”，prompt engineering）才能找到效果好的措辞。\n*   CLIP 继承了其互联网训练数据中的偏差。我们措辞类别的方式可能会以有问题的方式极大地影响模型行为。\n\n然而，尽管存在这些局限性，CLIP 证明了驱动近期自然语言处理突破的方法（从海量互联网文本中学习）可以迁移到计算机视觉领域。正如 GPT 模型通过在互联网文本上训练来执行各种语言任务一样，CLIP 通过在互联网图像-文本对上训练来学习各种视觉任务。\n\n自发布以来，CLIP 已成为整个 AI 行业的基础设施。它是完全开源的，促进了广泛的应用。像 Stable Diffusion 和 DALL-E 这样的现代文本到图像系统使用 CLIP 类似的模型来理解文本提示。公司将其用于图像搜索、内容审核和推荐。\n\n## References:\n*   CLIP: Connecting Text and Images\n*   What is ImageNet\n\n---\n\n## 要点总结\n\n*   **零样本图像识别**：CLIP 通过学习图像与自然语言描述之间的关联，实现了无需专门训练即可对新类别进行图像识别的能力（Zero-Shot Image Recognition）。\n*   **对比语言-图像预训练（CLIP）**：模型的核心在于使用对比学习，将图像与其对应的文本描述进行匹配，而非传统的分类或生成图像标题。\n*   **大规模互联网数据**：CLIP 突破了传统计算机视觉模型对昂贵、耗时且狭窄的标注数据集的依赖，利用从互联网收集的 4 亿个图像-文本对进行训练，显著提高了泛化能力。\n*   **双编码器架构**：模型由独立的图像编码器（Image Encoder）和文本编码器（Text Encoder）组成，它们将图像和文本分别转换为相同维度空间中的嵌入向量。\n*   **对比损失函数**：训练目标是使匹配的图像-文本对的嵌入向量尽可能相似，而不匹配的对则尽可能不同。\n*   **学习机制**：通过反向传播和持续的权重更新，编码器逐渐学会将视觉概念和语言描述映射到同一语义空间。\n*   **Vision Transformers**：在图像编码器中采用 Transformer 架构（类似 GPT 和 BERT），提高了计算效率。\n*   **高效训练**：对比学习和 Vision Transformers 的结合，使得 CLIP 能以相对可控的计算资源（256 个 GPU 训练两周）实现高性能。\n*   **广泛应用**：CLIP 成为许多现代 AI 应用（如文生图模型 Stable Diffusion、DALL-E、图像搜索、内容审核）的基础。\n*   **局限性**：尽管能力强大，CLIP 在精确空间推理、细粒度区分、手写数字识别等任务上仍有不足，且存在对提示词措辞敏感和继承训练数据偏差的问题。\n\n## 你可以从这篇文章学到什么\n\n对于一个有几年经验的后端/系统设计工程师来说，这篇文章不仅介绍了 CLIP 这一开创性 AI 模型，更重要的是，它提供了关于大规模系统如何通过巧妙的设计选择解决复杂问题的深刻洞察。\n\n1.  **从数据到智能的范式转变**：文章展示了 AI 领域从“小数据、精标注”向“大数据、弱标注（或自监督）”训练范式转变的案例。在你的系统中，如果面临数据标注成本高昂或数据多样性不足的问题，可以思考如何利用现有非结构化或弱关联数据，通过自监督或对比学习的方式来训练模型，从而降低人工成本并提升模型鲁棒性。\n2.  **多模态数据融合的潜力**：CLIP 将图像和文本两种模态连接起来，创建了一个统一的语义空间。在系统设计中，如果你需要处理多种类型的数据（例如日志、用户行为、图像、视频），可以借鉴这种思路，设计统一的嵌入空间来表示不同模态的信息，从而实现更深层次的关联分析、推荐或搜索功能。\n3.  **效率与效果的权衡和创新**：OpenAI 团队选择对比学习而非图像标题生成，以及采用 Vision Transformers，都是为了在保证零样本性能的同时，大幅提高训练效率。这提醒我们在设计复杂系统时，要时刻考虑计算资源、延迟和用户体验的权衡，并通过技术创新（如选择更高效的算法、架构或分布式策略）来优化系统性能。\n4.  **大规模预训练模型的价值**：CLIP 作为一个在海量数据上预训练的模型，能够通过简单的提示词适应多种下游任务，体现了通用模型作为“基础设施”的巨大价值。在构建你的系统时，可以考虑是否能利用或集成这类大型预训练模型（无论是现成的还是自研的），将其作为核心组件，以加速开发、降低维护成本并提升功能边界。例如，你可以用 CLIP 来增强你系统的图像搜索能力、内容标签自动化或跨模态推荐。\n5.  **理解模型局限性和偏差的重要性**：文章清晰地指出了 CLIP 的局限性，如对空间推理、细粒度区分的不足，以及继承训练数据偏差的问题。这对于任何将 AI 模型集成到生产系统中的工程师都至关重要。你需要深入了解所用模型的优缺点，在系统设计时考虑如何规避或减轻这些限制，例如通过额外的规则引擎、人工审核或专门的后处理模块来弥补模型不足，确保系统的健壮性和公平性。\n6.  **架构选择对性能的影响**：对比学习和 Transformer 架构的选择，直接提升了 CLIP 的训练效率和泛化能力。对于后端工程师而言，这意味着在设计微服务架构、数据管道或选择数据库时，对底层技术（如消息队列、缓存、RPC 框架、数据存储类型）的选择同样至关重要，它们会深刻影响系统的可伸缩性、性能和成本。理解每种技术背后的设计哲学和权衡，能够帮助你做出更明智的决策。",
    "url": "https://blog.bytebytego.com/p/openai-clip-the-model-that-learnt"
  },
  {
    "id": "2025-12-30-openai-clip-the-model-that-learnt-zero-shot-image-recognition-using-text",
    "title": "OpenAI CLIP: The Model That Learnt Zero-Shot Image Recognition Using Text",
    "date": "2025-12-30",
    "preview": "# OpenAI CLIP：通过文本学习零样本图像识别的模型  想象一下，教计算机识别物体，不是通过向它展示数百万张带标签的照片，而是让它浏览互联网，从人们自然描述图像的方式中学习。这正是 OpenAI 的 CLIP 所做的工作，它代表了我们教机器理解视觉内容的根本性转变。  C...",
    "content": "# OpenAI CLIP：通过文本学习零样本图像识别的模型\n\n想象一下，教计算机识别物体，不是通过向它展示数百万张带标签的照片，而是让它浏览互联网，从人们自然描述图像的方式中学习。这正是 OpenAI 的 CLIP 所做的工作，它代表了我们教机器理解视觉内容的根本性转变。\n\nCLIP（Contrastive Language-Image Pre-training，对比语言-图像预训练）是一个连接视觉和语言的神经网络。它于 2021 年 1 月发布，能够将图像分类到你想要的任何类别中，而无需为此任务进行专门训练。你只需用通俗易懂的语言告诉它你在寻找什么，它就能识别出来。这种“零样本”（zero-shot）能力使 CLIP 不同于之前几乎所有的计算机视觉系统。\n\n在本文中，我们将探讨 CLIP 的工作原理以及它试图解决的问题。\n\n## CLIP 解决的问题\n\n传统的计算机视觉遵循僵化的模式。如果你想让模型区分猫和狗，你需要数千张带标签的照片。对于不同的汽车型号，你需要另一个昂贵的数据集。举例来说，ImageNet 是最著名的图像数据集之一，它需要超过 25,000 名工人标记 1400 万张图像。\n\n这种方法带来了三个主要问题：\n\n首先，数据集的构建成本高昂且耗时。\n\n其次，模型变成了狭隘的“专家”。一个 ImageNet 模型可以识别 1,000 个类别，但要使其适应新任务，需要收集更多数据并重新训练。\n\n第三，模型可能通过优化特定基准来“作弊”。\n\n例如，一个在 ImageNet 上达到 76% 准确率的模型，在同一物体的草图上可能下降到 37%，或者在略微修改的图像上骤降到 2.7%。模型学到的是 ImageNet 的怪癖，而不是真正理解视觉概念。\n\nCLIP 的方法则截然不同。它不是在精心标记的数据集上进行训练，而是从互联网上收集的 4 亿个图像-文本对中学习。这些图像-文本对在网上随处可见：带有描述的 Instagram 照片、配有图像的新闻文章、带有描述的产品列表以及配有图片的维基百科条目。人们自然会编写描述、解释或评论图像的文本，这创造了一个巨大的训练数据来源。\n\n然而，CLIP 并不试图预测特定的类别标签。相反，它学习将图像与其对应的文本描述进行匹配。在训练过程中，CLIP 会看到一张图像和一大批文本片段（一次 32,768 个）。它的任务是确定哪个文本片段与图像最匹配。\n\n可以把它想象成一个巨大的配对游戏。例如，我们向系统展示一张金毛犬在公园里玩耍的照片。在 32,768 个文本选项中，只有一个是正确的：也许是“一只金毛犬在公园里玩耍”。其他 32,767 个选项可能包括“一只黑猫在睡觉”、“日落时分的山景”、“一个人在吃披萨”以及数千种其他描述。为了在数百万个这样的例子中始终选择正确的匹配项，CLIP 必须了解物体、场景、动作和属性的外观以及它们如何与语言对应。\n\n通过一遍又一遍地解决这个匹配任务，利用极其多样化的互联网数据，CLIP 发展出对视觉概念及其语言描述的深刻理解。例如，它可能学到毛茸茸、四条腿、摇着尾巴的动物对应着“狗”和“小狗”等词。它可能学到水面上橙色和粉红色的天空与“日落”和“海滩”相关。换句话说，它建立了一个连接视觉世界和语言世界的丰富心智模型。\n\n## 技术基础\n\nCLIP 在底层使用了两个独立的神经网络协同工作：一个图像编码器（image encoder）和一个文本编码器（text encoder）。\n\n图像编码器将原始像素转换为数值向量（称为嵌入，embedding）。文本编码器将单词和句子也输出为向量。关键的洞察是，两个编码器都在相同的维度空间中输出向量，使得它们可以直接比较。\n\n最初，这些编码器可能会产生完全随机、毫无意义的向量。例如，一张狗的图像可能变成 [0.2, -0.7, 0.3, ...]，而文本“狗”可能变成 [-0.5, 0.1, 0.9, ...]。这些数字之间没有任何关系。但这就是训练发挥魔力的地方。\n\n训练过程使用了所谓的对比损失函数（contrastive loss function）。这只是一种衡量模型当前错误程度的数学方法。对于正确的图像-文本对（比如狗的图像配上“狗在玩耍”），损失函数会说这些嵌入应该非常相似。对于不正确的对（比如狗的图像配上“猫在睡觉”），它会说它们应该非常不同。损失函数会产生一个单一的数字，代表一批所有图像和文本的总误差。\n\n请看下面的图：\nSource: OpenAI Research Blog\n![CLIP contrastive learning diagram](https://openaicom.files.wordpress.com/2021/02/clip_blog_image_2.gif?w=1024)\n\n然后是反向传播（backpropagation），这是神经网络中的基本学习机制。它精确计算出两个编码器中的每个权重应该如何变化以减少这个误差。权重会略微更新，这个过程会用不同的数据批次重复数百万次。逐渐地，两个编码器都学会为匹配的概念生成相似的向量。例如，狗的图像开始产生接近文本编码器放置“狗”这个词的位置的向量。\n\n换句话说，通过在数百万个多样化示例中持续承受匹配正确对和分离不正确对的压力，编码器不断演进，学会了“说”相同的语言。\n\n## 零样本分类实战\n\n一旦 CLIP 训练完成，其零样本能力就显而易见了。假设我们想将图像分类为包含狗或猫。我们不需要重新训练 CLIP 或向其展示带标签的示例。\n\n相反，我们可以简单地将图像通过图像编码器（image encoder）获得一个嵌入（embedding）。接下来，我们可以将文本“一张狗的照片”通过文本编码器（text encoder）获得另一个嵌入。进一步地，我们可以将文本“一张猫的照片”获得第三个嵌入。比较哪个文本嵌入与图像嵌入更接近，这就是答案。\n\n请看下面的图：\nSource: OpenAI Research Blog\n![CLIP zero-shot classification diagram](https://openaicom.files.wordpress.com/2021/02/clip_blog_image_3.gif?w=1024)\n\nCLIP 本质上是在问：“根据从互联网上学到的一切，这张图片更有可能与关于狗的文本出现，还是与关于猫的文本出现？”\n\n由于它从如此多样化的数据中学习，这种方法适用于您可以用语言描述的几乎任何分类任务。\n\n想对食物类型进行分类？使用“一张披萨的照片”、“一张寿司的照片”、“一张玉米饼的照片”作为您的类别。需要分析卫星图像？尝试“一张森林的卫星照片”、“一张城市的卫星照片”、“一张农田的卫星照片”。处理医学图像？您可以使用“一张显示肺炎的 X 射线”与“一张健康肺部的 X 射线”。您只需更改文本描述。无需重新训练。\n\n这种灵活性是革命性的。传统模型需要为每个新任务准备大量的带标签数据集。CLIP 可以立即处理新任务，其唯一限制是您用自然语言描述类别的能力。\n\n## 使 CLIP 成为可能的设计选择\n\nCLIP 的成功不仅仅是核心思想。OpenAI 做出了两个关键的技术决策，使得训练在计算上变得可行。\n\n首先，他们选择了对比学习（contrastive learning），而不是更明显的训练模型生成图像描述的方法。早期的实验尝试教系统通过逐词生成完整的文本描述来理解图像，类似于语言模型生成文本的方式。虽然直观，但这种方法被证明极其缓慢且计算成本高昂。生成完整的句子比简单地学习匹配图像和文本需要更多的计算。对比学习在实现良好的零样本性能方面，效率是其 4 到 10 倍。\n\n其次，他们为图像编码器采用了 Vision Transformers（视觉 Transformer）。Transformer 架构是 GPT 和 BERT 背后的技术，已经彻底改变了自然语言处理。将其应用于图像（将图像块视为句子中的单词）比传统卷积神经网络（如 ResNet）又提供了 3 倍的计算效率提升。\n\nSource: OpenAI Research Blog\n![CLIP architecture detail](https://openaicom.files.wordpress.com/2021/02/clip_blog_image_6.gif?w=1024)\n\n综合来看，这些选择意味着 CLIP 可以在 256 个 GPU 上训练两周，与当时其他大规模视觉模型所需的计算量相似，而无需天文数字般的额外计算。\n\n## 结论\n\nOpenAI 在 30 多个不同数据集上测试了 CLIP，涵盖了各种任务：细粒度分类、光学字符识别、动作识别、地理定位和卫星图像分析。\n\n结果验证了 CLIP 的方法。虽然在标准 ImageNet 上与 ResNet-50 的 76.2% 准确率持平，但 CLIP 在 26 个迁移学习（transfer learning）基准中的 20 个上都超越了当时公开可用的最佳 ImageNet 模型。更重要的是，CLIP 在传统模型崩溃的压力测试中保持了强大的性能。在 ImageNet Sketch 上，CLIP 达到了 60.2%，而 ResNet 为 25.2%。在对抗性示例上，CLIP 得分为 77.1%，而 ResNet 为 2.7%。\n\nSource: OpenAI Research Blog\n![CLIP performance comparison](https://openaicom.files.wordpress.com/2021/02/clip_blog_image_8.gif?w=1024)\n\n然而，该模型仍然存在一些不足，例如：\n\n*   需要精确空间推理或计数的任务。它在非常细微的区分上也存在困难，比如区分相似的汽车型号或飞机变体，这些任务需要关注微妙的细节。\n*   在 MNIST 手写数字数据集上进行测试时（这在计算机视觉中被认为是微不足道的任务），CLIP 仅达到 88% 的准确率，远低于人类 99.75% 的表现。\n*   CLIP 对您文本提示的措辞方式很敏感。有时需要反复试验（“提示工程”，prompt engineering）才能找到效果良好的措辞。\n*   CLIP 继承了其互联网训练数据中的偏见。我们对类别进行措辞的方式可能会以有问题的方式极大地影响模型行为。\n\n然而，尽管存在局限性，CLIP 证明了推动自然语言处理近期突破的方法（从大量互联网文本中学习）可以迁移到计算机视觉领域。正如 GPT 模型通过训练互联网文本学习执行各种语言任务一样，CLIP 通过训练互联网图像-文本对学习执行各种视觉任务。\n\n自发布以来，CLIP 已成为整个 AI 行业的基础设施。它是完全开源的，促进了广泛的采用。现代文本到图像系统，如 Stable Diffusion 和 DALL-E，都使用 CLIP 类似的模型来理解文本提示。公司将其用于图像搜索、内容审核和推荐。\n\n## 参考文献:\n\n*   CLIP: Connecting Text and Images\n*   What is ImageNet\n\n---\n\n## 要点总结\n\n*   **痛点与革新**：传统计算机视觉模型依赖昂贵且耗时的大规模标注数据集，且模型专一性强、容易过拟合基准。CLIP 通过学习互联网上的海量“图像-文本对”解决了这些问题，实现了零样本（zero-shot）图像识别。\n*   **零样本能力**：CLIP 可以在未见过特定分类任务的情况下，仅通过文本描述就能对图像进行分类，极大地提升了模型的泛化性和灵活性。\n*   **对比学习核心**：CLIP 的训练核心是对比学习（contrastive learning）。它不直接预测标签，而是学习将图像嵌入（image embedding）与其对应的文本嵌入（text embedding）在同一向量空间中拉近，将不匹配的拉远。\n*   **双编码器架构**：CLIP 包含一个图像编码器和一个文本编码器，它们分别将图像和文本转换为高维向量。训练目标是使匹配的图像和文本在嵌入空间中彼此靠近。\n*   **Transformers 架构**：图像编码器采用了 Vision Transformers，将 Transformer 架构从自然语言处理扩展到图像领域，提高了计算效率。\n*   **计算效率**：相比于直接生成图像描述，对比学习效率高出 4-10 倍；Vision Transformers 相比传统 CNN 又提高了 3 倍效率，使得 CLIP 的大规模训练变得可行。\n*   **广泛适用性**：CLIP 的零样本能力使其适用于各种场景，从通用物体识别到卫星图像分析、医疗影像等，只需提供恰当的文本描述即可。\n*   **鲁棒性提升**：CLIP 在应对 ImageNet Sketch 和对抗性示例等压力测试时，表现出比传统模型更强的鲁棒性。\n*   **局限性**：CLIP 在精细的空间推理、计数、区分细微差异（如相似车模）以及 MNIST 等简单任务上仍有不足，且对文本提示（prompt engineering）敏感，并可能继承训练数据的偏见。\n*   **行业影响**：CLIP 模型是开源的，已成为 AI 行业的基础设施，被广泛应用于文本到图像生成（如 Stable Diffusion）、图像搜索、内容审核和推荐等领域。\n\n---\n\n## 你可以从这篇文章学到什么\n\n作为一名有几年经验的后端/系统设计工程师，这篇文章为我们提供了一些关于深度学习模型设计和大规模数据利用的深刻见解，这些思想可以启发我们在设计复杂系统时解决通用性和效率问题：\n\n1.  **大规模非结构化数据利用**：CLIP 证明了互联网上看似“无序”的“图像-文本对”能够成为强大模型的训练数据。这提示我们，在系统设计中，对于用户生成内容（UGC）或通过爬虫获取的大量非结构化数据，不一定需要进行昂贵的精细标注，而是可以探索通过弱监督或自监督的方式，从中挖掘出巨大的价值。例如，在构建内容推荐系统或内部知识库时，可以考虑利用标题、描述、标签等元数据与内容本身的关联性进行模型预训练。\n\n2.  **通用性与泛化能力**：CLIP 的零样本能力是其最大的亮点。它通过学习“视觉-语言”的通用对应关系，使得模型无需针对特定任务重新训练。对于系统设计而言，这意味着我们应该思考如何构建更具通用性的服务或组件，而不是为每个特定需求都从头开始。例如，在构建微服务时，一个通用的内容理解服务（基于 CLIP 思想）可以替代多个针对特定类别训练的分类服务，从而降低维护成本和开发周期。\n\n3.  **编码器（Encoder）模式的威力**：文章中强调了图像编码器和文本编码器将不同模态的数据映射到同一个嵌入空间。这种“多模态嵌入”（multimodal embedding）的思想在许多现代系统中都非常有用。例如，在搜索系统中，可以将不同类型的数据（如商品描述、用户评论、图片特征）编码成统一的向量，从而实现跨模态的检索或推荐。用户输入的查询文本可以直接与图片或商品描述的向量进行距离比较，实现更智能的搜索。\n\n4.  **对比学习（Contrastive Learning）的适用性**：对比学习作为一种强大的自监督学习范式，不仅限于 CLIP。当我们在系统中存在大量未标记数据，但可以轻松构建“正例对”（相似或匹配的数据）和“负例对”（不相似的数据）时，对比学习是一种非常有效的特征学习方法。这可以应用于用户行为模式识别（例如，用户 A 购买了商品 X，用户 B 浏览了商品 X，这可能是一个正例对）、日志异常检测或分布式跟踪中的相似性分析等场景。\n\n5.  **工程效率的考量**：CLIP 的成功得益于选择对比学习和 Vision Transformers 带来的计算效率提升。这提醒系统工程师，在选择算法和架构时，不仅要考虑模型效果，更要重视训练和推理的效率。在资源有限或需要快速迭代的场景下，一个效率更高但效果略差的模型，可能比一个效果顶尖但资源消耗巨大的模型更具实际价值。性能与成本的权衡始终是系统设计中的重要一环。\n\n6.  **模型局限性和“提示工程”**：CLIP 即使如此强大，仍有其局限性，例如对“提示词”（prompt）敏感，并可能存在偏见。这告诉我们在将 AI 模型集成到系统中时，不能盲目相信其完美性，需要设计健壮的错误处理、结果校验机制，并可能需要引入“提示工程”的概念，让非技术人员也能通过优化输入来提升系统表现。同时，对于 AI 模型的偏见问题，系统设计时需考虑数据来源、模型公平性评估和结果校正机制。",
    "url": "https://blog.bytebytego.com/p/openai-clip-the-model-that-learnt"
  },
  {
    "id": "2025-12-29-ep195-common-network-protocols-every-engineer-should-know",
    "title": "EP195: Common Network Protocols Every Engineer Should Know",
    "date": "2025-12-29",
    "preview": "## EP195: 每个工程师都应该了解的常见网络协议  ByteByteGo 2025年12月27日  本周系统设计回顾： 每个工程师都应该了解的常见网络协议  你是否曾好奇，当你点击电子邮件的“发送”按钮或加入视频通话时，究竟发生了什么？互联网上的每一次点击、每一条消息、每一...",
    "content": "## EP195: 每个工程师都应该了解的常见网络协议\n\nByteByteGo\n2025年12月27日\n\n本周系统设计回顾：\n每个工程师都应该了解的常见网络协议\n\n你是否曾好奇，当你点击电子邮件的“发送”按钮或加入视频通话时，究竟发生了什么？互联网上的每一次点击、每一条消息、每一次 API 调用都依赖于网络协议。它们定义了数据如何传输、谁可以进行通信以及通信的安全性如何。\n\n基础层是传输协议：TCP 确保可靠交付，UDP 优先考虑速度，而 QUIC 则通过 UDP 将两者结合起来。\n在此之上，HTTP 驱动着网络，TLS 确保其安全，而 DNS 将名称转换为地址。\n需要远程访问？那是 SSH。文件传输？SFTP 或 SMB。\n实时聊天和媒体？WebSocket、WebRTC 和 MQTT 保持数据实时流动。\n对于身份和访问管理，OAuth 和 OpenID 处理授权和身份验证。\n在后端，DHCP、NTP、ICMPv6 和 LDAP 默默地保持着一切同步、寻址和可发现。\n从简单的电子邮件 (SMTP, IMAP) 到加密的 VPN (WireGuard, IPsec)，这些协议构成了连接和保护互联网的无形语言。\n\n轮到你了：如果某个协议在全球范围内突然停止工作，哪一个会首先使互联网瘫痪？\n\n### 8 种常见的网络协议\n\n网络协议是网络中两个系统之间数据传输的关键。\n\n**FTP (File Transfer Protocol)**\n使用独立的控制和数据通道在客户端和服务器之间上传和下载文件。\n\n**TCP (Transmission Control Protocol)**\n通过三次握手 (SYN, SYN+ACK, ACK) 建立可靠连接，以实现准确的数据传输。\n\n**UDP (User Datagram Protocol)**\n发送轻量级、无连接的数据包（请求和响应），延迟最小。是快速传输的理想选择。\n\n**HTTP (HyperText Transfer Protocol)**\n使用 TCP 通过 HTTP 请求和响应来请求和接收 Web 资源（HTML、图片）。\n\n**HTTP/3 (QUIC)**\n构建在 UDP 之上，通过多路复用数据流和降低延迟，实现更快、更可靠的连接。\n\n**HTTPS (Secure HTTP)**\n通过使用公共密钥和会话密钥在 TCP 连接上进行加密来保护 HTTP，从而保护 Web 数据。\n\n**SMTP (Simple Mail Transfer Protocol)**\n通过 SMTP 服务器将电子邮件从发件人传输到收件人。常用于电子邮件投递。\n\n**WebSocket**\n将 HTTP 连接升级为全双工通道，用于实时、双向通信，例如实时聊天。\n\n### 一图胜千言：微服务开发的 9 大最佳实践\n\n在开发微服务时，我们需要遵循以下最佳实践：\n\n1.  为每个微服务使用独立的数据存储\n2.  保持代码成熟度水平相似\n3.  为每个微服务单独构建\n4.  为每个微服务分配单一职责\n5.  部署到容器中\n6.  设计无状态服务\n7.  采用领域驱动设计 (Domain-Driven Design)\n8.  设计微前端 (Micro Frontend)\n9.  编排微服务 (Orchestrating microservices)\n\n---\n\n### 要点总结\n\n*   网络协议是互联网运行的基础，定义了数据传输、通信安全等核心机制。\n*   传输层协议包括 TCP（可靠传输）、UDP（高速无连接）和 QUIC（兼顾速度和可靠性，基于 UDP）。\n*   应用层协议涵盖了 Web (HTTP/HTTPS)、远程访问 (SSH)、文件传输 (SFTP/SMB)、实时通信 (WebSocket/WebRTC/MQTT)、身份验证 (OAuth/OpenID)、邮件 (SMTP/IMAP) 等多种场景。\n*   DNS 负责域名解析，TLS 负责网络安全，DHCP、NTP、ICMPv6、LDAP 等则在后端提供基础设施服务。\n*   文章详细介绍了 8 种常见协议，包括 FTP、TCP、UDP、HTTP、HTTP/3 (QUIC)、HTTPS、SMTP 和 WebSocket 的基本功能。\n*   微服务开发应遵循 9 大最佳实践，包括独立数据存储、单一职责、容器化部署、无状态服务设计、领域驱动设计、微前端和有效的微服务编排。\n\n### 你可以从这篇文章学到什么\n\n对于一个有几年经验的后端/系统设计工程师来说，这篇文章提供了一个全面且精炼的网络协议知识回顾，以及微服务设计的实用指导。\n\n1.  **协议体系的宏观理解**：文章帮助工程师巩固对网络协议分层和各自作用的理解，从传输层到应用层，涵盖了日常工作中常用的协议，例如 TCP/UDP/QUIC、HTTP/HTTPS、SSH、WebSocket、OAuth 等。这有助于在系统设计时，选择最适合特定场景的通信协议，例如需要可靠性还是低延迟。\n2.  **核心协议的工作原理**：简明扼要地解释了 FTP、TCP 三次握手、UDP 的特点、HTTP/3 (QUIC) 的优势等，这些是面试和实际问题排查时的关键知识点。对这些基础的深入理解，能帮助工程师更好地诊断网络问题，优化系统性能。\n3.  **微服务设计原则的温故知新**：文章列出的 9 大微服务最佳实践是工程师在设计和实现微服务架构时应该时刻牢记的指导原则。例如，“为每个微服务使用独立的数据存储”、“分配单一职责”、“设计无状态服务”等，这些都是避免微服务陷阱，构建高内聚、低耦合、可扩展系统的关键。\n4.  **实际应用指导**：例如，在需要实时通信的场景（如聊天、协作工具），自然会想到使用 WebSocket；在需要可靠数据传输但对延迟敏感度不高时，会选择 TCP；而在对速度要求极高且少量数据丢失可接受时，UDP 更合适。而微服务的最佳实践则直接指导了如何将一个复杂系统拆分为可管理、可独立部署的服务，并确保它们之间的良好协作。\n\n总之，这篇文章不仅是知识的复习，更是系统设计决策和日常开发实践的有力参考，帮助工程师构建更健壮、高效和可维护的分布式系统。",
    "url": "https://blog.bytebytego.com/p/ep195-common-network-protocols-every"
  },
  {
    "id": "2025-12-28-ep195-common-network-protocols-every-engineer-should-know",
    "title": "EP195: Common Network Protocols Every Engineer Should Know",
    "date": "2025-12-28",
    "preview": "# 工程师应了解的常见网络协议  你是否曾好奇，当你点击邮件的“发送”按钮或加入视频通话时，究竟发生了什么？互联网上的每一次点击、每一条消息和每一次 API 调用都依赖于网络协议。它们定义了数据如何移动、谁可以通信以及这一切如何安全进行。  其基础是传输协议：TCP 确保可靠传输...",
    "content": "# 工程师应了解的常见网络协议\n\n你是否曾好奇，当你点击邮件的“发送”按钮或加入视频通话时，究竟发生了什么？互联网上的每一次点击、每一条消息和每一次 API 调用都依赖于网络协议。它们定义了数据如何移动、谁可以通信以及这一切如何安全进行。\n\n其基础是传输协议：TCP 确保可靠传输，UDP 优先考虑速度，而 QUIC 则通过 UDP 将两者结合。\n\n在此之上，HTTP 驱动着网络，TLS 确保其安全，而 DNS 则将域名解析为地址。\n\n需要远程访问？那是 SSH。文件传输？SFTP 或 SMB。\n\n实时聊天和媒体？WebSocket、WebRTC 和 MQTT 确保数据实时流动。\n\n对于身份和访问管理，OAuth 和 OpenID 处理授权和身份验证。\n\n在后端，DHCP、NTP、ICMPv6 和 LDAP 则默默地保持着一切同步、寻址和可发现。\n\n从简单的电子邮件 (SMTP, IMAP) 到加密的 VPN (WireGuard, IPsec)，这些协议构成了无形的语言，使互联网保持连接和安全。\n\n问问你自己：如果全球范围内的某个协议突然停止工作，哪一个会首先导致互联网崩溃？\n\n## 8 种常用网络协议\n\n网络协议是网络中两个系统之间传输数据的关键。\n\n**FTP (File Transfer Protocol)**\n使用单独的控制和数据通道在客户端和服务器之间上传和下载文件。\n\n**TCP (Transmission Control Protocol)**\n通过三次握手 (SYN, SYN+ACK, ACK) 建立可靠连接，以确保数据准确传输。\n\n**UDP (User Datagram Protocol)**\n发送轻量级、无连接的数据包（请求和响应），延迟极低。适用于快速传输。\n\n**HTTP (HyperText Transfer Protocol)**\n通过 HTTP 请求和响应，使用 TCP 来请求和接收网页资源 (HTML, 图像)。\n\n**HTTP/3 (QUIC)**\n构建在 UDP 之上，通过多路复用数据流和减少延迟，实现更快、更可靠的连接。\n\n**HTTPS (Secure HTTP)**\n通过基于 TCP 连接使用公共密钥和会话密钥进行加密，来保护 HTTP，从而保护网络数据。\n\n**SMTP (Simple Mail Transfer Protocol)**\n通过 SMTP 服务器将电子邮件从发送方传输到接收方。它通常用于邮件投递。\n\n**WebSocket**\n将 HTTP 连接升级为全双工通道，用于实时、双向通信，例如实时聊天。\n\n---\n\n## 要点总结\n\n*   网络协议是互联网运行的基础，定义了数据传输、通信和安全性。\n*   传输层协议如 TCP 提供可靠传输，UDP 追求速度，QUIC 则试图结合两者的优点。\n*   应用层协议涵盖了广泛的功能，包括网页访问 (HTTP/HTTPS)、安全 (TLS)、域名解析 (DNS)、远程访问 (SSH) 和文件传输 (SFTP/SMB)。\n*   实时通信协议如 WebSocket、WebRTC 和 MQTT 支持即时数据流和双向通信。\n*   身份验证和授权协议如 OAuth 和 OpenID 是现代系统访问控制的关键。\n*   后端服务依赖 DHCP、NTP、ICMPv6、LDAP 等协议进行网络配置、时间同步和目录服务。\n*   理解这些协议对于构建、维护和调试复杂的分布式系统至关重要。\n*   文章列举并简要介绍了 FTP、TCP、UDP、HTTP、HTTP/3 (QUIC)、HTTPS、SMTP 和 WebSocket 这 8 种常用协议的功能和特点。\n\n---\n\n## 你可以从这篇文章学到什么\n\n对于一个有几年经验的后端/系统设计工程师来说，这篇文章提供了一个简洁而全面的网络协议回顾，这对于巩固基础知识、提升系统设计能力非常有价值。\n\n1.  **系统性知识回顾与补充：** 即使是经验丰富的工程师，也可能对某些协议的底层机制或最新发展（如 HTTP/3 的 QUIC）了解不深。这篇文章能帮助你快速梳理不同层级的核心协议及其主要功能和应用场景，填补知识盲区。\n2.  **选择合适协议的决策依据：** 文章清晰地对比了 TCP 的可靠性和 UDP 的速度，以及 QUIC 如何结合两者。在设计系统时，你需要根据业务需求（如数据一致性、实时性、传输效率）来选择最合适的传输协议。例如，视频流倾向于 UDP 或 QUIC 以减少延迟，而数据库事务则必须依赖 TCP 的可靠性。\n3.  **理解系统性能瓶颈：** 熟悉各种协议的特点能帮助你分析和优化系统性能。例如，理解 HTTP/3 (QUIC) 如何通过多路复用和减少握手来降低延迟，可以指导你在高并发、低延迟要求的服务中考虑采用新协议。\n4.  **安全性和可观测性考量：** 文章提到了 TLS 对 HTTP 的加密以及 VPN 协议 (WireGuard, IPsec) 的作用。在设计系统时，你需要考虑数据在传输过程中的安全性，并选择合适的协议（如 HTTPS 而非 HTTP）和安全机制。此外，理解协议的工作原理也有助于更好地监控和调试网络问题。\n5.  **构建分布式系统的基石：** 无论是微服务间的 API 调用、消息队列的通信、文件上传下载、实时通知还是身份认证，都离不开这些基础协议。深入理解它们能让你在设计复杂的分布式系统架构时，更自信地选择和集成不同的组件，并预见到潜在的网络问题。\n6.  **面试准备：** 文章涵盖了系统设计面试中常见的基础网络协议知识点，是很好的复习材料。理解这些协议的应用场景和优缺点，能让你在面对相关问题时游刃有余。",
    "url": "https://blog.bytebytego.com/p/ep195-common-network-protocols-every"
  },
  {
    "id": "2025-12-27-learn-ai-in-the-new-year-become-an-ai-engineer-cohort-3-now-open",
    "title": "🚀 Learn AI in the New Year: Become an AI Engineer Cohort 3 Now Open",
    "date": "2025-12-27",
    "preview": "在第1期和第2期（近1000名工程师加入并掌握了真实的AI技能）取得巨大成功之后，我们很高兴地宣布“成为AI工程师”第3期现已启动！  这不仅仅是另一个关于AI框架和工具的课程。我们的目标是帮助工程师建立基础和端到端的技能集，以便他们能够作为AI工程师蓬勃发展。  以下是本期项目...",
    "content": "在第1期和第2期（近1000名工程师加入并掌握了真实的AI技能）取得巨大成功之后，我们很高兴地宣布“成为AI工程师”第3期现已启动！\n\n这不仅仅是另一个关于AI框架和工具的课程。我们的目标是帮助工程师建立基础和端到端的技能集，以便他们能够作为AI工程师蓬勃发展。\n\n以下是本期项目的特别之处：\n*   通过实践学习：构建真实世界的AI应用，而不仅仅是观看视频。\n*   结构化、系统化的学习路径：遵循精心设计的课程，带领你一步步从基础知识走向高级主题。\n*   实时反馈和指导：从讲师和同行那里获得直接反馈。\n*   社区驱动：独自学习很困难。与社区一起学习则很容易！\n\n我们专注于技能培养，而不仅仅是理论或被动学习。我们的目标是让每位参与者都能掌握构建AI系统的坚实基础。\n\n如果你想从零开始学习AI，现在是最佳时机。\n\n### 要点总结\n\n*   课程强调实践学习，鼓励学员通过构建真实世界的AI应用来掌握技能。\n*   提供结构化、系统化的学习路径，确保从基础到高级主题的循序渐进。\n*   包含实时反馈和专家指导，帮助学员及时修正方向并深入理解。\n*   倡导社区驱动的学习模式，促进学员间的交流、协作与共同进步。\n*   旨在帮助工程师建立全面的端到端AI技能集，以适应AI工程师的角色需求。\n*   目标是为学员打下构建AI系统的坚实基础，而非仅限于理论知识。\n\n### 你可以从这篇文章学到什么\n\n对于有几年经验的后端/系统设计工程师来说，这篇文章虽然直接宣传AI课程，但其中所阐述的学习方法论和对技能培养的理念，对系统设计和后端开发工作同样具有深刻的借鉴意义：\n\n1.  **重视实践与项目驱动**：文章强调“通过实践学习，构建真实世界的AI应用”。这对于系统设计工程师而言，意味着不仅要掌握理论知识和设计模式，更要通过实际项目、代码实现和系统部署来验证和深化理解。纸上谈兵的架构很难经受住真实世界的考验。\n2.  **结构化与系统化思维**：课程采用“结构化、系统化的学习路径，从基础到高级主题”逐步深入。这与优秀的系统设计实践异曲同工。设计复杂系统时，工程师必须从核心功能、数据流等基础出发，逐步考虑可扩展性、可靠性、安全性等高级特性，而非一开始就追求所有最优解。\n3.  **持续的反馈与迭代**：文中提到的“实时反馈和指导”在系统设计中表现为设计评审（Design Review）、代码评审（Code Review）以及上线后的监控与复盘。通过及时获取同事、领导或生产环境的反馈，我们可以不断迭代和优化系统设计，及早发现并解决潜在问题，降低风险。\n4.  **社区与协作的力量**：文章指出“独自学习很困难，与社区一起学习则很容易”。在系统设计中，这意味着团队协作、知识共享和跨职能沟通至关重要。一个开放、协作的团队文化能够汇集多方智慧，共同解决复杂的系统难题，比单打独斗更有效率和质量。\n5.  **构建端到端（End-to-End）能力**：AI工程师需要端到端的技能集。对于后端/系统设计工程师而言，这意味着不仅要专注于某个模块或服务的设计，还要理解整个系统的生命周期，包括前端交互、数据存储、API设计、部署运维、性能监控等，从而设计出更健壮、更易于维护的整体解决方案。\n6.  **打好坚实的基础**：无论学习AI还是进行系统设计，打好坚实的基础都是关键。深入理解计算机科学原理、数据结构、算法、网络协议、操作系统等，能让工程师在面对各种技术挑战时游刃有余，设计出更加高效和可靠的系统，这在应对未来技术演进中也至关重要。",
    "url": "https://blog.bytebytego.com/p/learn-ai-in-the-new-year-become-an"
  },
  {
    "id": "2025-12-26-how-shopify-prepares-for-black-friday",
    "title": "How Shopify Prepares for Black Friday",
    "date": "2025-12-26",
    "preview": "Shopify 如何为黑色星期五做准备  黑色星期五网购星期一（BFCM）2024 对 Shopify 来说是巨大的一年。该平台处理了 57.3 PB (petabytes) 的数据，处理了 10.5 万亿次数据库查询，其边缘网络峰值达到每分钟 2.84 亿次请求。仅在应用服务器...",
    "content": "Shopify 如何为黑色星期五做准备\n\n黑色星期五网购星期一（BFCM）2024 对 Shopify 来说是巨大的一年。该平台处理了 57.3 PB (petabytes) 的数据，处理了 10.5 万亿次数据库查询，其边缘网络峰值达到每分钟 2.84 亿次请求。仅在应用服务器上，他们在黑色星期五每分钟处理 8000 万次请求，同时每分钟推送 12 TB (terabytes) 的数据。\n\n有趣的是：这种流量水平现在已成为 Shopify 的基线。而 BFCM 2025 的规模甚至更大，处理了 90 PB 的数据，处理了 1.75 万亿次数据库写入，峰值性能达到每分钟 4.89 亿次请求。这就是为什么 Shopify 从零开始重建其整个 BFCM 准备计划的原因。\n\n这项准备工作涉及数千名工程师九个月的工作，运行了五次大规模的扩展测试。\n\n在本文中，我们将探讨 Shopify 如何为这场商业界的“超级碗”做好准备。\n\n### 三轨框架 (The Three-Track Framework)\n\nShopify 的 BFCM 准备工作从三月份开始，采用了基于 Google Cloud 的多区域策略。\n\n工程团队将工作组织成三个并行运行并相互影响的轨道：\n\n*   **容量规划 (Capacity Planning)** 涉及使用历史数据和商家增长预测来建模流量模式。团队尽早将这些估算提交给其云提供商，以便提供商能够确保他们有足够的物理基础设施可用。这个规划定义了 Shopify 需要多少计算能力以及这些能力需要部署在哪个地理位置。\n*   **基础设施路线图 (Infrastructure Roadmap)** 是团队审查其技术栈、评估需要哪些架构变更以及识别达到目标容量所需的系统升级的地方。这个轨道有助于安排所有待办工作。重要的是，Shopify 从不将 BFCM 作为发布截止日期。所有架构变更和迁移都在关键窗口前几个月完成。\n*   **风险评估 (Risk Assessments)** 使用“可能出什么问题 (What Could Go Wrong)”练习来记录故障场景。团队设定升级优先级并生成他们称之为“游戏日 (Game Days)”的输入。这些信息帮助他们提前测试和强化系统。\n\n这三条轨道不断相互反馈。例如，风险发现可能揭示团队未考虑到的容量缺口。基础设施变更可能引入需要评估的新风险。换句话说，这是一个持续的反馈循环。\n\n### 游戏日 (Game Days)\n\n为了正确评估风险，Shopify 工程团队会运行“游戏日”。这些是混沌工程 (chaos engineering) 演练，故意在 BFCM 规模下模拟生产故障。\n\n团队在早春开始举办游戏日。这涉及故意向系统注入故障，以测试它们在故障条件下的响应方式。可以将其视为软件的消防演习。\n\n在这些游戏日中，工程团队特别关注他们称之为“关键路径 (critical journeys)”的部分。这些是其平台上最具业务关键性的路径：结账、支付处理、订单创建和履约。如果这些在 BFCM 期间中断，商家会立即损失销售额。\n\n关键路径游戏日运行跨系统灾难模拟。以下是团队测试的一些常见方面：\n\n*   团队测试搜索和页面端点，同时随机化导航以模拟真实用户行为。他们注入网络故障和延迟，以查看当服务无法快速通信时会发生什么。\n*   他们清除缓存，以创建真实的负载模式，而不是在所有内容都被缓存时获得的人工快速响应。\n*   前端团队在这些演练期间运行 bug 扫荡 (bug bashes)。他们识别回归 (regressions)、测试关键用户流，并验证用户体验在峰值负载下是否能保持稳定。\n\n这些演练通过暴露操作手册和监控工具中的不足，建立了事件响应的“肌肉记忆”。\n\n最重要的是，Shopify 在 BFCM 之前就弥补了这些不足，而不是在商家最需要平台时才发现它们。游戏日的所有发现都输入到 Shopify 所谓的“弹性矩阵 (Resiliency Matrix)”中。这是一个集中式文档，用于跟踪整个平台上的漏洞、事件响应程序和修复。\n\n弹性矩阵包含五个关键组件：\n\n1.  **服务状态 (service status)**，显示所有关键服务的当前运行状态。\n2.  **故障场景 (failure scenarios)**，记录系统如何可能崩溃以及影响是什么。\n3.  **恢复程序 (recovery procedures)**，列出预期的恢复时间目标 (RTO) 和详细的问题修复运行手册 (runbooks)。\n4.  **操作手册 (operational playbooks)**，包含逐步的事件响应指南。\n5.  **值班覆盖 (on-call coverage)**，显示团队排班和 PagerDuty 升级路径。\n\n该矩阵成为 BFCM 之前系统强化的路线图。团队全年持续更新它，记录弹性改进。\n\n### 使用 Genghis 和 Toxiproxy 进行负载测试\n\n游戏日测试组件的隔离性，但 Shopify 还需要知道整个平台是否能处理 BFCM 流量。这就是负载测试 (load testing) 的用武之地。\n\n工程团队构建了一个名为 Genghis 的工具，该工具运行模拟真实用户行为的脚本化工作流。它模拟浏览、将商品添加到购物车以及完成结账流程。该工具逐渐增加流量，直到出现问题，这有助于团队找到其实际容量限制。\n\n测试在生产基础设施上同时从三个 Google Cloud 区域运行：us-central、us-east 和 europe-west4。这准确模拟了全球流量模式。Genghis 还在基线负载之上注入闪购爆发，以测试峰值容量场景。\n\nShopify 将 Genghis 与 Toxiproxy 结合使用，这是一个他们为模拟网络条件而构建的开源框架。Toxiproxy 注入网络故障和分区，从而阻止服务相互通信。举例来说，网络分区是指系统中的两个部分失去通信能力，即使它们都仍在运行。\n\n在测试期间，团队实时监控仪表盘，并随时准备在系统开始降级时中止。多个团队协调合作，以发现和修复出现的瓶颈。\n\n当负载测试揭示限制时，团队有三个选择：\n\n*   **横向扩展 (Horizontal scaling)** 意味着增加更多的应用实例。\n*   **纵向扩展 (Vertical scaling)** 意味着为每个实例提供更多的资源，例如 CPU 和内存。\n*   **优化 (Optimizations)** 意味着进行架构层面的更改以提高性能，范围从更好的数据库查询到跨消费层直至前端的性能调优。\n\n这些决策设定了最终的 BFCM 容量，并推动了 Shopify 整个技术栈的优化工作。关键的洞察是，团队不能等到 BFCM 才发现容量限制。扩展基础设施和优化代码需要数月的准备。\n\n### 分析平台挑战 (The Analytics Platform Challenge)\n\nBFCM 测试了 Shopify 的每一个系统，但 2025 年提出了一个独特的挑战。他们的一部分基础设施从未经历过假日流量，这带来了一个问题：当没有历史数据可供建模时，如何为峰值负载做准备？\n\n2024 年，Shopify 的工程团队重建了其整个分析平台。他们创建了新的 ETL 管道 (ETL stands for Extract, Transform, Load，这是一个从各种来源提取数据、处理数据并将其存储到有用位置的过程)。他们还切换了持久层 (persistence layer)，并用全新的 API 替换了其遗留系统。\n\n这造成了不对称。ETL 管道运行了 BFCM 2024，因此团队有一整季的生产数据，显示这些管道在假日负载下的表现。但他们的 API 层在高峰季节结束后才推出。他们正在为 BFCM 准备从未经历过假日流量的 API。\n\n这非常重要，因为在 BFCM 期间，商家会痴迷于检查他们的分析数据。他们想要实时销售额、转化率、流量模式和流行产品的数据。每一个这样的查询都会命中 API 层。如果这些 API 无法处理负载，商家在最关键的销售期间就会失去可见性。\n\nShopify 专门为分析基础设施运行了游戏日。这些是受控实验，旨在揭示故障模式和瓶颈。团队模拟了增加的流量负载，引入了数据库延迟，并测试了缓存故障，以系统地绘制系统在压力下的行为。\n\n结果显示了四个需要修复的关键问题：\n\n1.  首先，ETL 管道需要增加 Kafka 分区 (Kafka partition increases)，以在流量高峰期间保持数据的新鲜度。Apache Kafka 是一个分布式流处理平台，处理实时数据流。更多的分区意味着更多的并行处理，从而使 API 能够提供最新数据。\n2.  其次，API 层内存使用需要优化。团队通过性能分析 (profiling) 发现这一点，这意味着精确测量代码如何使用内存。每个 API 请求都使用了过多的内存。在高负载下，这会导致内存不足错误、响应时间变慢或完全崩溃。\n3.  第三，连接超时 (connection timeouts) 需要调整，以防止连接池耗尽。连接池 (connection pool) 是一组可重用的数据库连接。创建新连接是昂贵的，因此应用程序会重用它们。问题是超时时间太长，这意味着连接会卡住等待。在高负载下，可用连接会耗尽，新的请求开始失败。Shopify 调整了超时时间，以更快地释放连接。\n4.  第四，团队通过不同的负载均衡器方法拆分 API 请求。最初，API 请求都会排队到单个区域，这增加了延迟和负载。通过扩展次要区域的集群并更新负载均衡策略，他们更好地分配了工作，并防止 API 服务器被淹没。\n\n除了性能修复之外，团队还验证了警报并记录了响应程序。他们的团队经过培训，为在实际事件中处理故障做好了准备。\n\n### 规模测试 (The Scale Tests)\n\n游戏日和负载测试准备单个组件，但规模测试 (scale testing) 不同。它验证整个平台在 BFCM 流量下协同工作，揭示只有当所有系统同时满负荷运行时才会出现的问题。\n\n从四月到十月，Shopify 以其预测的流量水平运行了五次大规模测试，特别是其峰值 p90 流量假设。在统计学中，p90 表示第 90 百分位，即 90% 的请求将低于的流量水平。\n\n以下是这些规模测试的详细信息：\n\n*   前两次测试根据 2024 年的实际数据验证了基线性能。\n*   第三次到第五次测试逐步提高到 2025 年的预测，目标是去年负载的 150%。\n*   到第四次测试，Shopify 达到了每分钟 1.46 亿次请求和每分钟超过 8 万次结账。在当年的最后一次测试中，他们测试了 p99 场景，达到了每分钟 2 亿次请求。\n\n这些测试规模异常庞大，因此 Shopify 在夜间运行它们，并与 YouTube 协调，因为这些测试会影响共享的云基础设施。团队测试了弹性 (resilience)，而不仅仅是原始负载容量。他们执行了区域故障转移 (regional failovers)，将流量从核心美国和欧盟区域疏散，以验证他们的灾难恢复程序是否实际有效。\n\nShopify 运行了四种类型的测试：\n\n*   **架构扩展测试 (Architecture scale-up tests)** 验证了其基础设施是否处理计划容量。\n*   **正常运行期间的负载测试 (Load tests during normal operations)** 建立了峰值负载下的基线性能。\n*   **带故障转移的负载测试 (Load tests with failover)** 验证了灾难恢复和跨区域故障转移能力。\n*   **游戏日模拟 (Game Day simulations)** 通过混沌工程测试了跨系统弹性。\n\n团队模拟了真实用户行为，例如店面浏览和结账、来自应用程序和集成的管理员 API 流量、分析和报告负载以及后端 webhook 处理。他们还测试了关键场景，如持续峰值负载、区域故障转移和多个系统同时失效的级联故障。\n\n每个测试周期都识别出了在稳态负载下永远不会出现的问题，并且团队在问题出现时就修复了它们。一些关键问题如下：\n\n*   规模测试 1 和 2 揭示，在高负载下，核心操作会抛出错误，结账队列会积压。\n*   规模测试 3 验证了关键迁移，并确认在基础设施更改后区域路由行为符合预期。\n*   规模测试 4 达到了限制，触发了计划外的故障转移，识别了测试流量路由中的优先问题，并发现了在重新平衡期间使区域恢复上线时的延迟。\n*   规模测试 5 进行了全面预演，并且是唯一一次在北美工作时间运行的测试，以模拟真实的 BFCM 条件。所有其他测试都在夜间运行。\n\n项目中期，Shopify 做出了一个重要的转变。他们将**已认证的结账流程 (authenticated checkout flows)** 添加到其测试场景中。模拟真实的登录买家暴露了匿名浏览从未触及的速率限制代码路径。尽管已认证流程在流量中占比很小，但它们揭示了在实际事件中会导致问题的瓶颈。\n\n### BFCM 周末运营 (BFCM Weekend Operations)\n\nBFCM 的准备工作让 Shopify 做好准备，但卓越的运营能力使他们在流量实际飙升时保持稳定。\n\n运营计划协调工程团队、事件响应和实时系统调优。以下是该计划的关键组成部分：\n\n*   BFCM 周末的计划包括**实时监控**，所有区域的仪表盘可见性以及自动化警报。\n*   对于事件响应，**事件经理值班团队 (Incident Manager OnCall teams)** 提供 24/7 覆盖，并有清晰的升级路径。\n*   **商家沟通 (Merchant communications)** 确保商家获得状态更新和任何问题的通知。\n*   **实时优化 (Live optimization)** 允许根据实时流量模式进行系统调优。\n\nBFCM 结束后，**事后分析 (post-mortem process)** 将监控数据与实际商家结果关联起来，以了解哪些有效，哪些需要改进。\n\n理念很简单：准备让你做好准备，但卓越的运营能力让你保持稳定。\n\n### 结论\n\nShopify 2025 年的 BFCM 准备计划展示了大规模系统化准备的样子。数千名工程师工作了九个月，运行了五次主要规模测试，将他们的基础设施推向预期负载的 150%。他们执行了区域故障转移，进行了混沌工程演练，记录了系统漏洞，并在商家需要它们之前用更新的运行手册强化了系统。\n\n与典型的发布前准备不同之处在于其系统化的方法。大多数公司进行一两次负载测试，修复关键 bug，然后寄希望于最好。Shopify 花了九个月持续测试，发现突破点，修复问题，并验证修复是否实际有效。\n\n此外，Shopify 构建的工具并非临时的 BFCM 脚手架。弹性矩阵 (Resiliency Matrix)、关键路径游戏日 (Critical Journey Game Days) 和实时自适应预测 (real-time adaptive forecasting) 成为永久性的基础设施改进。它们使 Shopify 每天都更具弹性，而不仅仅是在高峰季节。\n\n为了可视化 BFCM，Shopify 还推出了一款有趣的弹球游戏来展示 Shopify Live Globe。游戏本身在浏览器中以 120fps 运行，具有完整的 3D 环境、物理引擎和 VR 支持。在幕后，游戏是一个使用 “react-three-fiber” 构建的 three.js 应用程序。每一个商家销售都会在几秒钟后显示在这个地球仪上。每个人都可以在 Shopify Live Globe 的主页上查看该游戏和可视化。\n\n---\n\n### 要点总结\n\n*   **三轨框架：** Shopify 采用容量规划、基础设施路线图和风险评估三个并行轨道进行系统准备，确保相互反馈和持续改进。\n*   **混沌工程与游戏日：** 通过模拟生产故障（如网络故障、缓存失效），尤其关注“关键业务路径”（结账、支付），以暴露系统弱点并建立事件响应“肌肉记忆”。\n*   **弹性矩阵：** 集中文档化服务状态、故障场景、恢复程序、操作手册和值班覆盖，作为系统强化的核心路线图。\n*   **负载测试工具：** 使用 Genghis 模拟真实用户行为和渐进式流量，配合 Toxiproxy 模拟网络故障和分区，全面评估系统容量。\n*   **应对容量限制的策略：** 负载测试发现瓶颈后，采取横向扩展、纵向扩展或架构优化三种措施。\n*   **无历史数据挑战与分析平台优化：** 针对新重建的分析平台，通过专门的游戏日，优化 Kafka 分区、API 内存使用、连接超时和负载均衡策略。\n*   **多轮规模测试：** 在长达数月的时间里，运行五次大型规模测试（包括 p90 和 p99 场景），验证整体平台在远超预期的负载下协同工作。\n*   **灾难恢复验证：** 在规模测试中执行区域故障转移，验证灾难恢复程序和跨区域故障转移能力。\n*   **已认证流程测试的重要性：** 即使占比小，模拟登录用户的结账流程也能揭示匿名测试无法触及的速率限制瓶颈。\n*   **运营卓越与持续改进：** 强调 BFCM 周末的实时监控、24/7 待命、商家沟通和实时调优，并通过事后分析不断改进。\n\n### 你可以从这篇文章学到什么\n\n对于一个拥有几年经验的后端/系统设计工程师来说，这篇文章提供了宝贵的实践经验和系统化思考框架，远超简单的“如何优化代码”的范畴：\n\n1.  **系统级准备的宏观视角：** 文章展示了一个超大规模公司如何进行长达九个月的系统级准备。这不仅仅是技术细节，更是项目管理、风险管理和团队协作的典范。你可以学习如何将看似零散的准备工作组织成结构化的“三轨框架”，确保关键要素不被遗漏。\n2.  **混沌工程的深度应用：** “游戏日”概念是混沌工程在实践中的一个绝佳案例。它教导我们不能只在正常运行时测试系统，而要主动引入故障，模拟真实世界的混乱。理解“关键路径”的测试焦点，能帮助你在设计和测试自己的系统时，优先保障最核心的业务流程。\n3.  **负载测试的科学方法：** 学习 Shopify 如何结合 Genghis 和 Toxiproxy 进行多区域、多场景（基线、峰值、闪购、故障转移）的负载测试，并采取迭代优化的策略。这提醒我们在进行负载测试时，不仅要测性能，更要测弹性，并为测试结果制定明确的应对方案（横向/纵向扩展、优化）。\n4.  **应对“无历史数据”的挑战：** 对于新系统或新功能，如何进行峰值准备是一个常见难题。Shopify 对分析平台的处理方式——通过模拟和游戏日来揭示瓶颈，然后进行针对性的优化（Kafka 分区、内存、连接池、负载均衡），提供了非常有价值的实战经验。\n5.  **设计弹性系统的具体技术细节：** 文章中提到了许多具体的优化点，如 Kafka 分区增加、API 内存分析、连接池超时调优、负载均衡策略优化。这些都是日常工作中可能遇到的问题，Shopify 的解决方案能作为你的参考和启发。\n6.  **迭代与持续改进的哲学：** Shopify 并非“一次性”准备，而是通过多轮规模测试，每次发现问题并修复，然后再次测试。这种“发现-修复-验证”的闭环过程，以及将临时工具转化为永久基础设施（如弹性矩阵），体现了持续集成和持续改进的思想。\n7.  **运营与工程的紧密结合：** BFCM 周末的运营计划强调了实时监控、明确的事件响应、商家沟通和实时调优。这提醒我们，再完美的系统也需要一套健壮的运营流程来支撑，并且事后分析对于长期的系统健康至关重要。\n8.  **风险规避的策略：** “绝不将 BFCM 作为发布截止日期”的原则至关重要。大型事件前冻结代码和架构，提前完成变更，是降低风险的黄金法则。\n\n将这些经验应用到你的工作中，可以帮助你构建更健壮、更具弹性的系统，并以更系统化、更前瞻性的思维应对潜在的挑战和大规模流量冲击。",
    "url": "https://blog.bytebytego.com/p/how-shopify-prepares-for-black-friday"
  },
  {
    "id": "2025-12-25-how-shopify-prepares-for-black-friday",
    "title": "How Shopify Prepares for Black Friday",
    "date": "2025-12-25",
    "preview": "Shopify 如何备战黑色星期五  **注意：** 本文是与 Shopify 工程团队合作撰写的。特别感谢 Shopify 工程团队与我们分享他们为“黑色星期五网络星期一”所做的准备工作，并审阅最终文章。本文中分享的所有技术细节均归功于 Shopify 工程团队。  2024 ...",
    "content": "Shopify 如何备战黑色星期五\n\n**注意：** 本文是与 Shopify 工程团队合作撰写的。特别感谢 Shopify 工程团队与我们分享他们为“黑色星期五网络星期一”所做的准备工作，并审阅最终文章。本文中分享的所有技术细节均归功于 Shopify 工程团队。\n\n2024 年的“黑色星期五网络星期一”（BFCM）对 Shopify 来说是一次巨大的考验。该平台处理了 57.3 PB (petabytes) 的数据，处理了 10.5 万亿次数据库查询，并在其边缘网络（edge network）上达到了每分钟 2.84 亿次请求的峰值。仅在应用服务器上，他们在黑色星期五就处理了每分钟 8000 万次请求，同时每分钟推送 12 TB (terabytes) 的数据。\n\n有趣的是：这种流量水平现在已成为 Shopify 的基线。而 2025 年的 BFCM 规模更大，处理了 90 PB 的数据，处理了 1.75 万亿次数据库写入，峰值性能达到每分钟 4.89 亿次请求。这就是为什么 Shopify 从零开始重建了其整个 BFCM 备战计划。\n\n这项准备工作涉及数千名工程师，历时九个月，进行了五次大规模压力测试。\n\n在本文中，我们将探讨 Shopify 如何在这一“商业超级碗”中取得成功。\n\n### 三轨框架\n\nShopify 的 BFCM 准备工作始于三月份，采取了基于 Google Cloud 的多区域策略。\n\n工程团队将工作分为三个并行且相互影响的轨道：\n\n1.  **容量规划（Capacity Planning）**：涉及使用历史数据和商家增长预测来建模流量模式。团队提前将这些估算提交给其云提供商，以便提供商能够确保有足够的物理基础设施可用。这项规划定义了 Shopify 需要多少计算能力以及这些能力需要部署在哪些地理位置。\n2.  **基础设施路线图（Infrastructure Roadmap）**：团队在此审查其技术栈，评估需要进行哪些架构更改，并确定达到目标容量所需的系统升级。此轨道有助于规划所有后续工作。重要的是，Shopify 从不将 BFCM 作为发布截止日期。所有架构更改和迁移都在关键窗口期前几个月完成。\n3.  **风险评估（Risk Assessments）**：使用“可能出错的地方”（What Could Go Wrong）练习来记录故障场景。团队设定升级优先级，并为他们称之为“Game Days”的活动生成输入。这种情报有助于他们提前测试和强化系统。\n\n这三个轨道不断相互反馈。例如，风险发现可能会揭示团队未曾考虑到的容量缺口。基础设施变更可能会引入需要评估的新风险。换句话说，这是一个持续的反馈循环。\n\n### Game Days（演练日）\n\n为了正确评估风险，Shopify 工程团队会运行“Game Days”。这些是混沌工程（chaos engineering）练习，旨在故意模拟 BFCM 规模下的生产故障。\n\n团队从早春开始举办 Game Days。这涉及故意向系统注入故障，以测试它们在故障条件下的响应方式。可以将其视为软件的消防演习。\n\n在这些 Game Days 中，工程团队特别关注他们称之为“关键旅程”（critical journeys）的部分。这些是平台中最关键的业务路径：结账（checkout）、支付处理（payment processing）、订单创建（order creation）和履约（fulfillment）。如果这些在 BFCM 期间出现问题，商家会立即蒙受销售损失。\n\n关键旅程 Game Days 运行跨系统灾难模拟。以下是团队测试的一些常见方面：\n\n*   团队测试搜索和页面端点，同时随机化导航以模仿真实用户行为。他们注入网络故障和延迟，以查看服务无法快速通信时会发生什么。\n*   他们清除缓存（bust caches），以创建真实的负载模式，而不是在所有内容都被缓存时获得的人工快速响应。\n*   前端团队在这些练习期间进行“bug bashes”（集中找 Bug）。他们识别回归（regressions），测试关键用户流程，并验证用户体验在高峰负载条件下是否能保持稳定。\n\n这些练习通过暴露操作手册（operational playbooks）和监控工具中的空白，培养了事件响应的“肌肉记忆”。\n\n最重要的是，Shopify 在 BFCM 之前就填补了这些空白，而不是在商家最需要平台时才发现它们。Game Days 的所有发现都反馈到 Shopify 所称的“弹性矩阵”（Resiliency Matrix）中。这是一个集中的文档，用于跟踪整个平台中的漏洞、事件响应程序和修复措施。\n\n弹性矩阵包含五个关键组件：\n\n1.  **服务状态（service status）**：显示所有关键服务的当前运行状态。\n2.  **故障场景（failure scenarios）**：记录可能出现的故障类型及其影响。\n3.  **恢复程序（recovery procedures）**：列出预期的恢复时间目标（RTO）和修复问题的详细运行手册（runbooks）。\n4.  **操作手册（operational playbooks）**：提供逐步的事件响应指南。\n5.  **值班覆盖（on-call coverage）**：显示团队排班和 PagerDuty 升级路径。\n\n该矩阵成为 BFCM 之前系统强化的路线图。团队全年持续更新它，记录他们在此过程中进行的弹性改进。\n\n### 使用 Genghis 和 Toxiproxy 进行负载测试\n\nGame Days 隔离地测试组件，但 Shopify 还需要知道整个平台是否能处理 BFCM 的流量。这就是负载测试（load testing）发挥作用的地方。\n\n工程团队构建了一个名为 Genghis 的工具，该工具运行模拟真实用户行为的脚本化工作流。它模拟浏览、将商品添加到购物车以及完成结账流程。该工具逐渐增加流量，直到系统出现故障，这有助于团队找到其实际容量限制。\n\n测试同时从三个 Google Cloud 区域的生产基础设施上运行：`us-central`、`us-east` 和 `europe-west4`。这准确地模拟了全球流量模式。Genghis 还会注入闪购（flash sale）突发流量，叠加在基线负载之上，以测试峰值容量场景。\n\nShopify 将 Genghis 与 Toxiproxy 结合使用，Toxiproxy 是他们为模拟网络条件而构建的开源框架。Toxiproxy 注入网络故障和分区，阻止服务相互通信。作为参考，网络分区是指系统中的两个部分失去通信能力，即使它们都仍在运行。\n\n在测试期间，团队实时监控仪表板，并准备在系统开始退化时中止测试。多个团队协调工作，以发现并修复出现的瓶颈。\n\n当负载测试揭示限制时，团队有三个选择：\n\n*   **水平扩展（Horizontal scaling）**：意味着添加更多应用实例。\n*   **垂直扩展（Vertical scaling）**：意味着为每个实例提供更多资源，例如 CPU 和内存。\n*   **优化（Optimizations）**：意味着进行架构级别的更改以提高性能，范围从更好的数据库查询到跨消费层直到前端的性能调优。\n\n这些决策设定了最终的 BFCM 容量，并推动了 Shopify 整个技术栈的优化工作。关键的见解是，团队不能等到 BFCM 才发现容量限制。扩展基础设施和优化代码需要数月时间准备。\n\n### 分析平台挑战\n\nBFCM 测试了 Shopify 的每一个系统，但 2025 年提出了一个独特的挑战。他们部分基础设施从未经历过假日流量，这带来了一个问题：在没有历史数据可供建模的情况下，如何为高峰负载做准备？\n\n2024 年，Shopify 的工程团队重建了其整个分析平台。他们创建了新的 ETL 管道（ETL 代表 Extract, Transform, Load，即从各种源提取数据、处理数据并将其存储到有用位置的过程）。他们还更换了持久层（persistence layer），并用全新的 API 替换了其旧系统。\n\n这造成了一种不对称。ETL 管道在 2024 年 BFCM 期间运行，因此团队拥有一个完整的生产数据季节，显示这些管道在假日负载下的表现。但他们的 API 层在高峰季结束后才发布。他们正在为从未见过假日流量的 API 做 BFCM 准备。\n\n这一点非常重要，因为在 BFCM 期间，商家会 obsessively 检查他们的分析数据。他们想要实时的销售数据、转化率、流量模式和热门产品数据。所有这些查询都会命中 API 层。如果这些 API 无法处理负载，商家将在其最关键的销售期间失去可见性。\n\nShopify 专门为分析基础设施运行了 Game Days。这些是受控实验，旨在揭示故障模式和瓶颈。团队模拟了增加的流量负载，引入了数据库延迟，并测试了缓存故障，以系统地映射系统在压力下的行为。\n\n结果显示了四个需要修复的关键问题：\n\n1.  首先，ETL 管道需要增加 Kafka 分区（Kafka partition increases），以在流量高峰期间保持数据新鲜度。Apache Kafka 是一个分布式流处理平台，处理实时数据流。更多的分区意味着更多的并行处理，从而保持数据对 API 的新鲜度。\n2.  其次，API 层的内存使用需要优化。团队通过性能分析（profiling）发现了这一点，这意味着精确测量代码如何使用内存。每个 API 请求都使用了过多的内存。在高负载下，这会导致内存不足错误、响应时间变慢或完全崩溃。\n3.  第三，连接超时（connection timeouts）需要调整，以防止连接池耗尽。连接池（connection pool）是一组可重用的数据库连接。创建新连接成本很高，因此应用程序会重用它们。问题在于超时时间过长，这意味着连接会卡住等待。在高负载下，可用连接会耗尽，新请求开始失败。Shopify 调整了超时时间，以更快地释放连接。\n4.  第四，团队通过不同的负载均衡器方法拆分 API 请求。最初，API 请求都排队到同一个区域，这增加了延迟和负载。通过扩展次要区域的集群并更新负载均衡策略，他们更好地分配了工作，防止 API 服务器过载。\n\n除了性能修复之外，团队还验证了警报并记录了响应程序。他们的团队经过培训，为在实际事件中处理故障做好了准备。\n\n### 规模测试\n\nGame Days 和负载测试为单个组件做准备，但规模测试（scale testing）有所不同。它验证整个平台在 BFCM 流量下协同工作，揭示只有在所有系统同时满负荷运行时才会出现的问题。\n\n从四月到十月，Shopify 以其预测的流量水平，特别是其峰值 p90 流量假设（p90 在统计学中表示第 90 百分位数，即 90% 的请求流量将低于此水平），进行了五次大规模压力测试。\n\n以下是这些规模测试的详细信息：\n\n*   前两次测试根据 2024 年的实际数据验证了基线性能。\n*   第三到第五次测试逐步增加到 2025 年的预测值，目标是去年负载的 150%。\n*   到第四次测试时，Shopify 达到了每分钟 1.46 亿次请求和每分钟超过 8 万次结账。在当年的最后一次测试中，他们测试了 p99 场景，达到了每分钟 2 亿次请求。\n\n这些测试规模异常庞大，因此 Shopify 在夜间运行它们，并与 YouTube 协调，因为这些测试会影响共享的云基础设施。团队测试了弹性，而不仅仅是原始负载容量。他们执行了区域故障转移（regional failovers），从核心美国和欧盟区域撤离流量，以验证其灾难恢复程序是否实际有效。\n\nShopify 运行了四种类型的测试：\n\n*   **架构扩展测试（Architecture scale-up tests）**：验证其基础设施能否处理计划容量。\n*   **正常运行期间的负载测试（Load tests during normal operations）**：在峰值负载下建立基线性能。\n*   **带故障转移的负载测试（Load tests with failover）**：验证灾难恢复和跨区域故障转移能力。\n*   **Game Day 模拟（Game Day simulations）**：通过混沌工程测试跨系统弹性。\n\n团队模拟了真实用户行为，例如店面浏览和结账、来自应用程序和集成的管理员 API 流量、分析和报告负载以及后端 Webhook 处理。他们还测试了关键场景，如持续峰值负载、区域故障转移以及多个系统同时失败的级联故障（cascading failures）。\n\n每个测试周期都发现了一些在稳定负载下永远不会出现的问题，团队在问题出现时立即修复了它们。以下是一些关键问题：\n\n*   规模测试 1 和 2 发现，在高负载下，核心操作会抛出错误，并且结账队列会积压。\n*   规模测试 3 验证了关键迁移，并确认在基础设施更改后区域路由（regional routing）行为符合预期。\n*   规模测试 4 达到了限制，触发了计划外的故障转移，识别了测试流量路由中的优先问题，并发现了在重新平衡期间使区域重新上线时的延迟。\n*   规模测试 5 进行了全面演练，是唯一在北美工作时间运行的测试，以模拟真实的 BFCM 条件。所有其他测试都在夜间运行。\n\n项目中期，Shopify 做出了一个重要的转变。他们在测试场景中添加了已验证身份的结账流程（authenticated checkout flows）。模拟真实的登录买家暴露了匿名浏览从未触及的限速代码路径。尽管已验证身份的流程在总流量中占比较小，但它们揭示了在实际事件中会导致问题的瓶颈。\n\n### BFCM 周末运营\n\nBFCM 准备让 Shopify 做好了准备，但卓越的运营能力使他们在流量实际飙升时保持稳定。\n\n运营计划协调工程团队、事件响应和实时系统调优。以下是该计划的关键组成部分：\n\n*   BFCM 周末计划包括实时监控，所有区域的仪表板可见性以及自动化警报。\n*   对于事件响应，事件经理值班团队（Incident Manager OnCall teams）提供 24/7 全天候覆盖，并有明确的升级路径。\n*   商家沟通确保商店获得状态更新和任何问题的通知。\n*   实时优化（Live optimization）允许根据实时流量模式进行系统调优。\n*   BFCM 结束后，事后分析（post-mortem）流程将监控数据与实际商家结果关联起来，以了解哪些有效，哪些需要改进。\n\n理念很简单：准备让你做好准备，但卓越的运营能力让你保持稳定。\n\n### 结论\n\nShopify 的 2025 年 BFCM 备战计划展示了规模化系统准备的样貌。数千名工程师工作了九个月，进行了五次大规模压力测试，将基础设施推到了预期负载的 150%。他们执行了区域故障转移，进行了混沌工程演练，记录了系统漏洞，并在商家需要它们之前用更新的运行手册强化了系统。\n\n与典型的发布前准备不同之处在于其系统化的方法。大多数公司只进行一两次负载测试，修复关键 Bug，然后祈祷一切顺利。Shopify 花了九个月时间持续测试，发现突破点，修复问题，并验证修复措施是否实际有效。\n\n此外，Shopify 构建的工具并非临时的 BFCM 脚手架。弹性矩阵（Resiliency Matrix）、关键旅程 Game Days 和实时自适应预测（real-time adaptive forecasting）都成为了永久性的基础设施改进。它们使 Shopify 每天都更具弹性，而不仅仅是在高峰期。\n\n---\n\n### 要点总结\n\n*   **持续的容量规划与预测**：Shopify 从历史数据和商家增长预测出发，提前与云服务商协调资源，确保物理基础设施的供应。\n*   **三轨并行工作框架**：容量规划、基础设施路线图和风险评估三个轨道并行进行，相互反馈，形成持续改进的闭环。\n*   **Game Days 与混沌工程**：通过“Game Days”模拟真实生产故障，尤其关注“关键旅程”（如结账、支付），提前暴露系统脆弱点并培养团队的事件响应能力。\n*   **Resiliency Matrix（弹性矩阵）**：作为核心文档，集中记录服务状态、故障场景、恢复程序、操作手册和值班覆盖，指导系统强化工作。\n*   **专业负载测试工具**：使用自研工具 Genghis 模拟真实用户行为和流量突发，结合 Toxiproxy 注入网络故障，全面测试系统在高压和异常条件下的行为。\n*   **多区域生产基础设施测试**：负载测试在生产环境中跨多个 Google Cloud 区域并行运行，准确模拟全球流量模式。\n*   **优化策略**：当发现容量限制时，采取水平扩展、垂直扩展和代码/架构优化相结合的策略。\n*   **分析平台特殊挑战应对**：针对新建的、缺乏历史高峰流量数据的分析平台，通过专门的 Game Days 识别并解决了 Kafka 分区、API 内存、连接池超时和负载均衡策略等关键问题。\n*   **分阶段大规模压力测试**：在 BFCM 前的几个月内进行多轮分阶段的规模测试，从基线性能验证逐步升级到预测峰值（p90, p99），并执行区域故障转移，验证灾难恢复能力。\n*   **BFCM 周末运营计划**：强调实时监控、24/7 值班响应、商家沟通以及基于实时流量的动态优化，并通过事后分析持续学习和改进。\n\n### 你可以从这篇文章学到什么\n\n对于一个有几年经验的后端/系统设计工程师来说，这篇文章提供了宝贵的实践经验和系统性方法，远超出了“做负载测试”的表面理解。\n\n1.  **系统性思维和长周期准备**：文章强调了长达九个月的系统性准备工作，这表明大规模系统的弹性并非一蹴而就。它教导工程师应该将高可用性和可伸缩性视为一个持续的项目，而不是一次性的任务。你可以学习到如何在项目初期就将容量规划、架构演进和风险评估整合到开发流程中。\n2.  **混沌工程与真实性模拟**：Shopify 的“Game Days”和结合 Toxiproxy 的负载测试是混沌工程在生产环境准备中的典范。这不仅仅是测试系统“能跑多快”，更是测试系统“如何优雅地失败”。你可以借鉴这种方法，在自己的系统中引入故障注入，主动发现那些在正常操作下难以察觉的系统脆弱点，并为最坏情况做准备。\n3.  **“关键旅程”的识别与重点测试**：识别并重点测试业务最关键的路径（如结账、支付）是高效利用测试资源的关键。这提醒我们在设计和测试时，要始终以业务价值为导向，确保核心功能在极端负载下能够幸存。\n4.  **弹性矩阵（Resiliency Matrix）的实践价值**：将服务状态、故障场景、恢复程序、操作手册和值班计划集中文档化，形成“弹性矩阵”，是构建和维护高弹性系统的核心实践。这可以帮助工程师梳理系统的弱点、明确恢复步骤，并确保团队在紧急情况下能够迅速响应。\n5.  **未知场景的应对策略**：分析平台在 BFCM 2025 面临“无历史数据”的挑战，Shopify 仍通过专门的 Game Days 和有针对性的优化（Kafka 分区、API 内存、连接池、负载均衡）解决了问题。这展示了即使面对全新的系统或无先例的负载，也能通过系统性分析和实验来构建弹性的能力。\n6.  **迭代和多阶段测试**：Shopify 进行了五次大规模压力测试，逐步提升目标负载，并根据每次测试的结果进行迭代修复。这种循序渐进、不断发现和解决问题的测试策略，比一次性的大型测试更可靠。它鼓励工程师在项目生命周期中持续进行性能和弹性测试。\n7.  **运营卓越的重要性**：除了准备工作，BFCM 周末的实时监控、24/7 值班、自动化警报和动态优化，都体现了运营（Ops）在系统稳定性中的关键作用。这强调了“DevOps”理念，即开发和运营的紧密结合是确保系统在峰值表现的关键。\n\n总之，这篇文章提供了一份在极端流量和复杂环境下构建、测试和运营超大规模电商平台的“蓝图”。它不仅仅是关于技术栈的选择，更是关于组织、流程和文化的系统性工程。对于希望提升系统设计和工程实践能力的工程师而言，深入理解并尝试应用 Shopify 的这些方法，将大有裨益。",
    "url": "https://blog.bytebytego.com/p/how-shopify-prepares-for-black-friday"
  },
  {
    "id": "2025-12-24-how-shopify-prepares-for-black-friday",
    "title": "How Shopify Prepares for Black Friday",
    "date": "2025-12-24",
    "preview": "Shopify 如何备战黑色星期五  注：本文是与 Shopify 工程团队合作撰写的。特别感谢 Shopify 工程团队与我们分享了他们为黑色星期五网络星期一（BFCM）所做的准备工作细节，并审阅了文章终稿。本文中分享的所有技术细节均归功于 Shopify 工程团队。  202...",
    "content": "Shopify 如何备战黑色星期五\n\n注：本文是与 Shopify 工程团队合作撰写的。特别感谢 Shopify 工程团队与我们分享了他们为黑色星期五网络星期一（BFCM）所做的准备工作细节，并审阅了文章终稿。本文中分享的所有技术细节均归功于 Shopify 工程团队。\n\n2024 年的黑色星期五网络星期一（BFCM）对 Shopify 来说是一场盛事。该平台处理了 57.3 PB 的数据，处理了 10.5 万亿次数据库查询，其边缘网络（edge network）的峰值请求达到每分钟 2.84 亿次。仅在应用服务器上，他们每分钟就处理了 8000 万次请求，并在黑色星期五期间每分钟推送 12 TB 的数据。\n\n有趣的是，这种流量水平现在已成为 Shopify 的基线。而 2025 年的 BFCM 规模更大，处理了 90 PB 的数据，1.75 万亿次数据库写入，峰值性能达到每分钟 4.89 亿次请求。正因如此，Shopify 彻底重建了其 BFCM 准备计划。\n\n准备工作涉及数千名工程师，历时九个月，进行了五次大规模的扩展性测试。\n\n在本文中，我们将探讨 Shopify 如何为这场商业界的“超级碗”做好准备。\n\n### 三轨并行框架\n\nShopify 的 BFCM 准备工作从三月份开始，在 Google Cloud 上采用了多区域（multi-region）策略。\n\n工程团队将工作分为三个并行轨道（tracks），它们同时运行并相互影响：\n\n**容量规划（Capacity Planning）**涉及利用历史数据和商家增长预测来建模流量模式。团队会提早将这些估算提交给其云服务提供商，以确保提供商有足够的物理基础设施可用。这项规划定义了 Shopify 需要多少计算能力以及这些能力在地理上应如何分布。\n\n**基础设施路线图（Infrastructure Roadmap）**是团队审查其技术栈（technology stack），评估需要进行哪些架构更改，并确定为达到目标容量所需的系统升级。此轨道有助于安排所有后续工作的顺序。重要的是，Shopify 从不将 BFCM 作为发布截止日期。所有的架构变更和迁移都会在关键窗口（critical window）前数月完成。\n\n**风险评估（Risk Assessments）**使用“可能出现什么问题”（What Could Go Wrong）的练习来记录故障场景。团队设定升级优先级，并为他们所谓的“Game Days”（演练日）提供输入。这些信息有助于他们提前测试和强化系统。\n\n这三个轨道之间持续相互影响。例如，风险评估结果可能会揭示团队未考虑到的容量缺口。基础设施变更可能会引入需要评估的新风险。换句话说，这是一个持续的反馈循环。\n\n### 演练日（Game Days）\n\n为了正确评估风险，Shopify 工程团队会进行“演练日”。这些是混沌工程（chaos engineering）演练，旨在有意识地模拟 BFCM 规模下的生产故障。\n\n团队在早春就开始举办演练日。这包括故意向系统注入故障，以测试它们在故障条件下的响应方式。可以将其视为软件的消防演习。\n\n在这些演练日期间，工程团队会特别关注他们所谓的“关键业务路径”（critical journeys）。这些是其平台中最关键的业务路径：结账、支付处理、订单创建和履约。如果在 BFCM 期间这些路径中断，商家会立即蒙受销售损失。\n\n关键业务路径的演练日会运行跨系统（cross-system）的灾难模拟。以下是团队通常测试的一些方面：\n\n*   团队测试搜索和页面端点（endpoints），同时随机化导航以模仿真实用户行为。他们注入网络故障和延迟，以观察服务无法快速通信时会发生什么。\n*   他们“清除缓存”（bust caches），以创建真实的负载模式，而不是当所有内容都被缓存时获得的人工快速响应。\n*   前端团队在这些演练中进行“找 Bug 大会”（bug bashes）。他们识别回归问题（regressions），测试关键用户流，并验证用户体验在峰值负载条件下是否能保持稳定。\n\n这些演练通过暴露运维手册（operational playbooks）和监控工具中的不足，帮助团队建立事故响应的“肌肉记忆”。\n\n最重要的是，Shopify 在 BFCM 之前就填补了这些空白，而不是在商家最需要平台时才发现问题。演练日的所有发现都会汇总到 Shopify 所称的“弹性矩阵”（Resiliency Matrix）中。这是一个集中式文档，用于跟踪整个平台的漏洞、事故响应程序和修复措施。\n\n弹性矩阵包含五个关键组件：\n\n1.  首先是**服务状态（service status）**，显示所有关键服务的当前运行状态。\n2.  其次是**故障场景（failure scenarios）**，记录系统可能如何崩溃以及会产生什么影响。\n3.  第三是**恢复程序（recovery procedures）**，列出预期的恢复时间目标（recovery time objectives）和详细的问题修复操作手册（runbooks）。\n4.  第四是**运维手册（operational playbooks）**，包含分步式事故响应指南。\n5.  第五是**值班覆盖（on-call coverage）**，显示团队排班和 PagerDuty 升级路径。\n\n该矩阵成为 BFCM 前系统强化的路线图。团队全年持续更新它，记录弹性改进。\n\n### 使用 Genghis 和 Toxiproxy 进行负载测试\n\n演练日测试的是独立组件，但 Shopify 还需要知道整个平台是否能处理 BFCM 的流量。这就是负载测试（load testing）的作用。\n\n工程团队构建了一个名为 Genghis 的工具，它运行模拟真实用户行为的脚本化工作流。它模拟浏览、将商品添加到购物车和完成结账流程。该工具逐渐增加流量，直到系统崩溃，这有助于团队找到其实际容量限制。\n\n测试在生产基础设施（production infrastructure）上同时从三个 Google Cloud 区域运行：us-central、us-east 和 europe-west4。这准确模拟了全球流量模式。Genghis 还在基线负载之上注入“闪购”（flash sale）爆发流量，以测试峰值容量场景。\n\nShopify 将 Genghis 与 Toxiproxy 结合使用，Toxiproxy 是他们构建的一个用于模拟网络条件的开源框架。Toxiproxy 注入网络故障和分区，阻止服务之间相互通信。例如，网络分区（network partition）是指系统的两个部分失去通信能力，即使它们都在运行。\n\n在测试期间，团队会实时监控仪表盘（dashboards），并准备在系统开始降级时中止测试。多个团队协调工作，及时发现并修复瓶颈。\n\n当负载测试揭示了限制时，团队有三个选择：\n\n*   **横向扩展（Horizontal scaling）**意味着增加更多的应用实例。\n*   **纵向扩展（Vertical scaling）**意味着为每个实例提供更多资源，例如 CPU 和内存。\n*   **优化（Optimizations）**意味着进行架构层面的更改以提高性能，范围从更好的数据库查询到跨消费层（consuming layers）乃至前端的性能调优。\n\n这些决策设定了最终的 BFCM 容量，并推动了 Shopify 整个技术栈（stack）的优化工作。关键的见解是，团队不能等到 BFCM 才发现容量限制。扩展基础设施和优化代码需要数月的准备。\n\n### 分析平台挑战\n\nBFCM 会考验 Shopify 的每一个系统，但 2025 年带来了一个独特的挑战。其部分基础设施从未经历过假日流量，这带来了一个问题：当没有历史数据可供建模时，如何为峰值负载做准备？\n\n2024 年，Shopify 的工程团队重建了整个分析平台。他们创建了新的 ETL 管道（pipelines）。ETL 代表 Extract（提取）、Transform（转换）、Load（加载），这是一个从各种来源拉取数据、处理数据并将其存储到有用位置的过程。他们还更换了持久化层（persistence layer），并用全新的 API 替换了其旧系统。\n\n这造成了一种不对称性。ETL 管道在 2024 年 BFCM 期间运行过，因此团队拥有一整季的生产数据，显示这些管道在假日负载下的性能。但他们的 API 层是在高峰期结束后才上线的。他们正在为 BFCM 准备那些从未经历过假日流量的 API。\n\n这非常重要，因为在 BFCM 期间，商家会痴迷地查看他们的分析数据。他们需要实时的销售数字、转化率、流量模式和热门产品数据。所有这些查询都会命中 API 层。如果这些 API 无法处理负载，商家在最关键的销售期将失去可见性。\n\nShopify 专门为分析基础设施运行了演练日。这些是受控实验，旨在揭示故障模式和瓶颈。团队模拟增加的流量负载，引入数据库延迟，并测试缓存故障，以系统地绘制系统在压力下的行为。\n\n结果显示了四个需要修复的关键问题：\n\n1.  首先，ETL 管道需要增加 Kafka 分区（partitions），以在流量高峰期间保持数据新鲜度。Apache Kafka 是一个处理实时数据流的分布式流处理平台。更多的分区意味着更多的并行处理，从而使 API 可以提供更新鲜的数据。\n2.  其次，API 层的内存使用需要优化。团队通过性能分析（profiling）发现了这一点，性能分析是指精确测量代码如何使用内存。每个 API 请求使用了过多的内存。在高负载下，这会导致内存不足错误（out-of-memory errors）、响应时间变慢或完全崩溃。\n3.  第三，连接超时（connection timeouts）需要调整以防止连接池耗尽（pool exhaustion）。连接池（connection pool）是一组可重用的数据库连接。创建新连接的开销很大，因此应用程序会重用它们。问题在于超时时间过长，这意味着连接会一直处于等待状态。在高负载下，可用连接会耗尽，新的请求将开始失败。Shopify 调整了超时时间以更快地释放连接。\n4.  第四，团队通过不同的负载均衡器（load balancer）方法来拆分 API 请求。最初，API 请求会全部排队到一个区域，这增加了延迟和负载。通过扩展辅助区域的集群并更新负载均衡策略，他们更好地分配了工作，防止 API 服务器过载。\n\n除了性能修复之外，团队还验证了警报机制（alerting）并记录了响应程序。他们的团队都经过培训，为在实际事件中处理故障做好了准备。\n\n### 规模测试\n\n演练日和负载测试是为单个组件做准备，而规模测试（scale testing）则不同。它验证整个平台在 BFCM 流量下协同工作的情况，揭示只有当所有系统同时满负荷运行时才会出现的问题。\n\n从四月到十月，Shopify 按照其预测的流量水平，特别是峰值 p90 流量假设，进行了五次大规模测试。在统计学中，p90 表示第 90 百分位，即 90% 的请求量都低于此流量水平。\n\n以下是这些规模测试的详细信息：\n\n*   前两次测试根据 2024 年的实际数据验证了基线性能。\n*   第三到第五次测试逐步提高到 2025 年的预测，目标是去年负载的 150%。\n*   到第四次测试时，Shopify 达到了每分钟 1.46 亿次请求和每分钟超过 8 万次结账。在当年的最后一次测试中，他们测试了 p99 场景，达到了每分钟 2 亿次请求。\n\n这些测试规模异常庞大，因此 Shopify 在夜间运行它们，并与 YouTube 协调，因为这些测试会影响共享的云基础设施。团队测试的是弹性（resilience），而不仅仅是原始负载容量。他们执行了区域故障转移（regional failovers），从美国和欧盟的核心区域疏散流量，以验证其灾难恢复程序（disaster recovery procedures）确实有效。\n\nShopify 运行了四种类型的测试：\n\n*   **架构扩展测试（Architecture scale-up tests）**验证了其基础设施能够处理计划的容量。\n*   **正常运行期间的负载测试（Load tests during normal operations）**建立了峰值负载下的基线性能。\n*   **带故障转移的负载测试（Load tests with failover）**验证了灾难恢复和跨区域故障转移能力。\n*   **演练日模拟（Game Day simulations）**通过混沌工程测试了跨系统的弹性。\n\n团队模拟了真实用户行为，例如店面浏览和结账、来自应用程序和集成的管理 API 流量、分析和报告负载以及后端 Webhook 处理。他们还测试了关键场景，如持续峰值负载、区域故障转移以及多个系统同时失败的级联故障（cascading failures）。\n\n每个测试周期都识别出在稳态负载下永远不会出现的问题，并且团队随着问题的出现而修复它们。一些关键问题如下：\n\n*   规模测试 1 和 2 揭示了在重负载下，核心操作会抛出错误，并且结账队列（checkout queues）会积压。\n*   规模测试 3 验证了关键迁移，并确认了基础设施变更后区域路由（regional routing）行为符合预期。\n*   规模测试 4 达到了限制，触发了计划外的故障转移，识别了测试流量路由中的优先问题，并发现了在重新平衡期间将区域重新上线时的延迟。\n*   规模测试 5 进行了全面预演，是唯一一次在北美工作时间运行的测试，以模拟真实的 BFCM 条件。所有其他测试都在夜间运行。\n\n在项目中期，Shopify 做出了一个重要的转变。他们将**认证结账流程（authenticated checkout flows）**添加到了测试场景中。模拟真实登录买家暴露了匿名浏览从未触及的限速代码路径。尽管认证流程只占流量的一小部分，但它们揭示了在实际事件中会导致问题的瓶颈。\n\n### BFCM 周末运营\n\nBFCM 的准备工作让 Shopify 做好了准备，但卓越的运营（operational excellence）确保他们在流量真正高峰时保持稳定。\n\n运营计划协调工程团队、事故响应和实时系统调优。以下是该计划的关键组成部分：\n\n*   BFCM 周末的计划包括实时监控（real-time monitoring），提供所有区域的仪表盘可见性（dashboard visibility）和自动化警报（automated alerts）。\n*   对于事故响应，事故经理（Incident Manager）值班团队提供 24/7 全天候覆盖，并有明确的升级路径。\n*   商家沟通确保商店获得状态更新和任何问题的通知。\n*   实时优化（Live optimization）允许根据实时流量模式进行系统调优。\n*   BFCM 结束后，事后分析（post-mortem）过程将监控数据与实际商家结果关联起来，以了解哪些方法有效以及哪些地方需要改进。\n\n理念很简单：准备让你做好准备，但卓越的运营让你保持稳定。\n\n### 结论\n\nShopify 2025 年的 BFCM 准备计划展示了大规模系统准备工作是怎样的。数千名工程师工作了九个月，进行了五次大规模的扩展性测试，将其基础设施推向了预期负载的 150%。他们执行了区域故障转移，运行了混沌工程演练，记录了系统漏洞，并在商家需要之前，用更新的操作手册强化了系统。\n\n这与典型的发布前准备不同之处在于其系统化的方法。大多数公司进行一两次负载测试，修复关键 bug，然后寄希望于最佳结果。Shopify 则花费了九个月的时间持续测试，发现系统崩溃点，修复问题，并验证修复措施确实有效。\n\n此外，Shopify 构建的工具并非临时的 BFCM 支撑结构。弹性矩阵（Resiliency Matrix）、关键业务路径演练日（Critical Journey Game Days）和实时自适应预测（real-time adaptive forecasting）都成为了永久性的基础设施改进。它们使 Shopify 每天都更具弹性，而不仅仅是在高峰期。\n\n为了提供 BFCM 的可视化效果，Shopify 还推出了一款有趣的弹珠游戏，以展示 Shopify Live Globe。该游戏本身在浏览器中以 120fps 运行，拥有完整的 3D 环境、物理引擎和 VR 支持。在幕后，这款游戏是一个使用“react-three-fiber”构建的 three.js 应用程序。每一笔商家销售都会在几秒钟后显示在这个地球仪上。\n\n参考资料：\n*   How we prepare Shopify for BFCM (Shopify 如何为 BFCM 做准备)\n*   Extract, Transform, Load (提取、转换、加载 - ETL)\n*   Toxiproxy\n*   Shopify Live Globe\n*   Details about the Shopify Live Globe Pinball Game (关于 Shopify Live Globe 弹珠游戏的详细信息)\n\n---\n\n### 要点总结\n\n*   Shopify 采用系统化的“三轨并行框架”准备 BFCM：容量规划、基础设施路线图和风险评估，三者持续相互反馈。\n*   通过“演练日”（Game Days）进行混沌工程，模拟生产故障，特别关注结账、支付等“关键业务路径”。\n*   建立了“弹性矩阵”（Resiliency Matrix）作为集中的文档，记录服务状态、故障场景、恢复程序、运维手册和值班安排，指导系统强化。\n*   使用自研工具 Genghis 进行全平台负载测试，模拟真实用户行为和闪购流量，并通过 Toxiproxy 模拟网络故障。\n*   负载测试中发现容量限制时，采取横向扩展、纵向扩展或架构优化等策略。\n*   对新构建的分析平台，通过专门的演练日识别并解决了 Kafka 分区不足、API 内存使用过高、连接超时及负载均衡不合理等问题。\n*   从四月到十月进行了五次大规模测试，覆盖 p90 和 p99 峰值流量，并执行了区域故障转移，验证灾难恢复能力。\n*   测试场景中增加了认证结账流程，揭示了匿名浏览无法触及的限速瓶颈。\n*   BFCM 期间的运营侧重于实时监控、自动化警报、24/7 事故响应、商家沟通和实时系统调优，并通过事后分析持续改进。\n*   所建立的弹性矩阵、演练日和实时自适应预测等机制是永久性的基础设施改进，而非临时措施，持续提升系统弹性。\n\n---\n\n### 你可以从这篇文章学到什么\n\n对于一个拥有几年经验的后端/系统设计工程师来说，这篇文章提供了一个大型电商平台如何系统性地应对流量洪峰的宝贵案例。你可以从中学习到以下几点，并应用于实际工作中：\n\n1.  **分阶段、系统化的准备方法**：Shopify 的“三轨并行框架”——容量规划、基础设施路线图和风险评估——展示了如何在早期并行开展多项工作，并形成反馈闭环。这对于任何大型项目的准备都非常有借鉴意义，它强调了规划、实施和风险管理需同步进行，而非线性推进。\n\n2.  **混沌工程与“关键业务路径”**：文章详细介绍了“演练日”如何通过故意注入故障来测试系统弹性，并强调了聚焦“关键业务路径”（如结账、支付）的重要性。在你的系统设计中，识别并持续测试最核心的业务流程，能够确保在极端情况下业务不受致命影响。你可以将混沌工程的理念引入自己的测试策略，而不仅仅是简单的单元测试和集成测试。\n\n3.  **可操作的“弹性矩阵”**：弹性矩阵作为集中式文档，涵盖了服务状态、故障场景、恢复程序、运维手册和值班覆盖。这提供了一个构建自身灾难恢复和应急响应体系的清晰蓝图。一个详尽且持续更新的矩阵，能够显著提高团队在突发事件中的响应效率和准确性。\n\n4.  **精细化的负载与规模测试**：Genghis 和 Toxiproxy 这类工具的运用，以及多区域、多场景（正常负载、闪购爆发、带故障转移）的测试方法，展示了如何真实地模拟生产环境。尤其是对新系统（如分析平台 API）没有历史数据的情况，通过专门的演练日来发现和解决问题，提供了应对“数据盲点”的有效策略。在你的项目中，即使没有自研工具，也可以利用现有的负载测试工具和混沌工程框架，设计更贴近真实世界的测试方案。\n\n5.  **深入的问题分析与解决**：文章中分析平台遇到的四个问题及其解决方案（Kafka 分区调整、API 内存优化、连接超时调优、负载均衡策略调整），都是后端工程师在日常工作中可能遇到的典型性能瓶颈。了解这些具体的优化手段，能帮助你在面对类似问题时，有更清晰的排查思路和解决方案。\n\n6.  **早期发现和持续改进**：Shopify 强调不能等到峰值才发现问题，而是要提前数月持续测试和修复。这种“持续测试-发现-修复-验证”的循环，以及将临时应对措施转化为永久性基础设施改进（如弹性矩阵成为日常工具）的理念，是提升系统长期稳定性和可维护性的关键。\n\n总之，这篇文章不仅仅是关于如何应对黑色星期五，更是关于如何构建一个高度弹性、可伸缩且运维卓越的大规模分布式系统。它鼓励工程师从更宏观的视角去思考系统准备、风险管理和持续改进。",
    "url": "https://blog.bytebytego.com/p/how-shopify-prepares-for-black-friday"
  }
]