[
  {
    "id": "2025-12-16-top-ai-agentic-workflow-patterns",
    "title": "Top AI Agentic Workflow Patterns",
    "date": "2025-12-16",
    "preview": "# 顶级 AI Agentic 工作流模式  ByteByteGo 2025年12月15日  用提示词（prompts）进行修改只能达到有限的效果。(赞助)  大多数公司都陷入了对提示词的反复修改中，却不明白为什么他们的代理（agents）无法提供可靠的结果。 这份来自 You....",
    "content": "# 顶级 AI Agentic 工作流模式\n\nByteByteGo\n2025年12月15日\n\n用提示词（prompts）进行修改只能达到有限的效果。(赞助)\n\n大多数公司都陷入了对提示词的反复修改中，却不明白为什么他们的代理（agents）无法提供可靠的结果。\n这份来自 You.com 的指南\n详细阐述了代理管理的演变过程，揭示了构建成功 AI 代理的五个阶段，以及为什么大多数组织尚未达到这一阶段。\n在这份指南中，你将学到：\n*   为什么仅仅依靠提示词是不够的，以及上下文和元数据如何解锁可靠的代理自动化。\n*   计算投资回报率（ROI）的四种基本方法，以及何时、如何使用每种指标。\n*   代理管理每个阶段的实际挑战以及如何避免它们。\n超越提示词：获取指南。\n\n当我们首次与大语言模型（large language models）交互时，体验是直接了当的。我们输入一个提示词，模型生成一个响应，交互结束。\n这种单轮交互方式（single-turn approach）对于简单问题或基础内容生成非常有效，但当我们处理更复杂的任务时，其局限性很快就会显现出来。想象一下，要求 AI 分析市场趋势，创建一份全面的报告，并提供可行的建议。一个单一的响应，无论制作得多么精良，通常都会力不从心，因为它缺乏收集额外信息、反思其推理过程或根据反馈完善其输出的机会。\n这就是 **Agentic 工作流** 发挥作用的地方。\n\nAgentic 工作流不是将 AI 交互视为一次性交易，而是引入了迭代过程（iterative processes）、工具集成（tool integration）和结构化问题解决方法（structured problem-solving approaches）。这些工作流将语言模型从复杂的文本生成器转变为有能力的代理，它们能够分解复杂问题、调整策略并生成更高质量的结果。这种差异类似于将快速草图与精心打磨的画作进行比较。两者都有其用途，但当质量和可靠性至关重要时，迭代方法才是赢家。\n\n在本文中，我们将探讨最流行的 Agentic 工作流模式及其工作原理。\n\n## 理解 Agentic 工作流\n\n一个 Agentic 工作流不仅仅响应一个指令。相反，它以一定程度的自主性（autonomy）运作，决定如何处理任务、采取哪些步骤以及如何根据其沿途发现进行调整。这代表了我们思考如何使用 AI 系统的根本性转变。\n\n考虑一下请求一个基本聊天机器人和一个 Agentic 系统来帮助撰写研究报告的区别。基本的聊天机器人接收我们的请求，并根据其训练数据生成报告，以一个响应的形式交付其产物。然而，一个 Agentic 系统可能会首先在网上搜索该主题的最新信息，然后将发现整理成主题，起草报告的各个部分，审查每个部分的准确性和连贯性，修改薄弱区域，最后将所有内容编译成一份精美的文档。这些步骤中的每一个都可能涉及多个子步骤、关于使用哪些工具的决策以及根据代理发现进行的调整。\n\n使工作流真正具有 Agentic 特性的是过程中内置的迭代和反馈循环（feedback loops）。Agentic 工作流不是一次性生成输出，而是涉及代理采取行动、观察结果，并利用该观察结果来指导下一次行动的循环。这反映了人类实际解决复杂问题的方式。我们很少预先解决所有问题并执行完美的计划。相反，我们尝试一些事情，看看会发生什么，从结果中学习，然后调整我们的方法。Agentic 工作流将这种适应性、迭代性带入了 AI 系统。\n\n## 五种基本 Agentic 工作流模式\n\n现在让我们看看五种基本的 Agentic 工作流模式：\n\n### 反思模式 (Reflection Pattern)：自我改进的代理\n\n反思的核心是让代理审查和批判自己的工作，然后根据批判进行修改。这个简单的想法通过引入迭代细化过程来提高输出质量，该过程可以发现错误，识别弱点，并增强优势。\n\n以下是反思循环在实践中如何运作：\n代理首先根据它收到的任务或提示词生成一个初始输出。\n然后，代理不立即将此输出作为最终结果呈现，而是切换到批判模式（critique mode）。它检查自己刚刚生成的内容，寻找问题、不一致、缺乏清晰度的区域或改进的机会。这种批判成为修改的基础。\n代理生成一个改进版本，解决它识别出的问题。根据实现方式，这个循环可能会重复多次，每次迭代都会进一步完善输出。\n\n请看下面的图表：\n*(此处应有一张示意图，展示“生成 -> 批判 -> 改进”的循环)*\n\n当我们专门化所执行的批判类型时，反思的力量会变得更加明显。以下是一些例子：\n*   代理可能会专门反思**准确性**，检查其陈述的事实和主张是否正确且有充分支持。\n*   或者，反思可能侧重于**清晰度**，询问不熟悉该主题的人是否能理解解释。\n*   对于创意写作，反思可能会评估**语气**，确保声音与预期风格和受众匹配。\n*   对于代码生成，反思可能侧重于识别错误（bugs）、安全漏洞或优化性能的机会。\n\n反思模式最适用于质量比速度更重要，并且存在受益于审查的主观方面的任务。然而，对于答案简单明了的简单、事实性查询，或者对于速度至关重要且“足够好”确实足够的任务，这种模式则不太必要。\n\n### 工具使用模式 (Tool Use Pattern)\n\n工具使用模式代表了 AI 代理能够完成的任务的根本性扩展。\n\n一个语言模型本身，无论多么复杂，都局限于推理其在训练期间学到的信息，并根据该知识生成文本。它无法访问当前信息，无法用大量数字进行精确计算，无法从特定数据库检索数据，也无法与外部系统交互。工具改变了一切。\n\n在工具使用模式中，代理配备了一组可在需要时调用的功能。这些功能可能包括用于查找当前信息的网络搜索引擎、用于访问天气数据或股票价格等服务的 API、用于运行程序和执行计算的代码解释器（code interpreters）、用于检索特定记录的数据库查询工具（database query tools）、用于读写文档的文件系统访问（file system access），以及无数其他专业功能。与传统软件的关键区别在于，代理本身根据手头的任务决定何时以及如何使用这些工具。\n\n请看下面的图表：\n*(此处应有一张示意图，展示“代理 -> 决策 -> 工具调用 -> 观察结果”的循环)*\n\n当代理收到任务时，它会分析完成该任务需要哪些功能。例如：\n*   如果任务需要代理不具备的信息，它会识别出需要搜索或数据检索工具。\n*   如果任务涉及数学运算，它会访问计算器或代码解释器。\n*   如果任务需要与特定服务交互，它会使用相应的 API 工具。\n\n工具使用的强大之处在于工具选择的动态性质以及将多个工具调用链接在一起的能力。\n\n代理不遵循预先确定的脚本。如果第一次搜索没有返回足够的信息，代理可能会重新组织其查询并再次搜索。如果 API 调用失败或返回错误，代理可能会尝试替代方法或完全不同的工具。这种适应性使得启用工具的代理比僵化的自动化工作流能力强大得多。\n\n### 推理与行动模式 (Reason and Act Pattern - ReAct)\n\n推理与行动模式，通常称为 ReAct，代表了一种结合了显式推理和迭代行动的复杂问题解决方法。ReAct 代理不是在行动之前思考整个计划，也不是不加思考地盲目行动，而是交替进行推理下一步要做什么和实际执行。这种思维和行动的交织创造了一种自然的、自适应的问题解决过程。\n\nReAct 循环遵循清晰的模式：\n首先，代理推理当前情况以及需要完成的任务。这一推理步骤是显式的，通常字面上写出作为代理的内部思维过程。代理可能会思考它拥有什么信息，它还需要什么，哪些方法可能有效，以及最佳的下一步是什么。\n然后，基于此推理，代理采取一个行动。这可能是使用工具收集信息，执行计算，或做出决定。\n行动之后，代理观察结果并进入一个新的推理阶段，思考它学到了什么以及下一步要做什么。这个循环持续进行，直到代理确定它已完成目标或达到无法进一步进行的地步。\n\n请看下面的图表：\n*(此处应有一张示意图，展示“思考 -> 行动 -> 观察 -> 思考”的循环)*\n\n显式推理步骤有多个重要目的。\n首先，它们帮助代理保持专注并专注于目标。通过阐明它试图完成什么以及为什么每个行动都有意义，代理不太可能走上无关的路径或陷入无成效的循环。\n其次，推理步骤支持适应。当一个行动没有产生预期结果时，推理阶段允许代理诊断原因并调整其方法，而不是盲目继续。\n第三，推理轨迹提供了透明度。用户和开发者不仅可以看到代理做了什么，还可以看到它为什么做出这些选择，这对于信任、调试和理解代理的决策过程非常有价值。\n\n将 ReAct 与纯计划或纯执行进行比较可以突出其优点。\n纯计划意味着在采取任何行动之前确定所有步骤。当信息完整且环境可预测时，这很有效，但当我们需要在过程中发现信息或情况发生变化时，它就会遇到困难。\n纯执行意味着不经太多思考就采取行动，这很快但往往效率低下且容易出错。\nReAct 找到了一个中间地带，通过推理提供了足够的结构，同时通过迭代行动保持了灵活性。\n\n### 规划模式 (Planning Pattern)\n\n规划模式与 ReAct 采取了不同的方法，它强调在执行开始之前进行前期战略性思考。\n\n在使用规划模式时，代理首先分析总体目标并理解成功的样子。然后，它将这个目标分解为更小、更易于管理的子任务。这种分解持续进行，直到代理确定了具体、可操作的步骤。\n关键是，代理识别任务之间的依赖关系，确定哪些步骤必须在其他步骤开始之前完成，以及哪些步骤可以并行发生。代理还考虑每个步骤将需要哪些资源、工具或信息。只有在创建了这个结构化计划之后，代理才开始执行。\n\n请看下面的图表：\n*(此处应有一张示意图，展示“目标 -> 分解 -> 规划 -> 执行”的流程)*\n\n规划模式的一个关键优势是自适应规划（adaptive planning）。\n*(原文此处只有“One of the planning pattern’s key strengths is adaptive planning.”，无具体展开，我将自行补充一点以保持连贯性)*\n即使有了初步计划，代理也能在执行过程中根据新发现或环境变化调整计划，从而保持灵活性。\n\n规划模式最适用于具有自然阶段或步骤的任务，其中某些活动在逻辑上先于其他活动。它对于有截止日期、预算或资源限制等约束的任务非常有价值，这些任务中协调至关重要。它在错误或回溯代价高昂的情况下表现出色，因此值得投入时间进行周密的规划。涉及多个工作流的复杂项目从规划中受益匪多。\n\n然而，规划模式也有局限性：\n对于简单的线性任务，其中每个步骤自然地暗示下一个步骤，创建正式计划的开销几乎没有带来任何好处。\n对于高度不确定的任务，我们很可能在执行过程中发现根本性地改变方法的重要信息，过多的前期规划可能是一种浪费。\n\n### 多代理模式 (Multi-Agent Pattern)\n\n多代理模式可能代表了构建 AI 系统最复杂的方法。\n\n这种模式不依赖单一代理处理所有事情，而是使用多个专门的代理协同完成任务。每个代理都具有特定的专业知识、能力或视角，它们像人类团队一样协同工作。\n\n多代理系统背后的核心洞察是，专业化通常比泛化带来更好的性能。\n\n一个试图在所有方面都表现出色的单一代理面临挑战。它必须在其设计和训练中平衡相互竞争的需求。它需要广泛的知识，但也需要深厚的专业知识。它必须富有创造性，但也要具有批判性。通过在多个代理之间划分职责，每个代理都可以针对其特定角色进行优化。\n\n在多代理系统中，我们通常会看到几种类型的角色。\n有专注于特定领域或任务的**专家代理（specialist agents）**，例如擅长查找和综合信息的研究代理、优化编写和调试代码的编码代理，或者擅长统计分析和可视化的数据分析代理。\n通常还有**评论或审查代理（critics or review agents）**，其工作是评估其他代理的输出，识别缺陷，提出改进建议或验证质量。\n通常会有一个**协调或编排代理（coordinator or orchestrator agent）**来管理整个工作流，决定哪个专家应该处理每个子任务，并确保所有部分连贯地结合在一起。\n\n多代理模式引入了复杂的权衡：\n*   随着代理数量的增加，协调开销也会增加。\n*   代理之间的通信需要清晰的协议。\n*   调试变得更具挑战性，因为问题可能源于代理之间的交互，而不是单个代理的错误。\n\n收益必须足以证明这些成本是合理的。对于简单任务，一个能力强的单一代理几乎总是更好的。对于需要多样化专业知识、细致协调或多重视角的复杂任务，多代理方法通常会产生卓越的结果，尽管其增加了复杂性。\n\n## 结论\n\n各种 Agentic 工作流模式代表了我们构建和部署 AI 系统方式的根本性演变。\n\n从简单的提示词发展到复杂的迭代过程，已经改变了 AI 代理能够可靠完成的任务。以下是我们涵盖的模式的快速总结：\n*   **反思模式** 通过自我改进确保质量。\n*   **工具使用** 将能力扩展到纯语言生成之外。\n*   **ReAct** 将周密的推理与自适应行动相结合。\n*   **规划模式** 为复杂任务带来战略性思考。\n*   **多代理协作** 利用专业化和多样化的视角。\n\n总而言之，这些模式为构建能够处理真实世界复杂性的 AI 系统提供了强大的工具包。\n\n这些模式之所以特别强大，是因为它们并非相互排斥。最复杂的代理系统通常会结合多种模式来实现其目标。\n\n赞助我们\n让您的产品呈现在超过1,000,000名技术专业人士面前。\n我们的时事通讯将您的产品和服务直接呈现在一个重要的受众面前——数十万工程领导者和高级工程师——他们对重要的技术决策和重大采购具有影响力。\n席位迅速满额——今天就预订\n广告位通常提前约4周售罄。为确保您的广告触达这一有影响力的受众，请立即发送电子邮件至 sponsorship@bytebytego.com 预订您的空间。\n\n---\n\n## 要点总结\n\n*   传统的单轮提示词交互在大语言模型中存在局限性，难以处理复杂任务。\n*   Agentic 工作流通过引入迭代过程、工具集成和结构化问题解决，使 AI 代理具备更强的自主性和适应性。\n*   Agentic 工作流的核心是迭代和反馈循环，模仿人类解决复杂问题的方式。\n*   **反思模式 (Reflection Pattern)**：代理通过自我审查和批判来迭代改进其输出，提升质量。\n*   **工具使用模式 (Tool Use Pattern)**：代理能够动态调用外部工具（如搜索引擎、API、代码解释器）来扩展其能力，获取实时信息或执行特定操作。\n*   **推理与行动模式 (Reason and Act Pattern - ReAct)**：代理交替进行显式推理和实际行动，通过观察结果来调整策略，实现自适应问题解决。\n*   **规划模式 (Planning Pattern)**：代理在执行前进行战略性思考，将复杂目标分解为子任务，并识别依赖关系和所需资源，适用于需要周密安排的任务。\n*   **多代理模式 (Multi-Agent Pattern)**：通过多个专业化代理的协作来完成任务，每个代理专注于特定领域，通常由一个协调代理进行管理。\n*   这些 Agentic 模式并非相互排斥，最复杂的 AI 系统通常会结合多种模式以实现更高级的功能和可靠性。\n\n## 你可以从这篇文章学到什么\n\n对于具有几年经验的后端/系统设计工程师来说，这篇文章提供了关于构建更智能、更鲁棒的 AI 驱动系统的新视角和实用框架，远超简单的 API 调用或提示词工程。\n\n1.  **超越“调用 LLM API”的思维定式**：你可能已经知道如何通过 API 调用大语言模型（LLM）来获取文本响应。但这篇文章告诉你，这仅仅是冰山一角。Agentic 工作流模式提供了一种更结构化、更智能的方式来集成 AI，使其能够像一个有思想的实体一样运作，而不仅仅是一个数据转换器。\n\n2.  **设计具备自主决策能力的微服务**：想象你的一个微服务不只是简单地执行预设逻辑，而是能根据输入动态地决定“我需要调用哪个外部服务来获取信息？”、“这个计算应该如何进行？”、“我是否应该检查一下我的输出是否有错？”。这就是将微服务设计成一个“代理”的思维。你可以运用 **ReAct 模式** 来构建这样的服务，使其能够自主推理、采取行动、观察结果并自适应地推进复杂业务流程。\n\n3.  **构建更可靠、自修复的系统**：**反思模式** 在系统设计中具有巨大潜力。你可以设计一个监控代理，它不仅收集日志和指标，还能像文章中描述的那样，“反思”这些数据，找出异常模式，甚至提出（或自动实施）修复方案。例如，一个代理可以审查某个部署版本的性能报告，识别瓶颈，并建议优化配置或回滚。这有助于构建更具韧性（resilience）和自愈能力（self-healing）的系统。\n\n4.  **利用外部工具扩展系统能力**：你的后端系统常常需要与各种外部服务（第三方 API、数据库、文件存储等）交互。**工具使用模式** 揭示了如何让 AI 代理智能地选择和调用这些工具。这意味着你可以构建一个通用代理，它能根据用户请求或系统状态，动态决定是调用支付 API、数据库查询服务还是其他任何内部或外部工具，从而避免硬编码大量的条件判断逻辑。\n\n5.  **处理复杂、多阶段的业务流程**：对于涉及多个步骤和依赖关系的复杂业务流程，**规划模式** 提供了清晰的指导。你可以设计一个智能工作流引擎，它首先制定详细的执行计划（例如，订单处理、供应链优化），然后监督执行。当计划因外部因素（如库存变化）而需要调整时，自适应规划的理念能让你的系统更加灵活。\n\n6.  **架构更复杂的分布式智能系统**：当一个任务过于庞大，单一组件难以胜任时，**多代理模式** 提供了一种分布式、协同的架构思路。你可以将一个复杂的任务分解给多个专门的微服务（每个服务都是一个代理），例如一个数据收集代理、一个数据分析代理、一个报告生成代理，以及一个协调代理来管理整个流程。这类似于你在设计传统分布式系统时，将功能拆分到不同的服务中，但这里每个服务都拥有更高的智能和决策力。\n\n通过学习这些模式，你将能够更好地理解如何将 AI 不仅仅作为功能模块集成到你的系统中，而是作为更具主动性和智能的“参与者”，从而设计出能够应对真实世界复杂性和不确定性、更加自动化和智能的后端系统。这对于提升系统自治能力、降低运营成本和提高业务响应速度都至关重要。",
    "url": "https://blog.bytebytego.com/p/top-ai-agentic-workflow-patterns"
  }
]